/* Торговый центр 'Радуга' Кемерово, этаж 1 (путь '/maps/scheme/1/floor1/') */
var s1_f1 = {
	area_1: {
		href: '',
		title: 'Adidas',
		space: '1',
		type: 't3',
		path: 'M 4 106 L 4 208 L 19 208 L 34 208 L 34 211 L 34 214 L 105 214 L 176 214 L 176 116 L 176 18 L 253.5 18 L 331 18 L 331 11 L 331 4 L 167.5 4 L 4 4 L 4 106Z'
	},
	area_2: {
		href: 'http://sideful.ru',
		title: 'Modis',
		space: '2',
		type: 't9',
		path: 'M 179 160 L 179 299 L 234.5 299 L 290 299 L 290 290.5 L 290 282 L 310.5 282 L 331 282 L 331 151.5 L 331 21 L 255 21 L 179 21 L 179 160Z'
	},
	area_3: {
		href: 'http://sideful.ru',
		title: 'Calzedonia',
		space: '3',
		type: 't9',
		path: 'M 37 369 L 37 390 L 74.5 390 L 112 390 L 112 369 L 112 348 L 74.5 348 L 37 348 L 37 369Z'
	},
	area_7: {
		href: 'http://sideful.ru',
		title: 'Galasport',
		space: '7',
		type: 't3',
		path: 'M 4 280 L 4 301 L 58 301 L 112 301 L 112 280 L 112 259 L 58 259 L 4 259 L 4 280Z'
	},
	area_9: {
		href: 'http://sideful.ru',
		title: 'Концепт клаб',
		space: '9',
		type: 't9',
		path: 'M 4 347 L 4 390 L 19 390 L 34 390 L 34 367.5 L 34 345 L 73 345 L 112 345 L 112 324.5 L 112 304 L 58 304 L 4 304 L 4 347Z'
	},
	area_10: {
		href: 'http://sideful.ru',
		title: 'Stayer',
		space: '10',
		type: 't3',
		path: 'M 293 293.5 L 293 302 L 236 302 L 179 302 L 179 323.5 L 179 345 L 227.5 345 L 276 345 L 276 367.5 L 276 390 L 303.5 390 L 331 390 L 331 337.5 L 331 285 L 312 285 L 293 285 L 293 293.5Z'
	},
	area_11: {
		href: 'http://sideful.ru',
		title: 'Zolla',
		space: '11',
		type: 't9',
		path: 'M 4 458 L 4 523 L 58 523 L 112 523 L 112 458 L 112 393 L 58 393 L 4 393 L 4 458Z'
	},
	area_12: {
		href: 'http://sideful.ru',
		title: 'Кари',
		space: '12',
		type: 't13',
		path: 'M 179 391.5 L 179 435 L 255 435 L 331 435 L 331 414 L 331 393 L 302 393 L 273 393 L 273 370.5 L 273 348 L 226 348 L 179 348 L 179 391.5Z'
	},
	area_13: {
		href: 'http://sideful.ru',
		title: 'Календарь подарков',
		space: '13',
		type: 't16',
		path: 'M 179 459.5 L 179 481 L 199.5 481 L 220 481 L 220 459.5 L 220 438 L 199.5 438 L 179 438 L 179 459.5Z',
		tip: true
	},
	area_14: {
		href: 'http://sideful.ru',
		title: 'Пеликан',
		space: '14',
		type: 't7',
		path: 'M 223 459.5 L 223 481 L 249.5 481 L 276 481 L 276 459.5 L 276 438 L 249.5 438 L 223 438 L 223 459.5Z'
	},
	area_15: {
		href: 'http://sideful.ru',
		title: 'Золото 585',
		space: '15',
		type: 't6',
		path: 'M 4 547.5 L 4 569 L 58 569 L 112 569 L 112 547.5 L 112 526 L 58 526 L 4 526 L 4 547.5Z'
	},
	area_17: {
		href: 'http://sideful.ru',
		title: 'Метелица',
		space: '17',
		type: 't11',
		path: 'M 4 593 L 4 614 L 58 614 L 112 614 L 112 593 L 112 572 L 58 572 L 4 572 L 4 593Z'
	},
	area_18: {
		href: 'http://sideful.ru',
		title: 'МТС',
		space: '18',
		type: 't1',
		path: 'M 180 546.5 L 180 569 L 200 569 L 220 569 L 220 546.5 L 220 524 L 200 524 L 180 524 L 180 546.5Z'
	},
	area_19: {
		href: 'http://sideful.ru',
		title: 'Магнит чудес',
		space: '19',
		type: 't16',
		path: 'M 180 592 L 180 612 L 200 612 L 220 612 L 220 592 L 220 572 L 200 572 L 180 572 L 180 592Z'
	},
	area_20: {
		href: 'http://sideful.ru',
		title: 'Много мебели',
		space: '20',
		type: 't2',
		path: 'M 223 568 L 223 612 L 248 612 L 273 612 L 273 568 L 273 524 L 248 524 L 223 524 L 223 568Z'
	},
	area_21: {
		href: 'http://sideful.ru',
		title: 'Белвест',
		space: '21',
		type: 't13',
		path: 'M 276 568 L 276 612 L 302.5 612 L 329 612 L 329 568 L 329 524 L 302.5 524 L 276 524 L 276 568Z'
	},
	area_22: {
		href: 'http://sideful.ru',
		title: 'Читай город',
		space: '22',
		type: 't8',
		path: 'M 381 568 L 381 612 L 422 612 L 463 612 L 463 568 L 463 524 L 422 524 L 381 524 L 381 568Z'
	},
	area_24: {
		href: 'http://sideful.ru',
		title: 'Русская охота',
		space: '24',
		type: 't16',
		path: 'M 466 568 L 466 612 L 486.5 612 L 507 612 L 507 568 L 507 524 L 486.5 524 L 466 524 L 466 568Z'
	},
	area_25: {
		href: 'http://sideful.ru',
		title: 'Сыночки и дочки',
		space: '25',
		type: 't10',
		path: 'M 510 568 L 510 612 L 531 612 L 552 612 L 552 568 L 552 524 L 531 524 L 510 524 L 510 568Z'
	},
	area_26: {
		href: 'http://sideful.ru',
		title: 'Лэтуаль',
		space: '26',
		type: 't5',
		path: 'M 555 568 L 555 612 L 598.5 612 L 642 612 L 642 573.5 L 642 535 L 620.5 535 L 599 535 L 599 529.5 L 599 524 L 577 524 L 555 524 L 555 568Z'
	},
	area_27: {
		href: 'http://sideful.ru',
		title: 'Парадис',
		space: '27',
		type: 't16',
		path: 'M 645 553.5 L 645 572 L 667 572 L 689 572 L 689 553.5 L 689 535 L 667 535 L 645 535 L 645 553.5Z'
	},
	area_28: {
		href: 'http://sideful.ru',
		title: 'Гудвин',
		space: '28',
		type: 't16',
		path: 'M 736 534 L 736 546 L 756 546 L 776 546 L 776 534 L 776 522 L 756 522 L 736 522 L 736 534Z'
	},
	area_29: {
		href: 'http://sideful.ru',
		title: 'Эдельвейс',
		space: '29',
		type: 't15',
		path: 'M 736 567.5 L 736 586 L 757.5 586 L 779 586 L 779 599 L 779 612 L 800.5 612 L 822 612 L 822 580.5 L 822 549 L 779 549 L 736 549 L 736 567.5Z'
	},
	area_30: {
		href: 'http://sideful.ru',
		title: 'Профи центр',
		space: '30',
		type: 't5',
		path: 'M 779 534 L 779 546 L 800.5 546 L 822 546 L 822 534 L 822 522 L 800.5 522 L 779 522 L 779 534Z'
	},
	area_32: {
		href: 'http://sideful.ru',
		title: 'KFC',
		space: '32',
		type: 't17',
		path: 'M 825 567 L 825 612 L 890.5 612 L 956 612 L 956 567 L 956 522 L 890.5 522 L 825 522 L 825 567Z'
	},
	area_33: {
		href: 'http://sideful.ru',
		title: 'Планета шапок',
		space: '33',
		type: 't12',
		path: 'M 914 503 L 914 519 L 935 519 L 956 519 L 956 503 L 956 487 L 935 487 L 914 487 L 914 503Z'
	},
	area_34: {
		href: 'http://sideful.ru',
		title: 'Новэкс',
		space: '34',
		type: 't2',
		path: 'M 873 332.5 L 873 336 L 858 336 L 843 336 L 843 368 L 843 400 L 856 400 L 869 400 L 869 442 L 869 484 L 912.5 484 L 956 484 L 956 406.5 L 956 329 L 914.5 329 L 873 329 L 873 332.5Z'
	},
	area_35: {
		href: 'http://sideful.ru',
		title: '1001 сумка',
		space: '35',
		type: 't7',
		path: 'M 823 443.5 L 823 484 L 844.5 484 L 866 484 L 866 443.5 L 866 403 L 844.5 403 L 823 403 L 823 443.5Z'
	},
	area_36: {
		href: 'http://sideful.ru',
		title: 'Мария-ра',
		space: '36',
		type: 't4',
		path: 'M 701 240.5 L 701 247 L 696.5 247 L 692 247 L 692 360 L 692 473 L 756 473 L 820 473 L 820 436.5 L 820 400 L 830 400 L 840 400 L 840 342.5 L 840 285 L 831 285 L 822 285 L 822 264 L 822 243 L 767 243 L 712 243 L 712 238.5 L 712 234 L 706.5 234 L 701 234 L 701 240.5Z'
	},
	area_37: {
		href: 'http://sideful.ru',
		title: 'Евросеть',
		space: '37',
		type: 't1',
		path: 'M 668 436.5 L 668 473 L 678.5 473 L 689 473 L 689 436.5 L 689 400 L 678.5 400 L 668 400 L 668 436.5Z'
	},
	area_38: {
		href: 'http://sideful.ru',
		title: 'Promo оптика',
		space: '38',
		type: 't12',
		path: 'M 644 436.5 L 644 473 L 654.5 473 L 665 473 L 665 436.5 L 665 400 L 654.5 400 L 644 400 L 644 436.5Z'
	},
	area_39: {
		href: 'http://sideful.ru',
		title: 'Глория Джинс',
		space: '39',
		type: '',
		path: 'M 492 295 L 492 305 L 479 305 L 466 305 L 466 316 L 466 327 L 510.5 327 L 555 327 L 555 404 L 555 481 L 575.5 481 L 596 481 L 596 477 L 596 473 L 618.5 473 L 641 473 L 641 435 L 641 397 L 665 397 L 689 397 L 689 341 L 689 285 L 590.5 285 L 492 285 L 492 295Z'
	},
	area_40: {
		href: 'http://sideful.ru',
		title: 'ДНС',
		space: '40',
		type: 't1',
		path: 'M 510 405.5 L 510 481 L 531 481 L 552 481 L 552 405.5 L 552 330 L 531 330 L 510 330 L 510 405.5Z'
	},
	area_41: {
		href: 'http://sideful.ru',
		title: 'Трэйс',
		space: '41',
		type: 't13',
		path: 'M 466 405.5 L 466 481 L 486.5 481 L 507 481 L 507 405.5 L 507 330 L 486.5 330 L 466 330 L 466 405.5Z'
	},
	area_42: {
		href: 'http://sideful.ru',
		title: 'Вестфалика',
		space: '42',
		type: 't13',
		path: 'M 440 437 L 440 481 L 451.5 481 L 463 481 L 463 437 L 463 393 L 451.5 393 L 440 393 L 440 437Z'
	},
	area_43: {
		href: 'http://sideful.ru',
		title: 'Rosa',
		space: '43',
		type: 't13',
		path: 'M 369 437 L 369 481 L 403 481 L 437 481 L 437 437 L 437 393 L 403 393 L 369 393 L 369 437Z'
	},
	area_44: {
		href: 'http://sideful.ru',
		title: 'Ортопедическая обувь',
		space: '44',
		type: 't13',
		path: 'M 334 437 L 334 481 L 350 481 L 366 481 L 366 437 L 366 393 L 350 393 L 334 393 L 334 437Z'
	},
	area_45: {
		href: 'http://sideful.ru',
		title: 'Евростиль',
		space: '45',
		type: 't13',
		path: 'M 279 459.5 L 279 481 L 305 481 L 331 481 L 331 459.5 L 331 438 L 305 438 L 279 438 L 279 459.5Z'
	},
	/*
	area_4: {
		href: '',
		title: '',
		space: '4',
		type: '',
		path: 'M 34 243.5 L 34 256 L 59.5 256 L 85 256 L 85 243.5 L 85 231 L 59.5 231 L 34 231 L 34 243.5Z'
	},
	area_6: {
		href: '',
		title: '',
		space: '6',
		type: '',
		path: 'M 88 243.5 L 88 256 L 100 256 L 112 256 L 112 243.5 L 112 231 L 100 231 L 88 231 L 88 243.5Z'
	},
	area_19: {
		href: '',
		title: '',
		space: '19',
		type: '',
		path: 'M 180 592 L 180 612 L 200 612 L 220 612 L 220 592 L 220 572 L 200 572 L 180 572 L 180 592Z'
	},
	area_23: {
		href: '',
		title: '',
		space: '23',
		type: '',
		path: 'M 332 568 L 332 612 L 355 612 L 378 612 L 378 568 L 378 524 L 355 524 L 332 524 L 332 568Z'
	},
	*/
}

/* Торговый центр 'Радуга' Кемерово, этаж 2 (путь '/maps/scheme/1/floor2/') */
var s1_f2 = {
	area_1: {
		href: 'http://sideful.ru',
		title: 'Детский мир',
		space: '1',
		type: 't10',
		path: 'M 4 87 L 4 170 L 90 170 L 176 170 L 176 146.5 L 176 123 L 253.5 123 L 331 123 L 331 63.5 L 331 4 L 167.5 4 L 4 4 L 4 87Z'
	},
	area_3: {
		href: 'http://sideful.ru',
		title: 'Крафт',
		space: '3',
		type: 't3',
		path: 'M 179 168.5 L 179 211 L 255 211 L 331 211 L 331 168.5 L 331 126 L 255 126 L 179 126 L 179 168.5Z'
	},
	area_5: {
		href: 'http://sideful.ru',
		title: 'Askona',
		space: '5',
		type: 't2',
		path: 'M 4 193.5 L 4 214 L 58 214 L 112 214 L 112 193.5 L 112 173 L 58 173 L 4 173 L 4 193.5Z'
	},
	area_7: {
		href: 'http://sideful.ru',
		title: 'Cocoon',
		space: '7',
		type: 't9',
		path: 'M 4 238 L 4 259 L 58 259 L 112 259 L 112 238 L 112 217 L 58 217 L 4 217 L 4 238Z'
	},
	area_8: {
		href: 'http://sideful.ru',
		title: 'Мир одежды',
		space: '8',
		type: 't9',
		path: 'M 4 283 L 4 304 L 58 304 L 112 304 L 112 283 L 112 262 L 58 262 L 4 262 L 4 283Z'
	},
	area_9: {
		href: 'http://sideful.ru',
		title: '4 sezona',
		space: '9',
		type: 't9',
		path: 'M 4 328 L 4 349 L 58 349 L 112 349 L 112 328 L 112 307 L 58 307 L 4 307 L 4 328Z'
	},
	area_10: {
		href: 'http://sideful.ru',
		title: 'Топтыжка',
		space: '10',
		type: 't10',
		path: 'M 4 373 L 4 394 L 46.5 394 C 88.8 394 89 394 90.8 391.9 C 91.7 390.7 96.9 385.3 102.3 379.9 L 112 370.1 L 112 361 L 112 352 L 58 352 L 4 352 L 4 373Z'
	},
	area_11: {
		href: 'http://sideful.ru',
		title: 'Озорники',
		space: '11',
		type: 't10',
		path: 'M 4 418 L 4 439 L 45.5 439 L 87 439 L 87 418 L 87 397 L 45.5 397 L 4 397 L 4 418Z'
	},
	area_12: {
		href: 'http://sideful.ru',
		title: 'Офисные мелочи',
		space: '12',
		type: 't8',
		path: 'M 4 471 L 4 500 L 30 500 L 56 500 L 56 492 L 56 484 L 71.5 484 L 87 484 L 87 463 L 87 442 L 45.5 442 L 4 442 L 4 471Z'
	},
	area_14: {
		href: 'http://sideful.ru',
		title: 'Умные дети',
		space: '14',
		type: 't10',
		path: 'M 59 508 L 59 529 L 73 529 L 87 529 L 87 508 L 87 487 L 73 487 L 59 487 L 59 508Z'
	},
	area_16: {
		href: 'http://sideful.ru',
		title: 'Веселая расческа',
		space: '16',
		type: 't19',
		path: 'M 4 581.5 L 4 614 L 32.5 614 L 61 614 L 61 581.5 L 61 549 L 32.5 549 L 4 549 L 4 581.5Z'
	},
	area_17: {
		href: 'http://sideful.ru',
		title: 'Фудкорт',
		space: '17',
		type: 't17',
		path: 'M 64 561.5 L 64 574 L 141.5 574 L 219 574 L 219 561.5 L 219 549 L 141.5 549 L 64 549 L 64 561.5Z'
	},
	area_18: {
		href: 'http://sideful.ru',
		title: 'Суши маке',
		space: '18',
		type: 't17',
		path: 'M 64 595.5 L 64 614 L 83 614 L 102 614 L 102 595.5 L 102 577 L 83 577 L 64 577 L 64 595.5Z'
	},
	area_19: {
		href: 'http://sideful.ru',
		title: 'Сибирские блины',
		space: '19',
		type: 't17',
		path: 'M 105 595.5 L 105 614 L 121 614 L 137 614 L 137 595.5 L 137 577 L 121 577 L 105 577 L 105 595.5Z'
	},
	area_20: {
		href: 'http://sideful.ru',
		title: 'Варенька',
		space: '20',
		type: 't17',
		path: 'M 140 595.5 L 140 614 L 161.5 614 L 183 614 L 183 595.5 L 183 577 L 161.5 577 L 140 577 L 140 595.5Z'
	},
	area_21: {
		href: 'http://sideful.ru',
		title: 'Subway',
		space: '21',
		type: 't17',
		path: 'M 186 595.5 L 186 614 L 202.5 614 L 219 614 L 219 595.5 L 219 577 L 202.5 577 L 186 577 L 186 595.5Z'
	},
	area_22: {
		href: 'http://sideful.ru',
		title: 'Кинотеатр',
		space: '22',
		type: 't18',
		path: 'M 222 581.5 L 222 614 L 262 614 L 302 614 L 302 581.5 L 302 549 L 262 549 L 222 549 L 222 581.5Z'
	},
	area_27: {
		href: 'http://sideful.ru',
		title: 'Орматек',
		space: '27',
		type: 't2',
		path: 'M 466 581.5 L 466 614 L 485.5 614 L 505 614 L 505 581.5 L 505 549 L 485.5 549 L 466 549 L 466 581.5Z'
	},
	area_28: {
		href: 'http://sideful.ru',
		title: 'Briolle',
		space: '28',
		type: 't9',
		path: 'M 508 581.5 L 508 614 L 530 614 L 552 614 L 552 581.5 L 552 549 L 530 549 L 508 549 L 508 581.5Z'
	},
	area_29: {
		href: 'http://sideful.ru',
		title: 'Моя шапка',
		space: '29',
		type: 't12',
		path: 'M 555 588 L 555 614 L 575.5 614 L 596 614 L 596 588 L 596 562 L 575.5 562 L 555 562 L 555 588Z'
	},
	area_30: {
		href: 'http://sideful.ru',
		title: '4 сезона',
		space: '30',
		type: 't9',
		path: 'M 599 588 L 599 614 L 620.5 614 L 642 614 L 642 593 L 642 572 L 650.5 572 L 659 572 L 659 567 L 659 562 L 629 562 L 599 562 L 599 588Z'
	},
	area_31: {
		href: 'http://sideful.ru',
		title: 'Опять не могу прочитать',
		space: '31',
		path: 'M 678 565 L 678 568 L 685 568 C 691.3 568 692 568.2 692 570 C 692 571.9 692.7 572 701.5 572 L 711 572 L 711 567 L 711 562 L 694.5 562 L 678 562 L 678 565Z'
	},
	area_32: {
		href: 'http://sideful.ru',
		title: '5 элемент',
		space: '32',
		type: 't1',
		path: 'M 736 348.5 L 736 454 L 725 454 L 714 454 L 714 467 L 714 480 L 835 480 L 956 480 L 956 404 L 956 328 L 913 328 L 870 328 L 870 287.5 L 870 247 L 864 247 C 858.7 247 858 246.8 858 245 C 858 243 857.3 243 797 243 L 736 243 L 736 348.5Z'
	},
	area_33: {
		href: 'http://sideful.ru',
		title: 'Дятьково',
		space: '33',
		type: 't2',
		path: 'M 701 245 C 701 246.7 700.3 247 696.5 247 L 692 247 L 692 349 L 692 451 L 712.5 451 L 733 451 L 733 347 L 733 243 L 717 243 C 701.7 243 701 243.1 701 245Z'
	},
	area_34: {
		href: 'http://sideful.ru',
		title: 'Ostin',
		space: '34',
		type: 't9',
		path: 'M 577 258 L 577 269 L 599.5 269 L 622 269 L 622 334.5 L 622 400 L 633 400 L 644 400 L 644 425.5 L 644 451 L 666.5 451 L 689 451 L 689 349 L 689 247 L 633 247 L 577 247 L 577 258Z'
	},
	area_35: {
		href: 'http://sideful.ru',
		title: 'Аляска',
		space: '35',
		type: 't11',
		path: 'M 554 349 L 554 451 L 575 451 L 596 451 L 596 425.5 L 596 400 L 607.5 400 L 619 400 L 619 336 L 619 272 L 596.5 272 L 574 272 L 574 259.5 L 574 247 L 564 247 L 554 247 L 554 349Z'
	},
	area_36: {
		href: 'http://sideful.ru',
		title: 'Яшма',
		space: '36',
		type: 't6',
		path: 'M 599 427 L 599 451 L 620 451 L 641 451 L 641 427 L 641 403 L 620 403 L 599 403 L 599 427Z'
	},
	area_37: {
		href: 'http://sideful.ru',
		title: 'Центробувь',
		space: '37',
		type: 't13',
		path: 'M 466 323.5 L 466 400 L 488.5 400 L 511 400 L 511 425.5 L 511 451 L 531 451 L 551 451 L 551 349 L 551 247 L 508.5 247 L 466 247 L 466 323.5Z'
	},
	area_38: {
		href: 'http://sideful.ru',
		title: 'Атлантик',
		space: '38',
		type: 't16',
		path: 'M 466 426.5 L 466 450 L 487 450 L 508 450 L 508 426.5 L 508 403 L 487 403 L 466 403 L 466 426.5Z'
	},
	area_41: {
		href: 'http://sideful.ru',
		title: 'Постелька',
		space: '41',
		type: 't2',
		path: 'M 334 349 L 334 451 L 364.5 451 L 395 451 L 395 349 L 395 247 L 364.5 247 L 334 247 L 334 349Z'
	},
	area_42: {
		href: 'http://sideful.ru',
		title: 'Deseo',
		space: '42',
		type: 't14',
		path: 'M 179 237 L 179 260 L 255 260 L 331 260 L 331 237 L 331 214 L 255 214 L 179 214 L 179 237Z'
	},
	area_43: {
		href: 'http://sideful.ru',
		title: 'Incity',
		space: '43',
		type: 't9',
		path: 'M 179 316.6 L 179 370.2 L 190.9 382.1 L 202.8 394 L 266.9 394 L 331 394 L 331 328.5 L 331 263 L 255 263 L 179 263 L 179 316.6Z'
	},
	area_44: {
		href: 'http://sideful.ru',
		title: 'Конвер',
		space: '44',
		type: 't13',
		path: 'M 205 418.6 L 205 440.2 L 210.5 445.6 L 215.9 451 L 228.5 451 L 241 451 L 241 424 L 241 397 L 223 397 L 205 397 L 205 418.6Z'
	},
	area_45: {
		href: 'http://sideful.ru',
		title: 'Baby',
		space: '45',
		type: 't10',
		path: 'M 244 424 L 244 451 L 263.5 451 L 283 451 L 283 424 L 283 397 L 263.5 397 L 244 397 L 244 424Z'
	},
	area_46: {
		href: 'http://sideful.ru',
		title: 'Dakota jeans',
		space: '46',
		type: 't9',
		path: 'M 286 424 L 286 451 L 308.5 451 L 331 451 L 331 424 L 331 397 L 308.5 397 L 286 397 L 286 424Z'
	},
	area_47: {
		href: 'http://sideful.ru',
		title: 'Детская игровая',
		space: '47',
		type: 't19',
		path: 'M 206.3 478.5 L 201 483.8 L 201 492.5 L 201 501.2 L 206.5 506.6 L 212 512 L 263.5 512 L 315 512 L 320.5 506.6 L 326 501.3 L 326 492.6 L 326 484 L 320.6 478.5 L 315.3 473 L 263.4 473 L 211.5 473.1 L 206.3 478.5Z'
	},
	area_48: {
		href: 'http://sideful.ru',
		title: 'Фэмили',
		space: '48',
		path: 'M 714 534.5 L 714 586 L 746.5 586 L 779 586 L 779 600 L 779 614 L 867.5 614 L 956 614 L 956 548.5 L 956 483 L 835 483 L 714 483 L 714 534.5Z'
	},
	/*
	area_13: {
		href: '',
		title: '',
		space: '13',
		path: 'M 4 516 L 4 529 L 30 529 L 56 529 L 56 516 L 56 503 L 30 503 L 4 503 L 4 516Z'
	},
	area_24: {
		href: '',
		title: '',
		space: '24',
		path: 'M 334 580.5 L 334 612 L 398.5 612 L 463 612 L 463 580.5 L 463 549 L 398.5 549 L 334 549 L 334 580.5Z'
	},
	area_40: {
		href: '',
		title: '',
		space: '40',
		path: 'M 398 349 L 398 451 L 430.5 451 L 463 451 L 463 349 L 463 247 L 430.5 247 L 398 247 L 398 349Z'
	},
	*/
}

/* Торговый центр 'Радуга' Рубцовск, этаж 1 (путь '/maps/scheme/2/floor1/') */
var s2_f1 = {
	area_1: {
		href: 'http://sideful.ru',
		title: 'Спортмастер',
		space: '1',
		type: 't1',
		path: 'M 30 135.5 L 30 245 L 57 245 L 84 245 L 84 219.5 L 84 194 L 93.5 194 L 103 194 L 103 166.5 L 103 139 L 133 139 L 163 139 L 163 82.5 L 163 26 L 96.5 26 L 30 26 L 30 135.5Z'
	},
	area_2: {
		href: 'http://sideful.ru',
		title: 'Детский мир',
		space: '2',
		path: 'M166,82.5L166,139L203.3,139C235.8,139,241.1,138.8,245,137.3C248.6,135.9,254,135.5,273.3,135.2L297,134.8L297,122.4L297,110L309,110L321,110L321,98L321,86L333.5,86L346,86L346,56L346,26L256,26L166,26L166,82.5Z'
	},
	area_4: {
		href: 'http://sideful.ru',
		title: 'Рапунзель',
		space: '4',
		path: 'M 87 221 L 87 245 L 95 245 L 103 245 L 103 221 L 103 197 L 95 197 L 87 197 L 87 221Z'
	},
	area_5: {
		href: 'http://sideful.ru',
		title: 'Аляска',
		space: '5',
		path: 'M 106 192.5 C 106 234.1 106.2 243 107.3 243 C 111.2 243 132.4 233.5 134 231.1 C 134.3 230.6 136 229.5 137.8 228.6 C 139.5 227.7 141 226.6 141 226.1 C 141 225.6 141.9 225 143 224.7 C 145 224.2 145 223.3 145 183.1 L 145 142 L 125.5 142 L 106 142 L 106 192.5Z'
	},
	area_7: {
		href: 'http://sideful.ru',
		title: 'Полиграф',
		space: '7',
		path: 'M 186 162 C 186 174.7 186.4 182 187 182 C 187.6 182 189.8 180.3 192 178.2 C 194.1 176.2 199.4 171.3 203.6 167.5 C 207.8 163.6 213.1 158.7 215.4 156.4 C 217.8 154.2 220.4 152.1 221.3 151.7 C 222.2 151.4 223 150.6 223 150 C 223 149.5 223.7 149 224.5 149 C 225.4 149 226.3 148.3 226.6 147.5 C 227 146.7 227.8 146 228.5 146 C 229.6 146 231 144 231 142.4 C 231 142.2 220.9 142 208.5 142 L 186 142 L 186 162Z'
	},
	area_8: {
		href: 'http://sideful.ru',
		title: 'Кроха',
		space: '8',
		path: 'M300,124L300,135L310.5,135L321,135L321,124L321,113L310.5,113L300,113L300,124Z'
	},
	area_10: {
		href: 'http://sideful.ru',
		title: 'Кокетка',
		space: '10',
		path: 'M349,112L349,135L367,135L385,135L385,112L385,89L367,89L349,89L349,112Z'
	},
	area_11: {
		href: 'http://sideful.ru',
		title: 'VIP',
		space: '11',
		path: 'M 388 125.5 L 388 135 L 397 135 L 406 135 L 406 125.5 L 406 116 L 397 116 L 388 116 L 388 125.5Z'
	},
	area_13: {
		href: 'http://sideful.ru',
		title: 'Весело шагаю',
		space: '13',
		path: 'M 200.3 235.9 C 193.2 243.3 191 245.9 191 246.9 C 191 247.5 190.6 248 190 248 C 189.4 248 189 253 189 261 L 189 274 L 197.5 274 L 206 274 L 206 253 C 206 240.3 205.6 232 205 232 C 204.5 232 202.4 233.8 200.3 235.9Z'
	},
	area_14: {
		href: 'http://sideful.ru',
		title: 'Непонятно',
		space: '14',
		path: 'M 189.2 289.9 L 189.6 302.8 L 193.7 307.1 C 196 309.5 199.2 313 200.9 314.7 C 202.6 316.5 204.4 318 205 318 C 205.6 318 206 310.9 206 297.5 L 206 277 L 197.4 277 L 188.8 277 L 189.2 289.9Z'
	},
	area_15: {
		href: 'http://sideful.ru',
		title: 'Зазеркалье',
		space: '15',
		path: 'M 217.1 220.1 C 215.3 221.7 212.7 223.8 211.4 224.7 L 209 226.2 L 209 250.1 L 209 274 L 216 274 L 223 274 L 223 245.5 C 223 223 222.7 217 221.7 217 C 221 217 218.9 218.4 217.1 220.1Z'
	},
	area_16: {
		href: 'http://sideful.ru',
		title: 'Обувь',
		space: '16',
		path: 'M 209.2 300.6 C 209.5 321.5 209.7 324.2 211.2 325.1 C 212.1 325.6 213.6 326.7 214.4 327.5 C 215.2 328.3 216.2 329 216.7 329 C 217.2 329 218.2 329.9 219 331 C 222.7 336.1 223 334.1 223 305 L 223 277 L 215.9 277 L 208.8 277 L 209.2 300.6Z'
	},
	area_17: {
		href: 'http://sideful.ru',
		title: 'Бонита',
		space: '17',
		path: 'M 238 207 C 235 208.7 231 210.8 229.3 211.7 L 226 213.4 L 226 230.7 L 226 248 L 235.5 248 L 245 248 L 245 226 C 245 213.9 244.7 204 244.3 204 C 243.8 204 241 205.4 238 207Z'
	},
	area_18: {
		href: 'http://sideful.ru',
		title: 'Кокетка',
		space: '18',
		path: 'M 226 320 C 226 330.9 226.4 337 227 337 C 228 337 236 341.9 237 343.1 C 237.9 344.2 241.9 346 243.4 346 C 244.8 346 245 343.3 245 324.5 L 245 303 L 235.5 303 L 226 303 L 226 320Z'
	},
	area_19: {
		href: 'http://sideful.ru',
		title: 'Фэмили',
		space: '19',
		path: 'M 276 192.5 C 272.9 193.3 265.9 195.5 260.5 197.5 C 255 199.5 249.9 201.3 249.3 201.5 C 248.3 201.8 248 207.7 248 226.5 L 248 251 L 237 251 L 226 251 L 226 275.5 L 226 300 L 237 300 L 248 300 L 248 323.9 L 248 347.8 L 251.5 349.4 C 258.7 352.8 280.4 359 285.3 359 C 286.9 359 287 354.3 287 275 L 287 191 L 284.3 191.1 C 282.7 191.1 279 191.8 276 192.5Z'
	},
	area_20: {
		href: 'http://sideful.ru',
		title: 'Я расту',
		space: '20',
		path: 'M 290 206 L 290 221 L 298 221 L 306 221 L 306 206 L 306 191 L 298 191 L 290 191 L 290 206Z'
	},
	area_21: {
		href: 'http://sideful.ru',
		title: 'Империя сумок',
		space: '21',
		path: 'M 290 344 L 290 359 L 298 359 L 306 359 L 306 344 L 306 329 L 298 329 L 290 329 L 290 344Z'
	},
	area_22: {
		href: 'http://sideful.ru',
		title: 'Kari',
		space: '22',
		path: 'M 309 207.5 L 309 224 L 299.5 224 L 290 224 L 290 275 L 290 326 L 299.5 326 L 309 326 L 309 342.5 L 309 359 L 317.5 359 L 326 359 L 326 275 L 326 191 L 317.5 191 L 309 191 L 309 207.5Z'
	},
	area_23: {
		href: 'http://sideful.ru',
		title: 'Shope paradise',
		space: '23',
		path: 'M 329 219.5 L 329 248 L 337 248 L 345 248 L 345 219.5 L 345 191 L 337 191 L 329 191 L 329 219.5Z'
	},
	area_25: {
		href: 'http://sideful.ru',
		title: 'Gloria Jeans',
		space: '25',
		path: 'M 348 221 L 348 251 L 338.5 251 L 329 251 L 329 275 L 329 299 L 338.5 299 L 348 299 L 348 329 L 348 359 L 367 359 L 386 359 L 386 275 L 386 191 L 367 191 L 348 191 L 348 221Z'
	},
	area_26: {
		href: 'http://sideful.ru',
		title: 'Zolla',
		space: '26',
		path: 'M 389 275 L 389 359 L 409 359 L 429 359 L 429 275 L 429 191 L 409 191 L 389 191 L 389 275Z'
	},
	area_27: {
		href: 'http://sideful.ru',
		title: 'Телефоника',
		space: '27',
		path: 'M432,218L432,245L442,245L452,245L452,218L452,191L442,191L432,191L432,218Z'
	},
	area_28: {
		href: 'http://sideful.ru',
		title: 'TELE2',
		space: '28',
		path: 'M432,275L432,302L442,302L452,302L452,275L452,248L442,248L432,248L432,275Z'
	},
	area_29: {
		href: 'http://sideful.ru',
		title: 'Непонятно',
		space: '29',
		path: 'M 30 313.5 L 30 322 L 43.5 322 L 57 322 L 57 313.5 L 57 305 L 43.5 305 L 30 305 L 30 313.5Z'
	},
	area_30: {
		href: 'http://sideful.ru',
		title: 'Непонятно',
		space: '30',
		path: 'M 60 313.5 L 60 322 L 72 322 L 84 322 L 84 313.5 L 84 305 L 72 305 L 60 305 L 60 313.5Z'
	},
	area_31: {
		href: 'http://sideful.ru',
		title: 'Формула жизни',
		space: '31',
		path: 'M 87 313.5 L 87 322 L 111.5 322 C 130.9 322 136 321.7 136 320.7 C 136 320 134.5 318.7 132.8 317.8 C 131 317 126.4 314.6 122.5 312.7 C 113.6 308.1 101.8 305 93.5 305 L 87 305 L 87 313.5Z'
	},
	area_32: {
		href: 'http://sideful.ru',
		title: 'Кинотеатр',
		space: '32',
		path: 'M 30 424.5 L 30 524 L 88.5 524 L 147 524 L 147 426.1 C 147 329 147 328.1 145 327.5 C 143.9 327.2 143 326.4 143 325.9 C 143 325.4 120.8 325 86.5 325 L 30 325 L 30 424.5Z'
	},
	area_33: {
		href: 'http://sideful.ru',
		title: 'Лас-пупас',
		space: '33',
		path: 'M 150.7 334.7 C 150.3 335 150 358 150 385.7 L 150 436 L 178 436 L 206 436 L 206 410 C 206 395.6 205.6 384 205.1 384 C 204.6 384 200 379.9 194.9 375 C 189.7 370 179.4 360.1 172 352.9 C 149.7 331.4 152 333.4 150.7 334.7Z'
	},
	area_34: {
		href: 'http://sideful.ru',
		title: 'Bookля',
		space: '34',
		path: 'M 209 413 L 209 436 L 217 436 L 225 436 L 225 418.7 L 225 401.4 L 220.8 397.7 C 218.4 395.6 215.5 393.1 214.3 392 C 213.1 390.9 211.4 390 210.5 390 C 209.2 390 209 393 209 413Z'
	},
	area_36: {
		href: 'http://sideful.ru',
		title: 'DNS',
		space: '36',
		path: 'M274,469.5L274,524L288.5,524L303,524L303,469.5L303,415L288.5,415L274,415L274,469.5Z'
	},
	area_37: {
		href: 'http://sideful.ru',
		title: 'Много мебели',
		space: '37',
		path: 'M306,469.5L306,524L314.5,524L323,524L323,469.5L323,415L314.5,415L306,415L306,469.5Z'
	},
	area_38: {
		href: 'http://sideful.ru',
		title: 'Непонятно',
		space: '38',
		path: 'M 366 430.5 L 366 446 L 375 446 L 384 446 L 384 430.5 L 384 415 L 375 415 L 366 415 L 366 430.5Z'
	},
	area_39: {
		href: 'http://sideful.ru',
		title: 'Остин',
		space: '39',
		path: 'M387,432L387,449L376.5,449L366,449L366,486.5L366,524L415,524L464,524L464,485.5L464,447L454,447L444,447L444,431L444,415L415.5,415L387,415L387,432Z'
	},
	area_40: {
		href: 'http://sideful.ru',
		title: 'Изумруд',
		space: '40',
		path: 'M 447 429.5 L 447 444 L 455.5 444 L 464 444 L 464 429.5 L 464 415 L 455.5 415 L 447 415 L 447 429.5Z'
	},
	area_41: {
		href: 'http://sideful.ru',
		title: 'Золотой дождь',
		space: '41',
		path: 'M467,440.5L467,466L475.5,466L484,466L484,440.5L484,415L475.5,415L467,415L467,440.5Z'
	},
	area_42: {
		href: 'http://sideful.ru',
		title: 'Яшма',
		space: '42',
		path: 'M 487 429.5 L 487 444 L 497.5 444 L 508 444 L 508 429.5 L 508 415 L 497.5 415 L 487 415 L 487 429.5Z'
	},
	area_44: {
		href: 'http://sideful.ru',
		title: 'Гараж',
		space: '44',
		path: 'M468,482.5L468,496L488,496L508,496L508,482.5L508,469L488,469L468,469L468,482.5Z'
	},
	area_45: {
		href: 'http://sideful.ru',
		title: 'Креатив',
		space: '45',
		path: 'M 485 42.5 L 485 59 L 496.5 59 L 508 59 L 508 42.5 L 508 26 L 496.5 26 L 485 26 L 485 42.5Z'
	},
	area_46: {
		href: 'http://sideful.ru',
		title: 'Планета серебро',
		space: '46',
		path: 'M 485 78 L 485 94 L 496.5 94 L 508 94 L 508 78 L 508 62 L 496.5 62 L 485 62 L 485 78Z'
	},
	area_47: {
		href: 'http://sideful.ru',
		title: '585 золото',
		space: '47',
		path: 'M 485 116 L 485 135 L 496.5 135 L 508 135 L 508 116 L 508 97 L 496.5 97 L 485 97 L 485 116Z'
	},
	area_48: {
		href: 'http://sideful.ru',
		title: 'Incity',
		space: '48',
		path: 'M 511 80.5 L 511 135 L 557.5 135 L 604 135 L 604 80.5 L 604 26 L 557.5 26 L 511 26 L 511 80.5Z'
	},
	area_49: {
		href: 'http://sideful.ru',
		title: 'Fun day',
		space: '49',
		path: 'M 607 80.5 L 607 135 L 635.5 135 L 664 135 L 664 122 L 664 109 L 674 109 L 684 109 L 684 95.5 L 684 82 L 694.5 82 L 705 82 L 705 54 L 705 26 L 656 26 L 607 26 L 607 80.5Z'
	},
	area_50: {
		href: 'http://sideful.ru',
		title: 'Непонятно',
		space: '50',
		path: 'M 667 123.5 L 667 135 L 675.5 135 L 684 135 L 684 123.5 L 684 112 L 675.5 112 L 667 112 L 667 123.5Z'
	},
	area_51: {
		href: 'http://sideful.ru',
		title: 'Баска',
		space: '51',
		path: 'M 687 110 L 687 135 L 696 135 L 705 135 L 705 110 L 705 85 L 696 85 L 687 85 L 687 110Z'
	},
	area_52: {
		href: 'http://sideful.ru',
		title: 'Водолей/Практик/Прораб',
		space: '52',
		path: 'M 708 80.5 L 708 135 L 727.5 135 L 747 135 L 747 80.5 L 747 26 L 727.5 26 L 708 26 L 708 80.5Z'
	},
	area_53: {
		href: 'http://sideful.ru',
		title: 'Новэкс',
		space: '53',
		path: 'M 750 80.5 L 750 135 L 778.5 135 L 807 135 L 807 122.5 L 807 110 L 815 110 L 823 110 L 823 98 L 823 86 L 833 86 L 843 86 L 843 56 L 843 26 L 796.5 26 L 750 26 L 750 80.5Z'
	},
	area_55: {
		href: 'http://sideful.ru',
		title: 'Мария-ра',
		space: '55',
		path: 'M 846 82 L 846 138 L 837.5 138 L 829 138 L 829 206 L 829 274 L 905.5 274 L 982 274 L 982 150 L 982 26 L 914 26 L 846 26 L 846 82Z'
	},
	area_54: {
		href: 'http://sideful.ru',
		title: 'Аптека первая помощь',
		space: '54',
		path: 'M 826 101 L 826 113 L 818 113 L 810 113 L 810 124 L 810 135 L 826.5 135 L 843 135 L 843 112 L 843 89 L 834.5 89 L 826 89 L 826 101Z'
	},
	area_56: {
		href: 'http://sideful.ru',
		title: 'RBT.RU',
		space: '56',
		path: 'M 829 301.1 C 829 317.2 829.4 325.9 830.1 327.3 C 830.8 328.5 833.5 332.8 836.1 336.8 C 838.8 340.8 841 344.5 841 345 C 841 345.6 841.5 346 842 346 C 842.6 346 843 346.5 843 347.1 C 843 348 851.7 361.9 854 364.7 C 854.5 365.4 855 366.3 855 366.8 C 855 367.2 855.8 368.5 856.8 369.6 C 857.7 370.7 859.4 373.2 860.4 375.3 C 861.5 377.3 862.7 379 863.2 379 C 863.6 379 864 379.7 864 380.5 C 864 381.3 864.4 382 864.9 382 C 865.4 382 866.2 383.3 866.8 384.8 C 867.3 386.4 868.4 388.3 869.1 389.1 C 869.9 389.9 871 391.5 871.7 392.5 C 878.7 404.1 883.5 411.6 884.2 411.8 C 884.6 412 885 412.6 885 413.1 C 885 414.2 894.1 428.3 895.4 429.2 C 896 429.6 915.7 430 939.3 430 L 982 430 L 982 353.5 L 982 277 L 905.5 277 L 829 277 L 829 301.1Z'
	},
	area_57: {
		href: 'http://sideful.ru',
		title: 'Грааль',
		space: '57',
		path: 'M 829.7 334.7 C 829.3 335 829 377.8 829 429.7 L 829 524 L 905.5 524 L 982 524 L 982 478.5 L 982 433 L 938.2 433 C 895.1 433 894.4 433 892.7 430.9 C 891.7 429.8 890.4 427.8 889.8 426.4 C 889.2 425.1 888.3 424 887.9 424 C 887.5 424 886.9 422.9 886.6 421.5 C 886.2 420.1 885.5 419 885 419 C 884.4 419 884 418.5 884 417.8 C 884 417.2 882.9 415.2 881.5 413.4 C 880.1 411.6 879 409.7 879 409.3 C 879 408.8 878.2 407.5 877.3 406.4 C 876.3 405.4 874.6 402.8 873.5 400.7 C 872.4 398.7 871.2 397 870.8 397 C 870.3 397 870 396.3 870 395.5 C 870 394.7 869.6 394 869.1 394 C 868.6 394 867.9 392.9 867.6 391.5 C 867.2 390.1 866.5 389 866 389 C 865.4 389 865 388.4 865 387.7 C 865 387 864.2 385.5 863.1 384.4 C 862.1 383.3 860.9 381.4 860.6 380.2 C 860.2 379 859.4 378 858.9 378 C 858.4 378 858 377.3 858 376.5 C 858 375.7 857.6 375 857 375 C 856.5 375 856 374.3 856 373.5 C 856 372.7 855.6 372 855.1 372 C 854.6 372 853.9 370.9 853.6 369.5 C 853.2 368.1 852.5 367 852 367 C 851.4 367 851 366.5 851 365.8 C 851 365.2 849.9 363.2 848.5 361.4 C 847.1 359.6 846 357.7 846 357.3 C 846 356.8 845.2 355.5 844.3 354.4 C 843.3 353.3 841.6 350.8 840.6 348.7 C 839.5 346.7 838.3 345 837.8 345 C 837.4 345 837 344.6 837 344.1 C 837 342.8 831.7 334.1 830.9 334 C 830.6 334 830 334.3 829.7 334.7Z'
	},
	area_58: {
		href: 'http://sideful.ru',
		title: 'Лэтуаль',
		space: '58',
		path: 'M 569 232.5 L 569 274 L 587 274 L 605 274 L 605 232.5 L 605 191 L 587 191 L 569 191 L 569 232.5Z'
	},
	area_59: {
		href: 'http://sideful.ru',
		title: 'Diva',
		space: '59',
		path: 'M 569 287 L 569 297 L 587 297 L 605 297 L 605 287 L 605 277 L 587 277 L 569 277 L 569 287Z'
	},
	area_60: {
		href: 'http://sideful.ru',
		title: 'Розовая бабочка',
		space: '60',
		path: 'M 569 312.5 L 569 325 L 587 325 L 605 325 L 605 312.5 L 605 300 L 587 300 L 569 300 L 569 312.5Z'
	},
	area_61: {
		href: 'http://sideful.ru',
		title: 'МТС',
		space: '61',
		path: 'M569,343.5L569,359L578,359L587,359L587,343.5L587,328L578,328L569,328L569,343.5Z'
	},
	area_62: {
		href: 'http://sideful.ru',
		title: 'Befree',
		space: '62',
		path: 'M 608 232.5 L 608 274 L 626.5 274 L 645 274 L 645 232.5 L 645 191 L 626.5 191 L 608 191 L 608 232.5Z'
	},
	area_63: {
		href: 'http://sideful.ru',
		title: 'Milavitsa',
		space: '63',
		path: 'M 648 208 L 648 225 L 656.5 225 L 665 225 L 665 208 L 665 191 L 656.5 191 L 648 191 L 648 208Z'
	},
	area_64: {
		href: 'http://sideful.ru',
		title: 'Deseo',
		space: '64',
		path: 'M 668 209.5 L 668 228 L 658 228 L 648 228 L 648 251 L 648 274 L 666.5 274 L 685 274 L 685 232.5 L 685 191 L 676.5 191 L 668 191 L 668 209.5Z'
	},
	area_65: {
		href: 'http://sideful.ru',
		title: 'Мега',
		space: '65',
		path: 'M 608 318 L 608 359 L 616 359 L 624 359 L 624 318 L 624 277 L 616 277 L 608 277 L 608 318Z'
	},
	area_66: {
		href: 'http://sideful.ru',
		title: 'Классик',
		space: '66',
		path: 'M 627 318 L 627 359 L 646 359 L 665 359 L 665 318 L 665 277 L 646 277 L 627 277 L 627 318Z'
	},
	area_67: {
		href: 'http://sideful.ru',
		title: 'Респект',
		space: '67',
		path: 'M 668 318 L 668 359 L 676.5 359 L 685 359 L 685 318 L 685 277 L 676.5 277 L 668 277 L 668 318Z'
	},
	area_68: {
		href: 'http://sideful.ru',
		title: 'Centro',
		space: '68',
		path: 'M 688 275 L 688 359 L 697 359 L 706 359 L 706 341 L 706 323 L 716 323 L 726 323 L 726 257 L 726 191 L 707 191 L 688 191 L 688 275Z'
	},
	area_70: {
		href: 'http://sideful.ru',
		title: 'S&I',
		space: '70',
		path: 'M729,232.5L729,274L747.5,274L766,274L766,232.5L766,191L747.5,191L729,191L729,232.5Z'
	},
	area_71: {
		href: 'http://sideful.ru',
		title: 'Непонятно',
		space: '71',
		path: 'M 749 203.5 L 749 216 L 757.5 216 L 766 216 L 766 203.5 L 766 191 L 757.5 191 L 749 191 L 749 203.5Z'
	},
	area_72: {
		href: 'http://sideful.ru',
		title: 'Стиль',
		space: '72',
		path: 'M769,216L769,241L776,241L783,241L783,216L783,191L776,191L769,191L769,216Z'
	},
	area_73: {
		href: 'http://sideful.ru',
		title: 'Сумка плюс',
		space: '73',
		path: 'M769,259L769,274L776,274L783,274L783,259L783,244L776,244L769,244L769,259Z'
	},
	area_74: {
		href: 'http://sideful.ru',
		title: 'Стиляга плюс',
		space: '74',
		path: 'M 729 318 L 729 359 L 737.5 359 L 746 359 L 746 329 L 746 299 L 756 299 L 766 299 L 766 288 L 766 277 L 747.5 277 L 729 277 L 729 318Z'
	},
	area_75: {
		href: 'http://sideful.ru',
		title: 'Carcity',
		space: '75',
		path: 'M 749 330.5 L 749 359 L 757.5 359 L 766 359 L 766 330.5 L 766 302 L 757.5 302 L 749 302 L 749 330.5Z'
	},
	area_77: {
		href: 'http://sideful.ru',
		title: 'Непонятно',
		space: '77',
		path: 'M 769 312.5 L 769 323 L 776 323 L 783 323 L 783 312.5 L 783 302 L 776 302 L 769 302 L 769 312.5Z'
	},
	area_78: {
		href: 'http://sideful.ru',
		title: 'Смайлик',
		space: '78',
		path: 'M 769 342.5 L 769 359 L 776 359 L 783 359 L 783 342.5 L 783 326 L 776 326 L 769 326 L 769 342.5Z'
	},
	area_79: {
		href: 'http://sideful.ru',
		title: 'Юvелир',
		space: '79',
		path: 'M551,432.5L551,450L559,450L567,450L567,432.5L567,415L559,415L551,415L551,432.5Z'
	},
	area_80: {
		href: 'http://sideful.ru',
		title: 'Непонятно',
		space: '80',
		path: 'M 551 480 L 551 491 L 559 491 L 567 491 L 567 480 L 567 469 L 559 469 L 551 469 L 551 480Z'
	},
	area_81: {
		href: 'http://sideful.ru',
		title: '12 вольт',
		space: '81',
		path: 'M 551 509 L 551 524 L 559 524 L 567 524 L 567 509 L 567 494 L 559 494 L 551 494 L 551 509Z'
	},
	area_82: {
		href: 'http://sideful.ru',
		title: 'Макси-мебель',
		space: '82',
		path: 'M 570 469.5 L 570 524 L 588.5 524 L 607 524 L 607 469.5 L 607 415 L 588.5 415 L 570 415 L 570 469.5Z'
	},
	area_83: {
		href: 'http://sideful.ru',
		title: 'Три слона',
		space: '83',
		path: 'M 610 469.5 L 610 524 L 626.5 524 L 643 524 L 643 469.5 L 643 415 L 626.5 415 L 610 415 L 610 469.5Z'
	},
	area_84: {
		href: 'http://sideful.ru',
		title: 'Фудзияма',
		space: '84',
		path: 'M 673 498 L 673 524 L 680.5 524 L 688 524 L 688 498 L 688 472 L 680.5 472 L 673 472 L 673 498Z'
	},
	area_85: {
		href: 'http://sideful.ru',
		title: 'Manhattan Pizza',
		space: '85',
		path: 'M 691 498 L 691 524 L 698.5 524 L 706 524 L 706 498 L 706 472 L 698.5 472 L 691 472 L 691 498Z'
	},
	area_86: {
		href: 'http://sideful.ru',
		title: 'Пицца марио',
		space: '86',
		path: 'M 709 498 L 709 524 L 717 524 L 725 524 L 725 498 L 725 472 L 717 472 L 709 472 L 709 498Z'
	},
	area_87: {
		href: 'http://sideful.ru',
		title: 'Суши маки',
		space: '87',
		path: 'M 728 498 L 728 524 L 736.5 524 L 745 524 L 745 498 L 745 472 L 736.5 472 L 728 472 L 728 498Z'
	},
	area_88: {
		href: 'http://sideful.ru',
		title: 'Рус бургер',
		space: '88',
		path: 'M 748 498 L 748 524 L 758 524 L 768 524 L 768 498 L 768 472 L 758 472 L 748 472 L 748 498Z'
	},
	area_89: {
		href: 'http://sideful.ru',
		title: 'Непонятно',
		space: '89',
		path: 'M 771 426.5 L 771 438 L 778 438 L 785 438 L 785 426.5 L 785 415 L 778 415 L 771 415 L 771 426.5Z'
	},
	area_90: {
		href: 'http://sideful.ru',
		title: 'Сковородовна',
		space: '90',
		path: 'M 771 482.5 L 771 524 L 778 524 L 785 524 L 785 482.5 L 785 441 L 778 441 L 771 441 L 771 482.5Z'
	},
	area_94: {
		href: 'http://sideful.ru',
		title: 'Нигора',
		space: '94',
		path: 'M326,469.5L326,524L334.5,524L343,524L343,469.5L343,415L334.5,415L326,415L326,469.5Z'
	},
	area_97: {
		href: 'http://sideful.ru',
		title: 'Дивиzион',
		space: '97',
		path: 'M432,332L432,359L442,359L452,359L452,332L452,305L442,305L432,305L432,332Z'
	},
	area_98: {
		href: 'http://sideful.ru',
		title: 'Непонятно',
		space: '98',
		path: 'M590,343.5L590,359L597.5,359L605,359L605,343.5L605,328L597.5,328L590,328L590,343.5Z'
	},
	area_99: {
		href: 'http://sideful.ru',
		title: 'Непонятно',
		space: '99',
		path: 'M279,163L279,170L296,170L313,170L313,163L313,156L296,156L279,156L279,163Z'
	},
	area_100: {
		href: 'http://sideful.ru',
		title: 'Сувениры',
		space: '100',
		path: 'M349,163L349,170L366,170L383,170L383,163L383,156L366,156L349,156L349,163Z'
	},
	area_101: {
		href: 'http://sideful.ru',
		title: 'Косметика',
		space: '101',
		path: 'M419,163L419,170L436,170L453,170L453,163L453,156L436,156L419,156L419,163Z'
	},
	area_102: {
		href: 'http://sideful.ru',
		title: 'Наше серебро',
		space: '102',
		path: 'M499,163L499,170L516,170L533,170L533,163L533,156L516,156L499,156L499,163Z'
	},
	area_103: {
		href: 'http://sideful.ru',
		title: 'Микро займы',
		space: '103',
		path: 'M569,163L569,170L586,170L603,170L603,163L603,156L586,156L569,156L569,163Z'
	},
	area_104: {
		href: 'http://sideful.ru',
		title: 'Церковная лавка',
		space: '104',
		path: 'M639,163L639,170L656,170L673,170L673,163L673,156L656,156L639,156L639,163Z'
	},
	area_105: {
		href: 'http://sideful.ru',
		title: 'Непонятно',
		space: '105',
		path: 'M709,163L709,170L726,170L743,170L743,163L743,156L726,156L709,156L709,163Z'
	},
	area_106: {
		href: 'http://sideful.ru',
		title: 'Непонятно',
		space: '106',
		path: 'M219,369.5L219,376L231,376L243,376L243,369.5L243,363L231,363L219,363L219,369.5Z'
	},
	area_107: {
		href: 'http://sideful.ru',
		title: 'Маникюр бар',
		space: '107',
		path: 'M569,387L569,394L586,394L603,394L603,387L603,380L586,380L569,380L569,387Z'
	},
	area_108: {
		href: 'http://sideful.ru',
		title: 'Непонятно',
		space: '108',
		path: 'M639,387L639,394L656,394L673,394L673,387L673,380L656,380L639,380L639,387Z'
	},
	area_109: {
		href: 'http://sideful.ru',
		title: 'Непонятно',
		space: '109',
		path: 'M709,387L709,394L726,394L743,394L743,387L743,380L726,380L709,380L709,387Z'
	},
	area_110: {
		href: 'http://sideful.ru',
		title: 'Непонятно',
		space: '110',
		path: 'M779,387L779,394L796,394L813,394L813,387L813,380L796,380L779,380L779,387Z'
	},
	area_111: {
		href: 'http://sideful.ru',
		title: 'Непонятно',
		space: '111',
		path: 'M646,415C648.8,415,654.3,415,657,415C657,419,657,423,657,427C654.3,427,648.8,427,646,427C646,423,646,419,646,415Z'
	},
	area_114: {
		href: 'http://sideful.ru',
		title: 'Непонятно',
		space: '110',
		path: 'M668,425L668,435L673.5,435L679,435L679,425L679,415L673.5,415L668,415L668,425Z'
	},
	area_115: {
		href: 'http://sideful.ru',
		title: 'Непонятно',
		space: '110',
		path: 'M146,245.5L146,252L158,252L170,252L170,245.5L170,239L158,239L146,239L146,245.5Z'
	},
	/*
	area_3: {
		href: '',
		title: '',
		space: '3',
		path: 'M 349 56 L 349 86 L 368.5 86 L 388 86 L 388 99.5 L 388 113 L 398.5 113 L 409 113 L 409 124 L 409 135 L 425.5 135 L 442 135 L 442 80.5 L 442 26 L 395.5 26 L 349 26 L 349 56Z'
	},
	area_6: {
		href: 'http://sideful.ru',
		title: 'Лимон',
		space: '6',
		path: 'M 148 179.5 C 148 211.4 148.2 217 149.4 217 C 150.2 217 153.4 214.5 156.5 211.5 C 159.7 208.5 162.5 206 162.8 206 C 163.1 206 165.7 203.6 168.6 200.7 C 171.6 197.9 176 193.7 178.5 191.5 L 182.9 187.5 L 183 164.7 L 183 142 L 165.5 142 L 148 142 L 148 179.5Z'
	},
	area_12: {
		href: '',
		title: '',
		space: '12',
		path: 'M183.1,257.1C183.8,257.1,185.3,257,186,257C186,262.6,186,268.3,186,274C181.6,274,177.3,274,172.9,274C176.4,268.4,179.8,262.8,183.1,257.1Z'
	},
	area_24: {
		href: '',
		title: '',
		space: '24',
		path: 'M 329 330.5 L 329 359 L 337 359 L 345 359 L 345 330.5 L 345 302 L 337 302 L 329 302 L 329 330.5Z'
	},
	area_35: {
		href: '',
		title: '',
		space: '35',
		path: 'M 228 422 L 228 439 L 189 439 L 150 439 L 150 481.5 L 150 524 L 210.5 524 L 271 524 L 271 469.5 L 271 415 L 261 415 C 253.4 415 249.5 414.5 244.8 412.8 C 238 410.5 234 408.3 232.7 406.3 C 232.3 405.6 231 405 230 405 C 228.1 405 228 405.8 228 422Z'
	},
	area_43: {
		href: '',
		title: '',
		space: '43',
		path: 'M 487 456.5 L 487 466 L 497.5 466 L 508 466 L 508 456.5 L 508 447 L 497.5 447 L 487 447 L 487 456.5Z'
	},
	area_69: {
		href: '',
		title: '',
		space: '69',
		path: 'M 709 343.5 L 709 359 L 717.5 359 L 726 359 L 726 343.5 L 726 328 L 717.5 328 L 709 328 L 709 343.5Z'
	},
	area_76: {
		href: '',
		title: '',
		space: '76',
		path: 'M 769 288 L 769 299 L 776 299 L 783 299 L 783 288 L 783 277 L 776 277 L 769 277 L 769 288Z'
	},
	area_91: {
		href: '',
		title: '',
		space: '91',
		path: 'M 788 469.5 L 788 524 L 807 524 L 826 524 L 826 469.5 L 826 415 L 807 415 L 788 415 L 788 469.5Z'
	},
	area_92: {
		href: '',
		title: '',
		space: '92',
		path: 'M468,511.5L468,524L488,524L508,524L508,511.5L508,499L488,499L468,499L468,511.5Z'
	},
	area_93: {
		href: '',
		title: '',
		space: '93',
		path: 'M346,469.5L346,524L354.5,524L363,524L363,469.5L363,415L354.5,415L346,415L346,469.5Z'
	},
	area_95: {
		href: '',
		title: '',
		space: '95',
		path: 'M551,459.5L551,466L559,466L567,466L567,459.5L567,453L559,453L551,453L551,459.5Z'
	},
	area_96: {
		href: '',
		title: '',
		space: '96',
		path: 'M173.9,277C178,277,182,277,186,277C186,282.7,186,288.4,186,294.1C185.3,294,184,293.9,183.3,293.8C180.3,288.1,177.1,282.6,173.9,277Z'
	},
	area_112: {
		href: '',
		title: '',
		space: '112',
		path: 'M646,430C648.8,430,654.3,430,657,430C657,434.3,657,438.7,657,443C654.3,443,648.8,443,646,443C646,438.7,646,434.3,646,430Z'
	},
	area_113: {
		href: '',
		title: '',
		space: '113',
		path: 'M646,446C648.8,446,654.3,446,657,446C657,448.8,657,454.3,657,457C654.3,457,648.8,457,646,457C646,454.3,646,448.8,646,446Z'
	},
	*/	
}

/* Торговый центр 'Ривьера', этаж 1 (путь '/maps/scheme/3/floor1/') */
var s3_f1 = {
	area_1: {
		href: 'http://sideful.ru',
		title: 'Детский мир',
		space: '1',
		path: 'M 4 101 L 4 198 L 109 198 L 214 198 L 214 101 L 214 4 L 109 4 L 4 4 L 4 101Z'
	},
	area_2: {
		href: 'http://sideful.ru',
		title: 'Centro',
		space: '2',
		path: 'M 217 73 L 217 142 L 235 142 L 253 142 L 253 170 L 253 198 L 286.5 198 L 320 198 L 320 101 L 320 4 L 268.5 4 L 217 4 L 217 73Z'
	},
	area_3: {
		href: 'http://sideful.ru',
		title: 'Лева',
		space: '3',
		path: 'M 217 171.5 L 217 198 L 233.5 198 L 250 198 L 250 171.5 L 250 145 L 233.5 145 L 217 145 L 217 171.5Z'
	},
	area_4: {
		href: 'http://sideful.ru',
		title: 'Мария-ра',
		space: '4',
		path: 'M 323 61.5 L 323 119 L 394.5 119 L 466 119 L 466 132 L 466 145 L 499.5 145 L 533 145 L 533 161 L 533 177 L 588.5 177 L 644 177 L 644 188 L 644 199 L 713 199 L 782 199 L 782 101.5 L 782 4 L 552.5 4 L 323 4 L 323 61.5Z'
	},
	area_5: {
		href: 'http://sideful.ru',
		title: 'Первая помощь',
		space: '5',
		path: 'M 323 160 L 323 198 L 339 198 L 355 198 L 355 160 L 355 122 L 339 122 L 323 122 L 323 160Z'
	},
	area_6: {
		href: 'http://sideful.ru',
		title: 'Аквамир',
		space: '6',
		path: 'M 358 160 L 358 198 L 373.5 198 L 389 198 L 389 160 L 389 122 L 373.5 122 L 358 122 L 358 160Z'
	},
	area_7: {
		href: 'http://sideful.ru',
		title: 'Dino ricci',
		space: '7',
		path: 'M 392 149.5 L 392 177 L 427.5 177 L 463 177 L 463 149.5 L 463 122 L 427.5 122 L 392 122 L 392 149.5Z'
	},
	area_8: {
		href: 'http://sideful.ru',
		title: 'Исида',
		space: '8',
		path: 'M 466 162.5 L 466 177 L 498 177 L 530 177 L 530 162.5 L 530 148 L 498 148 L 466 148 L 466 162.5Z'
	},
	area_9: {
		href: 'http://sideful.ru',
		title: 'Яшма золото',
		space: '9',
		path: 'M 533 189.5 L 533 199 L 549.5 199 L 566 199 L 566 189.5 L 566 180 L 549.5 180 L 533 180 L 533 189.5Z'
	},
	area_10: {
		href: 'http://sideful.ru',
		title: 'Уралсиб',
		space: '10',
		path: 'M 569 189.5 L 569 199 L 587 199 L 605 199 L 605 189.5 L 605 180 L 587 180 L 569 180 L 569 189.5Z'
	},
	area_11: {
		href: 'http://sideful.ru',
		title: 'Исида',
		space: '11',
		path: 'M 608 189.5 L 608 199 L 624.5 199 L 641 199 L 641 189.5 L 641 180 L 624.5 180 L 608 180 L 608 189.5Z'
	},
	area_12: {
		href: 'http://sideful.ru',
		title: 'Dolce vita',
		space: '12',
		path: 'M 785 101.5 L 785 199 L 799 199 L 813 199 L 813 101.5 L 813 4 L 799 4 L 785 4 L 785 101.5Z'
	},
	area_13: {
		href: 'http://sideful.ru',
		title: 'Глория джинс',
		space: '13',
		path: 'M 816 66 L 816 92 L 851 92 L 886 92 L 886 145.5 L 886 199 L 921 199 L 956 199 L 956 119.5 L 956 40 L 886 40 L 816 40 L 816 66Z'
	},
	area_14: {
		href: 'http://sideful.ru',
		title: 'S oliver',
		space: '14',
		path: 'M 816 147 L 816 199 L 833 199 L 850 199 L 850 147 L 850 95 L 833 95 L 816 95 L 816 147Z'
	},
	area_15: {
		href: 'http://sideful.ru',
		title: 'Ecco',
		space: '15',
		path: 'M 853 147 L 853 199 L 868 199 L 883 199 L 883 147 L 883 95 L 868 95 L 853 95 L 853 147Z'
	},
	area_16: {
		href: 'http://sideful.ru',
		title: 'Детская одежда',
		space: '16',
		path: 'M 4 218 L 4 235 L 21 235 L 38 235 L 38 218 L 38 201 L 21 201 L 4 201 L 4 218Z'
	},
	area_17: {
		href: 'http://sideful.ru',
		title: 'Мини босс',
		space: '17',
		path: 'M 4 272 L 4 306 L 21 306 L 38 306 L 38 272 L 38 238 L 21 238 L 4 238 L 4 272Z'
	},
	area_18: {
		href: 'http://sideful.ru',
		title: 'Рукоделие',
		space: '18',
		path: 'M 131 233.5 L 131 244 L 154 244 L 177 244 L 177 233.5 L 177 223 L 154 223 L 131 223 L 131 233.5Z'
	},
	area_21: {
		href: 'http://sideful.ru',
		title: '7 news',
		space: '21',
		path: 'M 256 233.5 L 256 244 L 278 244 L 300 244 L 300 233.5 L 300 223 L 278 223 L 256 223 L 256 233.5Z'
	},
	area_22: {
		href: 'http://sideful.ru',
		title: 'Бижутерия',
		space: '22',
		path: 'M 303 233.5 L 303 244 L 325 244 L 347 244 L 347 233.5 L 347 223 L 325 223 L 303 223 L 303 233.5Z'
	},
	area_23: {
		href: 'http://sideful.ru',
		title: 'Мюз',
		space: '23',
		path: 'M 350 233.5 L 350 244 L 375.5 244 L 401 244 L 401 233.5 L 401 223 L 375.5 223 L 350 223 L 350 233.5Z'
	},
	area_24: {
		href: 'http://sideful.ru',
		title: 'Наше серебро',
		space: '24',
		path: 'M 404 233.5 L 404 244 L 421.5 244 L 439 244 L 439 233.5 L 439 223 L 421.5 223 L 404 223 L 404 233.5Z'
	},
	area_26: {
		href: 'http://sideful.ru',
		title: 'Совком банк',
		space: '26',
		path: 'M 524 233.5 L 524 244 L 545.5 244 L 567 244 L 567 233.5 L 567 223 L 545.5 223 L 524 223 L 524 233.5Z'
	},
	area_27: {
		href: 'http://sideful.ru',
		title: 'Кофе на вынос',
		space: '27',
		path: 'M 604 233.5 L 604 244 L 621.5 244 L 639 244 L 639 233.5 L 639 223 L 621.5 223 L 604 223 L 604 233.5Z'
	},
	area_28: {
		href: 'http://sideful.ru',
		title: 'Итальянское мороженое',
		space: '28',
		path: 'M 642 233.5 L 642 244 L 670 244 L 698 244 L 698 233.5 L 698 223 L 670 223 L 642 223 L 642 233.5Z'
	},
	area_30: {
		href: 'http://sideful.ru',
		title: 'Бижутерия',
		space: '30',
		path: 'M 774 233.5 L 774 244 L 794 244 L 814 244 L 814 233.5 L 814 223 L 794 223 L 774 223 L 774 233.5Z'
	},
	area_31: {
		href: 'http://sideful.ru',
		title: 'Мегафон',
		space: '31',
		path: 'M 817 233.5 L 817 244 L 834 244 L 851 244 L 851 233.5 L 851 223 L 834 223 L 817 223 L 817 233.5Z'
	},
	area_32: {
		href: 'http://sideful.ru',
		title: 'Новэкс',
		space: '32',
		path: 'M 41 289 L 41 309 L 22.5 309 L 4 309 L 4 385 L 4 461 L 56 461 L 108 461 L 108 365 L 108 269 L 74.5 269 L 41 269 L 41 289Z'
	},
	area_33: {
		href: 'http://sideful.ru',
		title: 'Одежда',
		space: '33',
		path: 'M 111 365 L 111 461 L 127 461 L 143 461 L 143 365 L 143 269 L 127 269 L 111 269 L 111 365Z'
	},
	area_34: {
		href: 'http://sideful.ru',
		title: 'El tempo',
		space: '34',
		path: 'M 146 341.5 L 146 414 L 162 414 L 178 414 L 178 341.5 L 178 269 L 162 269 L 146 269 L 146 341.5Z'
	},
	area_35: {
		href: 'http://sideful.ru',
		title: 'Золотой телец',
		space: '35',
		path: 'M 181 341.5 L 181 414 L 198 414 L 215 414 L 215 341.5 L 215 269 L 198 269 L 181 269 L 181 341.5Z'
	},
	area_36: {
		href: 'http://sideful.ru',
		title: 'Аляска',
		space: '36',
		path: 'M 218 341.5 L 218 414 L 249.5 414 L 281 414 L 281 341.5 L 281 269 L 249.5 269 L 218 269 L 218 341.5Z'
	},
	area_37: {
		href: 'http://sideful.ru',
		title: 'Планета стерео',
		space: '37',
		path: 'M 284 281.5 L 284 294 L 300 294 L 316 294 L 316 281.5 L 316 269 L 300 269 L 284 269 L 284 281.5Z'
	},
	area_38: {
		href: 'http://sideful.ru',
		title: 'Евросеть',
		space: '38',
		path: 'M 319 281.5 L 319 294 L 336 294 L 353 294 L 353 281.5 L 353 269 L 336 269 L 319 269 L 319 281.5Z'
	},
	area_39: {
		href: 'http://sideful.ru',
		title: 'Банк',
		space: '39',
		path: 'M 319 308.5 L 319 320 L 336 320 L 353 320 L 353 308.5 L 353 297 L 336 297 L 319 297 L 319 308.5Z'
	},
	area_40: {
		href: 'http://sideful.ru',
		title: 'Calipso',
		space: '40',
		path: 'M 284 344 L 284 391 L 318.5 391 L 353 391 L 353 357 L 353 323 L 334.5 323 L 316 323 L 316 310 L 316 297 L 300 297 L 284 297 L 284 344Z'
	},
	area_41: {
		href: 'http://sideful.ru',
		title: 'Лазурит',
		space: '41',
		path: 'M 284 405.5 L 284 417 L 215 417 L 146 417 L 146 439 L 146 461 L 233.5 461 L 321 461 L 321 456 C 321 453.2 321.3 451 321.8 451 C 322.2 451 323.7 450 325.2 448.7 C 326.6 447.5 328.8 445.8 330.1 445 C 331.3 444.2 333.4 442.5 334.6 441.3 C 335.7 440 337.2 439 337.8 439 C 338.4 439 339.4 438.1 340 437 C 340.6 435.9 341.5 435 342 435 C 343 435 345.8 433 349.2 429.7 C 350.2 428.8 351.5 428 352 428 C 352.6 428 353 421.7 353 411 L 353 394 L 318.5 394 L 284 394 L 284 405.5Z'
	},
	area_43: {
		href: 'http://sideful.ru',
		title: 'Золото России',
		space: '43',
		path: 'M 395 323 L 395 356 L 427.5 356 L 460 356 L 460 323 L 460 290 L 427.5 290 L 395 290 L 395 323Z'
	},
	area_44: {
		href: 'http://sideful.ru',
		title: 'Befree',
		space: '44',
		path: 'M 463 323 L 463 356 L 481 356 L 499 356 L 499 408.5 L 499 461 L 533 461 L 567 461 L 567 410 L 567 359 L 549.5 359 L 532 359 L 532 324.5 L 532 290 L 497.5 290 L 463 290 L 463 323Z'
	},
	area_45: {
		href: 'http://sideful.ru',
		title: 'Форнэ',
		space: '45',
		path: 'M 395 376.5 L 395 394 L 419 394 L 443 394 L 443 427.5 L 443 461 L 469.5 461 L 496 461 L 496 410 L 496 359 L 445.5 359 L 395 359 L 395 376.5Z'
	},
	area_46: {
		href: 'http://sideful.ru',
		title: 'Дверидоф',
		space: '46',
		path: 'M 395 413 L 395 429 L 417.5 429 L 440 429 L 440 413 L 440 397 L 417.5 397 L 395 397 L 395 413Z'
	},
	area_48: {
		href: 'http://sideful.ru',
		title: 'Лэтуаль',
		space: '48',
		path: 'M 535 312.5 L 535 356 L 569 356 L 603 356 L 603 312.5 L 603 269 L 569 269 L 535 269 L 535 312.5Z'
	},
	area_49: {
		href: 'http://sideful.ru',
		title: 'Mango',
		space: '49',
		path: 'M 606 314 L 606 359 L 588 359 L 570 359 L 570 410 L 570 461 L 613.5 461 L 657 461 L 657 365 L 657 269 L 631.5 269 L 606 269 L 606 314Z'
	},
	area_50: {
		href: 'http://sideful.ru',
		title: 'Incity',
		space: '50',
		path: 'M 660 365 L 660 461 L 694 461 L 728 461 L 728 440.5 L 728 420 L 770.5 420 L 813 420 L 813 389.5 L 813 359 L 761.5 359 L 710 359 L 710 314 L 710 269 L 685 269 L 660 269 L 660 365Z'
	},
	area_51: {
		href: 'http://sideful.ru',
		title: 'Сумки люкс',
		space: '51',
		path: 'M 713 312.5 L 713 356 L 729 356 L 745 356 L 745 312.5 L 745 269 L 729 269 L 713 269 L 713 312.5Z'
	},
	area_52: {
		href: 'http://sideful.ru',
		title: 'Русская охота',
		space: '52',
		path: 'M 748 312.5 L 748 356 L 765 356 L 782 356 L 782 312.5 L 782 269 L 765 269 L 748 269 L 748 312.5Z'
	},
	area_53: {
		href: 'http://sideful.ru',
		title: 'Felichita',
		space: '53',
		path: 'M 785 312.5 L 785 356 L 799 356 L 813 356 L 813 312.5 L 813 269 L 799 269 L 785 269 L 785 312.5Z'
	},
	area_54: {
		href: 'http://sideful.ru',
		title: 'Adidas kids',
		space: '54',
		path: 'M 816 344.5 L 816 420 L 834 420 L 852 420 L 852 344.5 L 852 269 L 834 269 L 816 269 L 816 344.5Z'
	},
	area_55: {
		href: 'http://sideful.ru',
		title: 'Adidas',
		space: '55',
		path: 'M 855 344.5 L 855 420 L 872 420 L 889 420 L 889 440.5 L 889 461 L 922.5 461 L 956 461 L 956 365 L 956 269 L 905.5 269 L 855 269 L 855 344.5Z'
	},
	/*
	area_19: {
		href: '',
		title: '',
		space: '19',
		path: 'M 180 233.5 L 180 244 L 197.5 244 L 215 244 L 215 233.5 L 215 223 L 197.5 223 L 180 223 L 180 233.5Z'
	},
	area_20: {
		href: '',
		title: '',
		space: '20',
		path: 'M 218 233.5 L 218 244 L 235.5 244 L 253 244 L 253 233.5 L 253 223 L 235.5 223 L 218 223 L 218 233.5Z'
	},
	area_25: {
		href: '',
		title: '',
		space: '25',
		path: 'M 442 233.5 L 442 244 L 461 244 L 480 244 L 480 233.5 L 480 223 L 461 223 L 442 223 L 442 233.5Z'
	},
	area_29: {
		href: '',
		title: '',
		space: '29',
		path: 'M 723 233.5 L 723 244 L 736 244 L 749 244 L 749 233.5 L 749 223 L 736 223 L 723 223 L 723 233.5Z'
	},
	area_42: {
		href: '',
		title: '',
		space: '42',
		path: 'M 349 433.7 C 345.8 435.9 344.3 437.1 341.9 439.2 C 340.9 440.2 339.5 441 339 441 C 338.4 441 337.7 441.7 337.4 442.5 C 337 443.3 336.4 444 335.9 444 C 335.3 444 334.2 444.6 333.4 445.2 C 332.6 445.9 331.4 447 330.7 447.5 C 330 448.1 328.3 449.3 326.8 450.3 C 324.4 451.8 324 452.7 324 456.5 L 324 461 L 338.5 461 L 353 461 L 353 446.5 C 353 438.5 352.7 432 352.2 432 C 351.8 432 350.3 432.8 349 433.7Z'
	},
	area_47: {
		href: 'http://sideful.ru',
		title: '',
		space: '100',
		path: 'M 395 446.5 L 395 461 L 417.5 461 L 440 461 L 440 446.5 L 440 432 L 417.5 432 L 395 432 L 395 446.5Z'
	},
	*/
}

/* Торговый центр 'Ривьера', этаж 2 (путь '/maps/scheme/3/floor2/') */
var s3_f2 = {
	area_1: {
		href: 'http://sideful.ru',
		title: 'Спортмастер',
		space: '1',
		path: 'M 4 101 L 4 198 L 109.5 198 L 215 198 L 215 187.5 L 215 177 L 247.5 177 L 280 177 L 280 108.5 L 280 40 L 246 40 L 212 40 L 212 22 L 212 4 L 108 4 L 4 4 L 4 101Z'
	},
	area_2: {
		href: 'http://sideful.ru',
		title: 'Ostin',
		space: '2',
		path: 'M 308 22 L 308 40 L 295.5 40 L 283 40 L 283 108.5 L 283 177 L 344.5 177 L 406 177 L 406 167.5 L 406 158 L 415 158 L 424 158 L 424 81 L 424 4 L 366 4 L 308 4 L 308 22Z'
	},
	area_4: {
		href: 'http://sideful.ru',
		title: 'Белвест',
		space: '4',
		path: 'M 427 81 L 427 158 L 445 158 L 463 158 L 463 81 L 463 4 L 445 4 L 427 4 L 427 81Z'
	},
	area_5: {
		href: 'http://sideful.ru',
		title: 'Синар',
		space: '5',
		path: 'M 466 81 L 466 158 L 480.5 158 L 495 158 L 495 81 L 495 4 L 480.5 4 L 466 4 L 466 81Z'
	},
	area_6: {
		href: 'http://sideful.ru',
		title: 'Кинотеатр',
		space: '6',
		path: 'M 498 73 L 498 142 L 550 142 L 602 142 L 602 150 L 602 158 L 606 158 L 610 158 L 610 81 L 610 4 L 554 4 L 498 4 L 498 73Z'
	},
	area_7: {
		href: 'http://sideful.ru',
		title: 'Непонятно',
		space: '7',
		path: 'M 498 151.5 L 498 158 L 514 158 L 530 158 L 530 151.5 L 530 145 L 514 145 L 498 145 L 498 151.5Z'
	},
	area_8: {
		href: 'http://sideful.ru',
		title: 'Непонятно',
		space: '8',
		path: 'M 533 151.5 L 533 158 L 543 158 L 553 158 L 553 151.5 L 553 145 L 543 145 L 533 145 L 533 151.5Z'
	},
	area_9: {
		href: 'http://sideful.ru',
		title: 'Непонятно',
		space: '9',
		path: 'M 556 151.5 L 556 158 L 567.5 158 L 579 158 L 579 151.5 L 579 145 L 567.5 145 L 556 145 L 556 151.5Z'
	},
	area_10: {
		href: 'http://sideful.ru',
		title: '',
		space: '10',
		path: 'M 582 151.5 L 582 158 L 590.5 158 L 599 158 L 599 151.5 L 599 145 L 590.5 145 L 582 145 L 582 151.5Z'
	},
	area_11: {
		href: 'http://sideful.ru',
		title: 'Кинотеатр',
		space: '11',
		path: 'M 642 81 L 642 158 L 669.5 158 L 697 158 L 697 152 L 697 146 L 720.5 146 L 744 146 L 744 75 L 744 4 L 693 4 L 642 4 L 642 81Z'
	},
	area_12: {
		href: 'http://sideful.ru',
		title: '4D',
		space: '12',
		path: 'M 700 159.5 L 700 170 L 718.5 170 L 737 170 L 737 159.5 L 737 149 L 718.5 149 L 700 149 L 700 159.5Z'
	},
	area_13: {
		href: 'http://sideful.ru',
		title: 'Боулинг',
		space: '13',
		path: 'M 797 48 L 797 92 L 806.5 92 L 816 92 L 816 84.5 L 816 77 L 886 77 L 956 77 L 956 40.5 L 956 4 L 876.5 4 L 797 4 L 797 48Z'
	},
	area_14: {
		href: 'http://sideful.ru',
		title: 'Обезьяна',
		space: '14',
		path: 'M 819 87.5 L 819 95 L 808 95 L 797 95 L 797 120.5 L 797 146 L 876.5 146 L 956 146 L 956 113 L 956 80 L 887.5 80 L 819 80 L 819 87.5Z'
	},
	area_15: {
		href: 'http://sideful.ru',
		title: 'М-видео',
		space: '15',
		path: 'M 4 331 L 4 461 L 214 461 L 424 461 L 424 427.5 L 424 394 L 319.5 394 L 215 394 L 215 297.5 L 215 201 L 109.5 201 L 4 201 L 4 331Z'
	},
	area_16: {
		href: 'http://sideful.ru',
		title: 'Мороженое',
		space: '16',
		path: 'M 562 189 L 562 199 L 587 199 L 612 199 L 612 189 L 612 179 L 587 179 L 562 179 L 562 189Z'
	},
	area_17: {
		href: 'http://sideful.ru',
		title: 'МТС',
		space: '17',
		path: 'M 634 217.5 L 634 233 L 653 233 L 672 233 L 672 217.5 L 672 202 L 653 202 L 634 202 L 634 217.5Z'
	},
	area_18: {
		href: 'http://sideful.ru',
		title: 'Дивизион',
		space: '18',
		path: 'M 634 251 L 634 266 L 653 266 L 672 266 L 672 251 L 672 236 L 653 236 L 634 236 L 634 251Z'
	},
	area_19: {
		href: 'http://sideful.ru',
		title: 'O-la-la',
		space: '19',
		path: 'M 675 234 L 675 266 L 690 266 L 705 266 L 705 234 L 705 202 L 690 202 L 675 202 L 675 234Z'
	},
	area_20: {
		href: 'http://sideful.ru',
		title: 'Непонятно',
		space: '20',
		path: 'M 708 217.5 L 708 233 L 728.5 233 L 749 233 L 749 217.5 L 749 202 L 728.5 202 L 708 202 L 708 217.5Z'
	},
	area_21: {
		href: 'http://sideful.ru',
		title: 'Лэнджери',
		space: '21',
		path: 'M 708 251 L 708 266 L 728.5 266 L 749 266 L 749 251 L 749 236 L 728.5 236 L 708 236 L 708 251Z'
	},
	area_22: {
		href: 'http://sideful.ru',
		title: 'Детский лабиринт',
		space: '22',
		path: 'M 752 217.5 L 752 233 L 770 233 L 788 233 L 788 217.5 L 788 202 L 770 202 L 752 202 L 752 217.5Z'
	},
	area_23: {
		href: 'http://sideful.ru',
		title: 'Белье',
		space: '23',
		path: 'M 752 251 L 752 266 L 770 266 L 788 266 L 788 251 L 788 236 L 770 236 L 752 236 L 752 251Z'
	},
	area_24: {
		href: 'http://sideful.ru',
		title: 'Винегрет',
		space: '24',
		path: 'M 854 164.5 L 854 180 L 868.5 180 L 883 180 L 883 164.5 L 883 149 L 868.5 149 L 854 149 L 854 164.5Z'
	},
	area_25: {
		href: 'http://sideful.ru',
		title: 'Hasburger',
		space: '25',
		path: 'M 886 164.5 L 886 180 L 903 180 L 920 180 L 920 164.5 L 920 149 L 903 149 L 886 149 L 886 164.5Z'
	},
	area_26: {
		href: 'http://sideful.ru',
		title: 'Таки суши',
		space: '26',
		path: 'M 923 164.5 L 923 180 L 939.5 180 L 956 180 L 956 164.5 L 956 149 L 939.5 149 L 923 149 L 923 164.5Z'
	},
	area_28: {
		href: 'http://sideful.ru',
		title: 'Neon',
		space: '28',
		path: 'M 218 344 L 218 391 L 233 391 L 248 391 L 248 344 L 248 297 L 233 297 L 218 297 L 218 344Z'
	},
	area_29: {
		href: 'http://sideful.ru',
		title: 'Fresh',
		space: '29',
		path: 'M 251 344 L 251 391 L 266 391 L 281 391 L 281 344 L 281 297 L 266 297 L 251 297 L 251 344Z'
	},
	area_30: {
		href: 'http://sideful.ru',
		title: 'Дикси',
		space: '30',
		path: 'M 284 344 L 284 391 L 300 391 L 316 391 L 316 344 L 316 297 L 300 297 L 284 297 L 284 344Z'
	},
	area_31: {
		href: 'http://sideful.ru',
		title: 'Одежда',
		space: '31',
		path: 'M 319 344 L 319 391 L 336 391 L 353 391 L 353 344 L 353 297 L 336 297 L 319 297 L 319 344Z'
	},
	area_32: {
		href: 'http://sideful.ru',
		title: 'Родео джинс',
		space: '32',
		path: 'M 356 344 L 356 391 L 374 391 L 392 391 L 392 344 L 392 297 L 374 297 L 356 297 L 356 344Z'
	},
	area_33: {
		href: 'http://sideful.ru',
		title: 'The Mix',
		space: '33',
		path: 'M 395 344.5 L 395 391 L 409.5 391 L 424 391 L 424 351.5 L 424 312 L 419 309.8 C 416.3 308.6 414 307.3 414 306.8 C 414 306.4 413.6 306 413.1 306 C 412.6 306 409 304.2 405.1 302 C 401.2 299.8 397.4 298 396.5 298 C 395.2 298 395 303.4 395 344.5Z'
	},
	area_34: {
		href: 'http://sideful.ru',
		title: 'Одежда',
		space: '34',
		path: 'M 427 387 L 427 461 L 443.5 461 L 460 461 L 460 387 L 460 313 L 443.5 313 L 427 313 L 427 387Z'
	},
	area_35: {
		href: 'http://sideful.ru',
		title: 'Спорт России',
		space: '35',
		path: 'M 463 387 L 463 461 L 469.5 461 L 476 461 L 476 454 L 476 447 L 480 447 L 484 447 L 484 427.5 L 484 408 L 490 408 L 496 408 L 496 360.5 L 496 313 L 479.5 313 L 463 313 L 463 387Z'
	},
	area_36: {
		href: 'http://sideful.ru',
		title: 'Avelon',
		space: '36',
		path: 'M 499 360.5 L 499 408 L 515.5 408 L 532 408 L 532 360.5 L 532 313 L 515.5 313 L 499 313 L 499 360.5Z'
	},
	area_37: {
		href: 'http://sideful.ru',
		title: 'Сударь',
		space: '37',
		path: 'M 535 360.5 L 535 408 L 551 408 L 567 408 L 567 360.5 L 567 313 L 551 313 L 535 313 L 535 360.5Z'
	},
	area_38: {
		href: 'http://sideful.ru',
		title: 'Одежда',
		space: '38',
		path: 'M 570 360.5 L 570 408 L 586.5 408 L 603 408 L 603 360.5 L 603 313 L 586.5 313 L 570 313 L 570 360.5Z'
	},
	area_40: {
		href: 'http://sideful.ru',
		title: 'Офиса салон Paris',
		space: '100',
		path: 'M 499 443.5 L 499 461 L 551 461 L 603 461 L 603 443.5 L 603 426 L 551 426 L 499 426 L 499 443.5Z'
	},
	area_41: {
		href: 'http://sideful.ru',
		title: 'Pegas',
		space: '41',
		path: 'M 618 342.5 L 618 392 L 627.5 392 L 637 392 L 637 342.5 L 637 293 L 627.5 293 L 618 293 L 618 342.5Z'
	},
	area_42: {
		href: 'http://sideful.ru',
		title: 'Фэмили',
		space: '42',
		path: 'M 640 344 L 640 395 L 629 395 L 618 395 L 618 419 L 618 443 L 663.5 443 L 709 443 L 709 452 L 709 461 L 727 461 L 745 461 L 745 417 L 745 373 L 727.5 373 L 710 373 L 710 333 L 710 293 L 675 293 L 640 293 L 640 344Z'
	},
	area_43: {
		href: 'http://sideful.ru',
		title: 'Пеплос',
		space: '43',
		path: 'M 713 331.5 L 713 370 L 729 370 L 745 370 L 745 331.5 L 745 293 L 729 293 L 713 293 L 713 331.5Z'
	},
	area_44: {
		href: 'http://sideful.ru',
		title: 'Буква',
		space: '44',
		path: 'M 748 377 L 748 461 L 765 461 L 782 461 L 782 377 L 782 293 L 765 293 L 748 293 L 748 377Z'
	},
	area_45: {
		href: 'http://sideful.ru',
		title: 'АСМ мебель',
		space: '45',
		path: 'M 785 377 L 785 461 L 799 461 L 813 461 L 813 377 L 813 293 L 799 293 L 785 293 L 785 377Z'
	},
	area_46: {
		href: 'http://sideful.ru',
		title: 'Игровая комната',
		space: '46',
		path: 'M 816 377 L 816 461 L 886 461 L 956 461 L 956 408 L 956 355 L 919.5 355 L 883 355 L 883 340 L 883 325 L 867 325 L 851 325 L 851 309 L 851 293 L 833.5 293 L 816 293 L 816 377Z'
	},
	area_48: {
		href: 'http://sideful.ru',
		title: 'Manhattan Pizza',
		space: '48',
		path: 'M 886 322.5 L 886 352 L 903 352 L 920 352 L 920 322.5 L 920 293 L 903 293 L 886 293 L 886 322.5Z'
	},
	area_49: {
		href: 'http://sideful.ru',
		title: 'Блинная Сковорода',
		space: '49',
		path: 'M 923 322.5 L 923 352 L 939.5 352 L 956 352 L 956 322.5 L 956 293 L 939.5 293 L 923 293 L 923 322.5Z'
	},
	/*
	area_3: {
		href: '',
		title: '',
		space: '3',
		path: 'M 409 166.5 L 409 172 L 416.5 172 L 424 172 L 424 166.5 L 424 161 L 416.5 161 L 409 161 L 409 166.5Z'
	},
	area_27: {
		href: '',
		title: '',
		space: '27',
		path: 'M 854 236.5 L 854 290 L 905 290 L 956 290 L 956 236.5 L 956 183 L 905 183 L 854 183 L 854 236.5Z'
	},
	area_39: {
		href: '',
		title: '',
		space: '39',
		path: 'M 479 455.5 L 479 461 L 487.5 461 L 496 461 L 496 455.5 L 496 450 L 487.5 450 L 479 450 L 479 455.5Z'
	},
	area_47: {
		href: '',
		title: '',
		space: '47',
		path: 'M 854 307.5 L 854 322 L 868.5 322 L 883 322 L 883 307.5 L 883 293 L 868.5 293 L 854 293 L 854 307.5Z'
	},
	area_50: {
		href: '',
		title: '',
		space: '50',
		path: 'M 747 76.8 L 747 149.6 L 743.5 149.2 L 740 148.8 L 740 158.9 C 740 167 740.3 169 741.4 169 C 742.2 169 743.5 168.3 744.4 167.5 C 745.2 166.7 746.4 166 747 166 C 747.6 166 748.3 165.3 748.6 164.5 C 749 163.7 749.7 163 750.3 163 C 751.4 163 762.3 155 762.8 153.7 C 763 153.3 763.8 153 764.5 153 C 765.2 153 766 152.7 766.2 152.2 C 766.4 151.8 768.3 150.3 770.6 148.7 C 774.3 146.2 775.4 146 784.3 146 L 794 146 L 794 75 L 794 4 L 770.5 4 L 747 4 L 747 76.8Z'
	},
	*/
}

/* Торговый центр 'Осинники', этаж цокольный (путь '/maps/scheme/4/floor1/') */
var s4_f1 = {
	area_4: {
		href: 'http://sideful.ru',
		title: 'Бытовая техника',
		space: '4',
		path: 'M 544 264 L 544 524 L 750 524 L 956 524 L 956 436 L 956 348 L 916 348 L 876 348 L 876 295.5 L 876 243 L 916 243 L 956 243 L 956 163.5 L 956 84 L 862.5 84 L 769 84 L 769 44 L 769 4 L 656.5 4 L 544 4 L 544 264Z'
	},
	area_6: {
		href: 'http://sideful.ru',
		title: 'Распродажа',
		space: '6',
		path: 'M 133 109.5 L 133 132 L 90.5 132 L 48 132 L 48 286 L 48 440 L 70.5 440 L 92.9 440 L 105.7 431.1 C 112.7 426.2 120.7 420.6 123.3 418.8 C 125.9 417 129.7 414.3 131.7 412.7 L 135.3 410 L 257.1 410 L 379 410 L 379 248.5 L 379 87 L 256 87 L 133 87 L 133 109.5Z'
	},
	area_7: {
		href: 'http://sideful.ru',
		title: 'DNS',
		space: '7',
		path: 'M 382 279.5 L 382 472 L 461.5 472 L 541 472 L 541 279.5 L 541 87 L 461.5 87 L 382 87 L 382 279.5Z'
	},
	area_11: {
		href: 'http://sideful.ru',
		title: 'Фотоуслуги',
		space: '11',
		path: 'M 219 442.5 L 219 472 L 267.5 472 L 316 472 L 316 442.5 L 316 413 L 267.5 413 L 219 413 L 219 442.5Z'
	},
	/*
	area_1: {
		href: '',
		title: '',
		space: '1',
		path: 'M 48 66.5 L 48 129 L 89 129 L 130 129 L 130 66.5 L 130 4 L 89 4 L 48 4 L 48 66.5Z'
	},
	area_2: {
		href: '',
		title: '',
		space: '2',
		path: 'M 133 44 L 133 84 L 256 84 L 379 84 L 379 44 L 379 4 L 256 4 L 133 4 L 133 44Z'
	},
	area_3: {
		href: '',
		title: '',
		space: '3',
		path: 'M 382 44 L 382 84 L 461.5 84 L 541 84 L 541 44 L 541 4 L 461.5 4 L 382 4 L 382 44Z'
	},
	area_5: {
		href: '',
		title: '',
		space: '5',
		path: 'M 772 42.5 L 772 81 L 864 81 L 956 81 L 956 42.5 L 956 4 L 864 4 L 772 4 L 772 42.5Z'
	},
	area_8: {
		href: '',
		title: '',
		space: '8',
		path: 'M 879 295.5 L 879 345 L 917.5 345 L 956 345 L 956 295.5 L 956 246 L 917.5 246 L 879 246 L 879 295.5Z'
	},
	area_9: {
		href: '',
		title: '',
		space: '9',
		path: 'M 4 446.5 L 4 524 L 24.5 524 L 45 524 L 45 446.5 L 45 369 L 24.5 369 L 4 369 L 4 446.5Z'
	},
	area_10: {
		href: '',
		title: '',
		space: '10',
		path: 'M 126 420.5 C 120.2 424.6 110.6 431.3 104.5 435.5 L 93.5 443 L 70.7 443 L 47.9 443 L 48.3 490.2 C 48.5 516.2 48.9 538.2 49.2 539 C 49.5 539.8 50 541.8 50.4 543.5 C 53.4 555.6 62.3 571.8 71.2 581.1 C 79.5 589.9 92.6 598.4 104.1 602.6 C 108.8 604.2 109.5 604.4 117.7 606 C 124.2 607.2 146.5 606.6 150.3 605.1 C 151.8 604.5 154.4 603.8 156.1 603.5 C 160.6 602.7 171.7 597.3 179.3 592.3 C 195.9 581.3 207.7 564.2 213.8 542.2 C 215.8 535.2 215.9 532.2 216 473.9 L 216.1 413 L 176.3 413.1 L 136.5 413.1 L 126 420.5Z'
	},
	area_12: {
		href: '',
		title: '',
		space: '12',
		path: 'M 319 444 L 319 475 L 269 475 L 219 475 L 219 499.5 L 219 524 L 299 524 L 379 524 L 379 512 L 379 500 L 395.5 500 L 412 500 L 412 512 L 412 524 L 417.5 524 L 423 524 L 423 512 L 423 500 L 482 500 L 541 500 L 541 487.5 L 541 475 L 446 475 L 351 475 L 351 460 L 351 445 L 365 445 L 379 445 L 379 429 L 379 413 L 349 413 L 319 413 L 319 444Z'
	},
	area_13: {
		href: '',
		title: '',
		space: '13',
		path: 'M 354 460 L 354 472 L 366.5 472 L 379 472 L 379 460 L 379 448 L 366.5 448 L 354 448 L 354 460Z'
	},
	area_14: {
		href: '',
		title: '',
		space: '14',
		path: 'M 382 513.5 L 382 524 L 395.5 524 L 409 524 L 409 513.5 L 409 503 L 395.5 503 L 382 503 L 382 513.5Z'
	},
	area_15: {
		href: '',
		title: '',
		space: '15',
		path: 'M 426 513.5 L 426 524 L 483.5 524 L 541 524 L 541 513.5 L 541 503 L 483.5 503 L 426 503 L 426 513.5Z'
	},
	*/
}

/* Торговый центр 'Осинники', этаж 1 (путь '/maps/scheme/4/floor2/') */
var s4_f2 = {
	area_2: {
		href: 'http://sideful.ru',
		title: 'Мария-ра',
		space: '2',
		path: 'M 219 132 L 219 260 L 354 260 L 489 260 L 489 308 L 489 356 L 556.5 356 L 624 356 L 624 180 L 624 4 L 421.5 4 L 219 4 L 219 132Z'
	},
	area_3: {
		href: 'http://sideful.ru',
		title: 'Одежда',
		space: '3',
		path: 'M 627 66 L 627 128 L 668.5 128 L 710 128 L 710 326 L 710 524 L 833 524 L 956 524 L 956 331.5 L 956 139 L 912 139 L 868 139 L 868 71.5 L 868 4 L 747.5 4 L 627 4 L 627 66Z'
	},
	area_5: {
		href: 'http://sideful.ru',
		title: 'Кожгалантерея',
		space: '5',
		path: 'M 627 243.5 L 627 356 L 667 356 L 707 356 L 707 243.5 L 707 131 L 667 131 L 627 131 L 627 243.5Z'
	},
	area_6: {
		href: 'http://sideful.ru',
		title: 'Аптека',
		space: '6',
		path: 'M 48 276 L 48 356 L 95 356 L 142 356 L 142 276 L 142 196 L 95 196 L 48 196 L 48 276Z'
	},
	area_7: {
		href: 'http://sideful.ru',
		title: 'Диски',
		space: '7',
		path: 'M 145 276 L 145 356 L 163.5 356 L 182 356 L 182 276 L 182 196 L 163.5 196 L 145 196 L 145 276Z'
	},
	area_9: {
		href: 'http://sideful.ru',
		title: 'Банк',
		space: '9',
		path: 'M 219 309.5 L 219 356 L 259.5 356 L 300 356 L 300 309.5 L 300 263 L 259.5 263 L 219 263 L 219 309.5Z'
	},
	area_10: {
		href: 'http://sideful.ru',
		title: 'Сбербанк',
		space: '10',
		path: 'M 303 309.5 L 303 356 L 341 356 L 379 356 L 379 309.5 L 379 263 L 341 263 L 303 263 L 303 309.5Z'
	},
	area_11: {
		href: 'http://sideful.ru',
		title: 'Русские финансы',
		space: '11',
		path: 'M 382 309.5 L 382 356 L 406 356 L 430 356 L 430 309.5 L 430 263 L 406 263 L 382 263 L 382 309.5Z'
	},
	area_12: {
		href: 'http://sideful.ru',
		title: 'Золото',
		space: '12',
		path: 'M 433 309.5 L 433 356 L 459.5 356 L 486 356 L 486 309.5 L 486 263 L 459.5 263 L 433 263 L 433 309.5Z'
	},
	area_13: {
		href: 'http://sideful.ru',
		title: 'Духи',
		space: '13',
		path: 'M 68 376.5 L 68 386 L 83 386 L 98 386 L 98 376.5 L 98 367 L 83 367 L 68 367 L 68 376.5Z'
	},
	area_15: {
		href: 'http://sideful.ru',
		title: 'Хозтовары',
		space: '15',
		path: 'M 98.1 408 C 87.4 412.9 78.6 417.1 78.4 417.2 C 78.3 417.4 81.3 422.4 85.1 428.4 C 88.9 434.4 92 439.7 92 440.1 C 92 440.8 95.5 439.6 102.5 436.5 C 104.2 435.8 111.8 432.7 119.5 429.5 C 127.2 426.4 133.6 423.7 133.8 423.6 C 133.9 423.4 131.9 419.9 129.2 415.9 C 126.6 411.8 123.1 406.4 121.5 403.8 C 119.8 401.1 118.3 399 118 399 C 117.7 399.1 108.8 403.1 98.1 408Z'
	},
	area_16: {
		href: 'http://sideful.ru',
		title: 'Подключения',
		space: '16',
		path: 'M 122 400 C 122 400.5 122.5 401.2 123.1 401.5 C 123.7 401.9 124.4 403 124.8 403.9 C 125.2 404.8 128 409.5 131 414.3 L 136.5 423 L 156.8 423 L 177 423 L 177 411 L 177 398.9 L 149.5 399.1 C 134.4 399.1 122 399.6 122 400Z'
	},
	area_17: {
		href: 'http://sideful.ru',
		title: 'Церковная лавка',
		space: '17',
		path: 'M 180 411 L 180 423 L 203 423 L 226 423 L 226 411 L 226 399 L 203 399 L 180 399 L 180 411Z'
	},
	area_18: {
		href: 'http://sideful.ru',
		title: 'Сотовые телефоны',
		space: '18',
		path: 'M 229 411 L 229 423 L 272.5 423 L 316 423 L 316 411 L 316 399 L 272.5 399 L 229 399 L 229 411Z'
	},
	area_19: {
		href: 'http://sideful.ru',
		title: 'Нужные вещи',
		space: '19',
		path: 'M 319 411 L 319 423 L 349 423 L 379 423 L 379 411 L 379 399 L 349 399 L 319 399 L 319 411Z'
	},
	area_21: {
		href: 'http://sideful.ru',
		title: 'Цветы',
		space: '21',
		path: 'M 125 430.6 C 112.8 435.8 111.1 436.5 105 438.8 C 102.5 439.7 99.1 441.1 97.3 442 L 94.1 443.5 L 99 451.4 C 101.7 455.7 104.3 459.7 104.7 460.1 C 105.2 460.6 114.3 457.4 125.3 453 C 144.5 445.2 145.1 445 153.4 445 L 162 445 L 162 435.5 L 162 426 L 148.8 426.1 L 135.5 426.2 L 125 430.6Z'
	},
	area_22: {
		href: 'http://sideful.ru',
		title: 'Газеты',
		space: '22',
		path: 'M 165 435.5 L 165 445 L 190.5 445 L 216 445 L 216 435.5 L 216 426 L 190.5 426 L 165 426 L 165 435.5Z'
	},
	area_23: {
		href: 'http://sideful.ru',
		title: 'Сотовые телефоны',
		space: '23',
		path: 'M 439 475 L 439 524 L 490 524 L 541 524 L 541 475 L 541 426 L 490 426 L 439 426 L 439 475Z'
	},
	area_24: {
		href: 'http://sideful.ru',
		title: 'Канцтовары',
		space: '24',
		path: 'M 544 475 L 544 524 L 584 524 L 624 524 L 624 475 L 624 426 L 584 426 L 544 426 L 544 475Z'
	},
	area_25: {
		href: 'http://sideful.ru',
		title: 'Сотовые телефоны',
		space: '25',
		path: 'M 627 475 L 627 524 L 667 524 L 707 524 L 707 475 L 707 426 L 667 426 L 627 426 L 627 475Z'
	},
	area_26: {
		href: 'http://sideful.ru',
		title: 'Фотоуслуги',
		space: '26',
		path: 'M 328 460 L 328 472 L 353.5 472 L 379 472 L 379 460 L 379 448 L 353.5 448 L 328 448 L 328 460Z'
	},
	area_27: {
		href: 'http://sideful.ru',
		title: 'Сотовые телефоны',
		space: '27',
		path: 'M 412 499.5 L 412 524 L 424 524 L 436 524 L 436 499.5 L 436 475 L 424 475 L 412 475 L 412 499.5Z'
	},
	/*
	area_1: {
		href: '',
		title: '',
		space: '1',
		path: 'M 48 98.5 L 48 193 L 132 193 L 216 193 L 216 98.5 L 216 4 L 132 4 L 48 4 L 48 98.5Z'
	},
	area_4: {
		href: '',
		title: '',
		space: '4',
		path: 'M 871 70 L 871 136 L 913.5 136 L 956 136 L 956 70 L 956 4 L 913.5 4 L 871 4 L 871 70Z'
	},
	area_8: {
		href: '',
		title: '',
		space: '8',
		path: 'M 185 276 L 185 356 L 200.5 356 L 216 356 L 216 276 L 216 196 L 200.5 196 L 185 196 L 185 276Z'
	},
	area_14: {
		href: '',
		title: '',
		space: '14',
		path: 'M 4 446.5 L 4 524 L 24.5 524 L 45 524 L 45 446.5 L 45 369 L 24.5 369 L 4 369 L 4 446.5Z'
	},
	area_20: {
		href: '',
		title: '',
		space: '20',
		path: 'M 48 483.4 L 48 523.8 L 132 523.9 L 216 523.9 L 216 485.9 L 216 447.9 L 179.3 448.2 C 144.2 448.5 142.3 448.6 138 450.6 C 128.1 455.3 104.8 464.1 103.6 463.7 C 102.9 463.4 99.7 458.7 96.4 453.1 L 90.5 443 L 69.3 443 L 48 443 L 48 483.4Z'
	},
	area_28: {
		href: '',
		title: '',
		space: '28',
		path: 'M 48.5 533.5 C 48.9 536.8 49.8 541.4 50.6 543.8 C 51.4 546.1 52 548.6 52 549.2 C 52 551.1 58.9 565.1 62.2 569.8 C 71.1 582.6 85.7 594.7 98.4 599.9 C 107.1 603.5 106.8 603.4 116.2 605.5 C 124.8 607.4 142.1 607 151.5 604.6 C 160.6 602.2 173.6 596.2 181.4 590.6 C 200.2 577.2 215.8 549.8 215.5 530.5 L 215.5 527.5 L 131.7 527.5 L 47.9 527.5 L 48.5 533.5Z'
	},
	*/
}

/* Торговый центр 'Осинники', этаж 2 (путь '/maps/scheme/4/floor3/') */
var s4_f3 = {
	area_2: {
		href: 'http://sideful.ru',
		title: 'Мебель',
		space: '2',
		path: 'M 133 45.5 L 133 87 L 90.5 87 L 48 87 L 48 126 L 48 165 L 133.5 165 L 219 165 L 219 260.5 L 219 356 L 284.5 356 L 350 356 L 350 189.5 L 350 23 L 405.5 23 L 461 23 L 461 13.5 L 461 4 L 297 4 L 133 4 L 133 45.5Z'
	},
	area_5: {
		href: 'http://sideful.ru',
		title: 'Обувь',
		space: '5',
		path: 'M 353 191 L 353 356 L 407 356 L 461 356 L 461 191 L 461 26 L 407 26 L 353 26 L 353 191Z'
	},
	area_6: {
		href: 'http://sideful.ru',
		title: 'Бытовая техника',
		space: '6',
		path: 'M 464 198.5 L 464 356 L 517 356 L 570 356 L 570 198.5 L 570 41 L 517 41 L 464 41 L 464 198.5Z'
	},
	area_7: {
		href: 'http://sideful.ru',
		title: 'Двери',
		space: '7',
		path: 'M 48 262 L 48 356 L 70.5 356 L 93 356 L 93 262 L 93 168 L 70.5 168 L 48 168 L 48 262Z'
	},
	area_8: {
		href: 'http://sideful.ru',
		title: 'Одежда',
		space: '8',
		path: 'M 96 186.5 L 96 205 L 119 205 L 142 205 L 142 186.5 L 142 168 L 119 168 L 96 168 L 96 186.5Z'
	},
	area_9: {
		href: 'http://sideful.ru',
		title: 'Детская одежда',
		space: '9',
		path: 'M 145 262 L 145 356 L 180.5 356 L 216 356 L 216 262 L 216 168 L 180.5 168 L 145 168 L 145 262Z'
	},
	area_10: {
		href: 'http://sideful.ru',
		title: 'Офис',
		space: '10',
		path: 'M 96 225.5 L 96 243 L 119 243 L 142 243 L 142 225.5 L 142 208 L 119 208 L 96 208 L 96 225.5Z'
	},
	area_11: {
		href: 'http://sideful.ru',
		title: 'Сувениры',
		space: '11',
		path: 'M 96 301 L 96 356 L 119 356 L 142 356 L 142 301 L 142 246 L 119 246 L 96 246 L 96 301Z'
	},
	area_12: {
		href: 'http://sideful.ru',
		title: 'Зоотовары',
		space: '12',
		path: 'M 664 302.5 L 664 356 L 685.5 356 L 707 356 L 707 302.5 L 707 249 L 685.5 249 L 664 249 L 664 302.5Z'
	},
	area_13: {
		href: 'http://sideful.ru',
		title: 'Одежда',
		space: '13',
		path: 'M 710 302.5 L 710 356 L 748.5 356 L 787 356 L 787 302.5 L 787 249 L 748.5 249 L 710 249 L 710 302.5Z'
	},
	area_14: {
		href: 'http://sideful.ru',
		title: 'Одежда',
		space: '14',
		path: 'M 790 302.5 L 790 356 L 808.5 356 L 827 356 L 827 302.5 L 827 249 L 808.5 249 L 790 249 L 790 302.5Z'
	},
	area_15: {
		href: 'http://sideful.ru',
		title: 'Одежда',
		space: '15',
		path: 'M 830 302.5 L 830 356 L 851.5 356 L 873 356 L 873 302.5 L 873 249 L 851.5 249 L 830 249 L 830 302.5Z'
	},
	area_16: {
		href: 'http://sideful.ru',
		title: 'Одежда',
		space: '16',
		path: 'M 876 315.5 L 876 382 L 916 382 L 956 382 L 956 315.5 L 956 249 L 916 249 L 876 249 L 876 315.5Z'
	},
	area_19: {
		href: 'http://sideful.ru',
		title: 'Оружие',
		space: '19',
		path: 'M 382 398.5 L 382 412 L 418 412 L 454 412 L 454 398.5 L 454 385 L 418 385 L 382 385 L 382 398.5Z'
	},
	area_20: {
		href: 'http://sideful.ru',
		title: 'Подарки',
		space: '20',
		path: 'M 478 398.5 L 478 412 L 499.5 412 L 521 412 L 521 398.5 L 521 385 L 499.5 385 L 478 385 L 478 398.5Z'
	},
	area_21: {
		href: 'http://sideful.ru',
		title: 'Косметика',
		space: '21',
		path: 'M 567 398.5 L 567 412 L 597 412 L 627 412 L 627 398.5 L 627 385 L 597 385 L 567 385 L 567 398.5Z'
	},
	area_23: {
		href: 'http://sideful.ru',
		title: 'Бижутерия',
		space: '23',
		path: 'M 219 435.5 L 219 445 L 237.5 445 L 256 445 L 256 435.5 L 256 426 L 237.5 426 L 219 426 L 219 435.5Z'
	},
	area_24: {
		href: 'http://sideful.ru',
		title: 'Радиотовары',
		space: '24',
		path: 'M 259 435.5 L 259 445 L 298 445 L 337 445 L 337 435.5 L 337 426 L 298 426 L 259 426 L 259 435.5Z'
	},
	area_25: {
		href: 'http://sideful.ru',
		title: 'Пряжа',
		space: '25',
		path: 'M 340 435.5 L 340 445 L 359.5 445 L 379 445 L 379 435.5 L 379 426 L 359.5 426 L 340 426 L 340 435.5Z'
	},
	area_26: {
		href: 'http://sideful.ru',
		title: 'Обувь',
		space: '26',
		path: 'M 439 475 L 439 524 L 490 524 L 541 524 L 541 475 L 541 426 L 490 426 L 439 426 L 439 475Z'
	},
	area_27: {
		href: 'http://sideful.ru',
		title: 'Одежда',
		space: '27',
		path: 'M 544 475 L 544 524 L 564 524 L 584 524 L 584 475 L 584 426 L 564 426 L 544 426 L 544 475Z'
	},
	area_28: {
		href: 'http://sideful.ru',
		title: 'Одежда',
		space: '28',
		path: 'M 587 475 L 587 524 L 605.5 524 L 624 524 L 624 475 L 624 426 L 605.5 426 L 587 426 L 587 475Z'
	},
	area_29: {
		href: 'http://sideful.ru',
		title: 'Одежда',
		space: '29',
		path: 'M 627 475 L 627 524 L 646 524 L 665 524 L 665 475 L 665 426 L 646 426 L 627 426 L 627 475Z'
	},
	area_30: {
		href: 'http://sideful.ru',
		title: 'Одежда',
		space: '30',
		path: 'M 668 475 L 668 524 L 687.5 524 L 707 524 L 707 475 L 707 426 L 687.5 426 L 668 426 L 668 475Z'
	},
	area_31: {
		href: 'http://sideful.ru',
		title: 'Одежда',
		space: '31',
		path: 'M 710 475 L 710 524 L 748.5 524 L 787 524 L 787 475 L 787 426 L 748.5 426 L 710 426 L 710 475Z'
	},
	area_32: {
		href: 'http://sideful.ru',
		title: 'Одежда',
		space: '32',
		path: 'M 790 475 L 790 524 L 831.5 524 L 873 524 L 873 475 L 873 426 L 831.5 426 L 790 426 L 790 475Z'
	},
	area_33: {
		href: 'http://sideful.ru',
		title: 'Губернские окна',
		space: '33',
		path: 'M 48 490.4 C 48 536.8 48.3 540 54.4 555 C 59.4 567.5 70 581.4 79.9 588.8 C 81.9 590.3 83.7 591.7 84 592 C 84.9 592.9 88.4 594.9 95 598.4 C 103 602.6 115 606 124.1 606.7 L 131 607.3 L 131 527.6 L 131 448 L 89.5 448 L 48 448 L 48 490.4Z'
	},
	area_35: {
		href: 'http://sideful.ru',
		title: 'Оптика',
		space: '35',
		path: 'M 382 511.5 L 382 524 L 409 524 L 436 524 L 436 511.5 L 436 499 L 409 499 L 382 499 L 382 511.5Z'
	},
	area_36: {
		href: 'http://sideful.ru',
		title: 'Бижутерия',
		space: '36',
		path: 'M 136.2 526.8 L 133.9 527.2 L 134.2 566.8 L 134.5 606.5 L 139 606.5 C 154.3 606.7 180.6 594.4 191.5 582.1 C 193.1 580.2 196.2 576.8 198.2 574.6 C 205.7 566.5 214.9 545.1 215.3 534.9 C 215.5 531.6 215.3 528.4 214.9 527.8 C 214.3 526.9 203.9 526.6 176.3 526.6 C 155.5 526.5 137.5 526.6 136.2 526.8Z'
	},
	area_37: {
		href: 'http://sideful.ru',
		title: 'Новэкс',
		space: '37',
		path: 'M 464 21 L 464 38 L 518.5 38 L 573 38 L 573 197 L 573 356 L 617 356 L 661 356 L 661 301 L 661 246 L 808.5 246 L 956 246 L 956 192.5 L 956 139 L 912 139 L 868 139 L 868 111.5 L 868 84 L 818.5 84 L 769 84 L 769 44 L 769 4 L 616.5 4 L 464 4 L 464 21Z'
	},
	/*
	area_1: {
		href: '',
		title: '',
		space: '1',
		path: 'M 48 44 L 48 84 L 89 84 L 130 84 L 130 44 L 130 4 L 89 4 L 48 4 L 48 44Z'
	},
	area_3: {
		href: '',
		title: '',
		space: '3',
		path: 'M 772 42.5 L 772 81 L 820 81 L 868 81 L 868 42.5 L 868 4 L 820 4 L 772 4 L 772 42.5Z'
	},
	area_4: {
		href: '',
		title: '',
		space: '4',
		path: 'M 871 70 L 871 136 L 913.5 136 L 956 136 L 956 70 L 956 4 L 913.5 4 L 871 4 L 871 70Z'
	},
	area_17: {
		href: '',
		title: '',
		space: '17',
		path: 'M 4 446.5 L 4 524 L 24.5 524 L 45 524 L 45 446.5 L 45 369 L 24.5 369 L 4 369 L 4 446.5Z'
	},
	area_18: {
		href: '',
		title: '',
		space: '18',
		path: 'M 68 397 L 68 414 L 83 414 L 98 414 L 98 397 L 98 380 L 83 380 L 68 380 L 68 397Z'
	},
	area_22: {
		href: '',
		title: '',
		space: '22',
		path: 'M 876 454.5 L 876 524 L 916 524 L 956 524 L 956 454.5 L 956 385 L 916 385 L 876 385 L 876 454.5Z'
	},
	area_34: {
		href: '',
		title: '',
		space: '34',
		path: 'M 134 486 L 134 524 L 175 524 L 216 524 L 216 486 L 216 448 L 175 448 L 134 448 L 134 486Z'
	},
	*/
}

/* Торговый центр 'Панорама', цоколь (путь '/maps/scheme/5/floor1/') */
var s5_f1 = {
	area_2: {
		href: 'http://sideful.ru',
		title: 'Фэмили',
		space: '2',
		path: 'M 414 247 L 414 353 L 586 353 L 758 353 L 758 265.5 L 758 178 L 627 178 L 496 178 L 496 159.5 L 496 141 L 455 141 L 414 141 L 414 247Z'
	},
	area_3: {
		href: 'http://sideful.ru',
		title: 'Верхняя одежда',
		space: '3',
		path: 'M 161 290.5 L 161 353 L 227 353 L 293 353 L 293 290.5 L 293 228 L 227 228 L 161 228 L 161 290.5Z'
	},
	area_4: {
		href: 'http://sideful.ru',
		title: 'Мужская одежда',
		space: '4',
		path: 'M 296 290.5 L 296 353 L 353.5 353 L 411 353 L 411 290.5 L 411 228 L 353.5 228 L 296 228 L 296 290.5Z'
	},
	area_5: {
		href: 'http://sideful.ru',
		title: 'Детская одежда',
		space: '5',
		path: 'M 68 334 L 68 397 L 91 397 L 114 397 L 114 375 L 114 353 L 136 353 L 158 353 L 158 312 L 158 271 L 113 271 L 68 271 L 68 334Z'
	},
	area_6: {
		href: 'http://sideful.ru',
		title: 'Новэкс',
		space: '6',
		path: 'M 761 315.5 L 761 356 L 618.5 356 L 476 356 L 476 474.5 L 476 593 L 618.5 593 L 761 593 L 761 653 L 761 713 L 846 713 L 931 713 L 931 494 L 931 275 L 846 275 L 761 275 L 761 315.5Z'
	},
	area_7: {
		href: 'http://sideful.ru',
		title: 'Банк',
		space: '7',
		path: 'M 161 471 L 161 536 L 205 536 L 249 536 L 249 471 L 249 406 L 205 406 L 161 406 L 161 471Z'
	},
	area_8: {
		href: 'http://sideful.ru',
		title: 'Нижнее белье',
		space: '8',
		path: 'M 252 471 L 252 536 L 272.5 536 L 293 536 L 293 512.5 L 293 489 L 322.5 489 L 352 489 L 352 500.5 L 352 512 L 363.5 512 L 375 512 L 375 459 L 375 406 L 313.5 406 L 252 406 L 252 471Z'
	},
	area_9: {
		href: 'http://sideful.ru',
		title: 'Головные уборы',
		space: '9',
		path: 'M 378 471 L 378 536 L 400.5 536 L 423 536 L 423 471 L 423 406 L 400.5 406 L 378 406 L 378 471Z'
	},
	area_10: {
		href: 'http://sideful.ru',
		title: 'Оптика',
		space: '10',
		path: 'M 68 462.5 L 68 475 L 91 475 L 114 475 L 114 462.5 L 114 450 L 91 450 L 68 450 L 68 462.5Z'
	},
	area_11: {
		href: 'http://sideful.ru',
		title: 'Золото',
		space: '11',
		path: 'M 161 589.5 L 161 640 L 227 640 L 293 640 L 293 589.5 L 293 539 L 227 539 L 161 539 L 161 589.5Z'
	},
	area_12: {
		href: 'http://sideful.ru',
		title: 'Кожгалантерея',
		space: '12',
		path: 'M 364 589.5 L 364 640 L 393.5 640 L 423 640 L 423 589.5 L 423 539 L 393.5 539 L 364 539 L 364 589.5Z'
	},
	area_13: {
		href: 'http://sideful.ru',
		title: 'Золото',
		space: '13',
		path: 'M 28.9 533.7 C 28.8 542.6 29.2 586.1 29.5 594.7 C 30 606.4 33.5 623.4 35.3 622.4 C 39.5 620.2 54.9 609.3 55 608.6 C 55 607.8 49.1 589.4 34.9 545.5 C 32.8 538.8 31 532.9 31 532.2 C 31 529.6 29 531.2 28.9 533.7Z'
	},
	area_14: {
		href: 'http://sideful.ru',
		title: 'Тип-топ',
		space: '14',
		path: 'M 476 654.5 L 476 713 L 617 713 L 758 713 L 758 654.5 L 758 596 L 617 596 L 476 596 L 476 654.5Z'
	},
	area_15: {
		href: 'http://sideful.ru',
		title: 'Пеппи',
		space: '15',
		path: 'M 45.2 618.6 C 36.8 624 35.2 625.5 36 626.8 C 36.5 627.7 38.3 631.5 39.8 635.1 C 48.7 655.2 63.9 674.5 80.4 686.5 C 82.7 688.1 84.7 689.7 85 690.1 C 85.8 691.2 105.9 703 106.9 703 C 107.8 703 114.2 692.5 119.2 683 C 119.9 681.6 121.9 678.2 123.6 675.5 C 129.7 665.7 130.6 667.6 114.9 655.9 C 89 636.8 75.2 626.5 67.5 621 C 63.3 618 58.9 614.7 57.8 613.7 C 56.6 612.8 55.6 612 55.5 612 C 55.4 612 50.7 615 45.2 618.6Z'
	},
	area_16: {
		href: 'http://sideful.ru',
		title: 'Окна, двери',
		space: '16',
		path: 'M 123.5 680.2 C 119.7 686.9 115 694.9 113.3 698.1 L 110 703.7 L 117.3 706.4 C 126.5 709.7 140.6 712.6 149.3 712.9 L 156 713.1 L 156.1 704.6 C 156.1 699.9 156.2 693.5 156.3 690.5 L 156.3 685 L 144.2 676.5 C 137.5 671.8 131.7 668 131.3 668 C 130.8 668 127.4 673.5 123.5 680.2Z'
	},
	area_17: {
		href: 'http://sideful.ru',
		title: 'Диски',
		space: '17',
		path: 'M 159 700 L 159 713 L 226 713 L 293 713 L 293 700 L 293 687 L 226 687 L 159 687 L 159 700Z'
	},
	area_18: {
		href: 'http://sideful.ru',
		title: 'Сотовые телефоны',
		space: '18',
		path: 'M 296 700 L 296 713 L 335.5 713 L 375 713 L 375 700 L 375 687 L 335.5 687 L 296 687 L 296 700Z'
	},
	area_19: {
		href: 'http://sideful.ru',
		title: '',
		space: '19',
		path: 'M 378 700 L 378 713 L 425.5 713 L 473 713 L 473 700 L 473 687 L 425.5 687 L 378 687 L 378 700Z'
	},
	/*
	area_1: {
		href: '',
		title: '',
		space: '1',
		path: 'M 414 71 L 414 138 L 456.5 138 L 499 138 L 499 156.5 L 499 175 L 630 175 L 761 175 L 761 223.5 L 761 272 L 846 272 L 931 272 L 931 138 L 931 4 L 672.5 4 L 414 4 L 414 71Z'
	},
	*/
}

/* Торговый центр 'Панорама', этаж 1 (путь '/maps/scheme/5/floor2/') */
var s5_f2 = {
	area_1: {
		href: 'http://sideful.ru',
		title: 'Мария-ра',
		space: '1',
		path: 'M 414 212 L 414 420 L 433 420 L 452 420 L 452 542 L 452 664 L 425.5 664 L 399 664 L 399 688.5 L 399 713 L 483 713 L 567 713 L 567 723 L 567 733 L 622.5 733 L 678 733 L 678 723 L 678 713 L 762 713 L 846 713 L 846 723 L 846 733 L 901 733 L 956 733 L 956 678 L 956 623 L 943.5 623 L 931 623 L 931 313.5 L 931 4 L 672.5 4 L 414 4 L 414 212Z'
	},
	area_2: {
		href: 'http://sideful.ru',
		title: 'Аптека',
		space: '2',
		path: 'M 4 281.5 L 4 335 L 16.5 335 L 29 335 L 29 391 L 29 447 L 53 447 L 77 447 L 77 491.5 L 77 536 L 117.5 536 L 158 536 L 158 403.5 L 158 271 L 133 271 L 108 271 L 108 249.5 L 108 228 L 56 228 L 4 228 L 4 281.5Z'
	},
	area_3: {
		href: 'http://sideful.ru',
		title: 'Лэтуаль',
		space: '3',
		path: 'M 111 248 L 111 268 L 136 268 L 161 268 L 161 402 L 161 536 L 204.5 536 L 248 536 L 248 382 L 248 228 L 179.5 228 L 111 228 L 111 248Z'
	},
	area_4: {
		href: 'http://sideful.ru',
		title: 'Обувь',
		space: '4',
		path: 'M 251 305 L 251 382 L 281 382 L 311 382 L 311 401 L 311 420 L 361 420 L 411 420 L 411 324 L 411 228 L 331 228 L 251 228 L 251 305Z'
	},
	area_5: {
		href: 'http://sideful.ru',
		title: 'Сувениры',
		space: '5',
		path: 'M 251 402.5 L 251 420 L 279.5 420 L 308 420 L 308 402.5 L 308 385 L 279.5 385 L 251 385 L 251 402.5Z'
	},
	area_6: {
		href: 'http://sideful.ru',
		title: 'Газеты',
		space: '6',
		path: 'M 293 493.5 L 293 535 L 299.5 535 L 306 535 L 306 493.5 L 306 452 L 299.5 452 L 293 452 L 293 493.5Z'
	},
	area_7: {
		href: 'http://sideful.ru',
		title: 'Цветы',
		space: '7',
		path: 'M 384 493.5 L 384 535 L 401.5 535 L 419 535 L 419 493.5 L 419 452 L 401.5 452 L 384 452 L 384 493.5Z'
	},
	area_8: {
		href: 'http://sideful.ru',
		title: 'Сотовые телефоны',
		space: '8',
		path: 'M 286.5 546.3 C 285.5 548 278 559.6 269.8 571.9 L 255 594.3 L 255 609.7 L 255 625 L 272.6 625 L 290.1 625 L 289.9 585 C 289.7 562.9 289.3 544.5 289 544 C 288.7 543.5 287.6 544.5 286.5 546.3Z'
	},
	area_9: {
		href: 'http://sideful.ru',
		title: 'Мегафон',
		space: '9',
		path: 'M 138 664.8 C 138 665.2 134.6 669.1 130.5 673.5 C 126.4 677.9 123 681.8 123 682.1 C 123 683.4 132.2 686.1 146.5 688.9 C 146.8 689 149.7 689 153 689 L 159 689 L 159 701 L 159 713 L 212.5 713 L 266 713 L 266 688.5 L 266 664 L 202 664 C 166.8 664 138 664.4 138 664.8Z'
	},
	area_10: {
		href: 'http://sideful.ru',
		title: 'Сувениры, цветы',
		space: '10',
		path: 'M 269 688.5 L 269 713 L 277.5 713 L 286 713 L 286 723 L 286 733 L 341 733 L 396 733 L 396 698.5 L 396 664 L 332.5 664 L 269 664 L 269 688.5Z'
	},
}

/* Торговый центр 'Панорама', этаж 2 (путь '/maps/scheme/5/floor3/') */
var s5_f3 = {
	area_1: {
		href: 'http://sideful.ru',
		title: 'Техносила',
		space: '1',
		path: 'M 414 116 L 414 228 L 377 228 L 340 228 L 340 324 L 340 420 L 408 420 L 476 420 L 476 566.5 L 476 713 L 556.5 713 L 637 713 L 637 723 L 637 733 L 657.5 733 L 678 733 L 678 723 L 678 713 L 804.5 713 L 931 713 L 931 358.5 L 931 4 L 672.5 4 L 414 4 L 414 116Z'
	},
	area_2: {
		href: 'http://sideful.ru',
		title: 'Центробувь',
		space: '2',
		path: 'M 4 281.5 L 4 335 L 16.5 335 L 29 335 L 29 464.7 C 29 598.8 29 597.3 32.9 614.5 C 37.9 636.4 50.3 657.9 68.4 676.1 C 88 695.9 120.9 710.9 148.3 712.7 L 156 713.2 L 155.9 655.4 C 155.9 623.5 155.9 583.7 155.9 566.7 L 156 536 L 202 536 L 248 536 L 248 491 L 248 446 L 203 446 L 158 446 L 158 337 L 158 228 L 81 228 L 4 228 L 4 281.5Z'
	},
	area_3: {
		href: 'http://sideful.ru',
		title: 'Обувь',
		space: '3',
		path: 'M 161 285.5 L 161 343 L 206 343 L 251 343 L 251 381.5 L 251 420 L 294 420 L 337 420 L 337 324 L 337 228 L 249 228 L 161 228 L 161 285.5Z'
	},
	area_4: {
		href: 'http://sideful.ru',
		title: 'Джинсы',
		space: '4',
		path: 'M 161 394.5 L 161 443 L 204.5 443 L 248 443 L 248 394.5 L 248 346 L 204.5 346 L 161 346 L 161 394.5Z'
	},
	area_5: {
		href: 'http://sideful.ru',
		title: 'Сувениры',
		space: '5',
		path: 'M 426 439 L 426 455 L 449.5 455 L 473 455 L 473 439 L 473 423 L 449.5 423 L 426 423 L 426 439Z'
	},
	area_6: {
		href: 'http://sideful.ru',
		title: 'Детская одежда',
		space: '6',
		path: 'M 426 500.5 L 426 543 L 449.5 543 L 473 543 L 473 500.5 L 473 458 L 449.5 458 L 426 458 L 426 500.5Z'
	},
	area_7: {
		href: 'http://sideful.ru',
		title: 'Нижнее белье',
		space: '7',
		path: 'M 159 584 L 159 629 L 203.5 629 L 248 629 L 248 584 L 248 539 L 203.5 539 L 159 539 L 159 584Z'
	},
	area_8: {
		href: 'http://sideful.ru',
		title: 'Проф. косметика',
		space: '8',
		path: 'M 426 587.5 L 426 629 L 449.5 629 L 473 629 L 473 587.5 L 473 546 L 449.5 546 L 426 546 L 426 587.5Z'
	},
	area_9: {
		href: 'http://sideful.ru',
		title: 'Молодежная одежда',
		space: '9',
		path: 'M 159 672.5 L 159 713 L 222.5 713 L 286 713 L 286 723 L 286 733 L 311.5 733 L 337 733 L 337 698.5 L 337 664 L 292.5 664 L 248 664 L 248 648 L 248 632 L 203.5 632 L 159 632 L 159 672.5Z'
	},
	area_10: {
		href: 'http://sideful.ru',
		title: 'Верхняя одежда',
		space: '10',
		path: 'M 426 648 L 426 664 L 383 664 L 340 664 L 340 698.5 L 340 733 L 368 733 L 396 733 L 396 723 L 396 713 L 434.5 713 L 473 713 L 473 672.5 L 473 632 L 449.5 632 L 426 632 L 426 648Z'
	},
}

/* Торговый центр 'Панорама', этаж 3 (путь '/maps/scheme/5/floor4/') */
var s5_f4 = {
	area_1: {
		href: 'http://sideful.ru',
		title: 'Ostin',
		space: '1',
		path: 'M 414 114.5 L 414 225 L 459.5 225 L 505 225 L 505 286.5 L 505 348 L 570 348 L 635 348 L 635 259.5 L 635 171 L 655.5 171 L 676 171 L 676 87.5 L 676 4 L 545 4 L 414 4 L 414 114.5Z'
	},
	area_2: {
		href: 'http://sideful.ru',
		title: 'Кинотеатр',
		space: '2',
		path: 'M 679 89 L 679 174 L 658.5 174 L 638 174 L 638 229.5 L 638 285 L 695.5 285 L 753 285 L 753 274 L 753 263 L 842 263 L 931 263 L 931 133.5 L 931 4 L 805 4 L 679 4 L 679 89Z'
	},
	area_3: {
		href: 'http://sideful.ru',
		title: 'Фудкорт',
		space: '3',
		path: 'M 4 281.5 L 4 335 L 16.5 335 L 29 335 L 29.3 467.7 C 29.5 540.8 30 602.5 30.4 605 C 30.7 607.5 31.5 610.6 32 612 C 32.4 613.4 34.1 618.5 35.5 623.4 C 44.9 654.6 71.3 685 101.4 699.5 C 113.6 705.3 116.8 706.5 131 710.1 L 142.5 712.9 L 212.8 713 L 283 713 L 283 470.5 L 283 228 L 143.5 228 L 4 228 L 4 281.5Z'
	},
	area_4: {
		href: 'http://sideful.ru',
		title: 'Твое',
		space: '4',
		path: 'M 286 304 L 286 380 L 380.6 380.2 L 475.2 380.5 L 477.1 378.2 C 478.1 376.9 482.5 371.9 486.8 367.2 C 491.1 362.4 496.3 356.6 498.3 354.4 L 502 350.3 L 502 289.1 L 502 228 L 394 228 L 286 228 L 286 304Z'
	},
	area_6: {
		href: 'http://sideful.ru',
		title: 'Р/у машины',
		space: '6',
		path: 'M 496.6 360.3 C 491.7 365.7 487.9 370.2 488.1 370.4 C 488.9 371.2 493.1 371.2 563.3 371.1 L 635 371 L 635 361 L 635 351 L 570.3 350.8 L 505.5 350.5 L 496.6 360.3Z'
	},
	area_7: {
		href: 'http://sideful.ru',
		title: 'Кино 4D',
		space: '7',
		path: 'M 756 396.5 L 756 442 L 800.5 442 L 845 442 L 845 396.5 L 845 351 L 800.5 351 L 756 351 L 756 396.5Z'
	},
	area_8: {
		href: 'http://sideful.ru',
		title: 'Игровая комната',
		space: '8',
		path: 'M 848 398 L 848 445 L 787 445 L 726 445 L 726 532.5 L 726 620 L 828.5 620 L 931 620 L 931 485.5 L 931 351 L 889.5 351 L 848 351 L 848 398Z'
	},
	area_9: {
		href: 'http://sideful.ru',
		title: 'Игрушки',
		space: '9',
		path: 'M 452 424.5 L 452 443 L 477 443 L 502 443 L 502 424.5 L 502 406 L 477 406 L 452 406 L 452 424.5Z'
	},
	area_10: {
		href: 'http://sideful.ru',
		title: 'Детский аттракцион',
		space: '10',
		path: 'M 505 445 L 505 484 L 567 484 L 629 484 L 629 445 L 629 406 L 567 406 L 505 406 L 505 445Z'
	},
	area_11: {
		href: 'http://sideful.ru',
		title: 'Видеоигры',
		space: '11',
		path: 'M 632 424.5 L 632 443 L 656.5 443 L 681 443 L 681 424.5 L 681 406 L 656.5 406 L 632 406 L 632 424.5Z'
	},
	area_12: {
		href: 'http://sideful.ru',
		title: 'Игровой зал',
		space: '12',
		path: 'M 391 485.5 L 391 528 L 401.5 528 L 412 528 L 412 485.5 L 412 443 L 401.5 443 L 391 443 L 391 485.5Z'
	},
	area_13: {
		href: 'http://sideful.ru',
		title: 'Ломбард',
		space: '13',
		path: 'M 667 479.5 L 667 493 L 689 493 L 711 493 L 711 479.5 L 711 466 L 689 466 L 667 466 L 667 479.5Z'
	},
	area_14: {
		href: 'http://sideful.ru',
		title: 'Мороженое',
		space: '14',
		path: 'M 452 498 L 452 509 L 477 509 L 502 509 L 502 498 L 502 487 L 477 487 L 452 487 L 452 498Z'
	},
	area_15: {
		href: 'http://sideful.ru',
		title: 'Книги',
		space: '15',
		path: 'M 391 556 L 391 581 L 338.5 581 L 286 581 L 286 657 L 286 733 L 341 733 L 396 733 L 396 723 L 396 713 L 449.5 713 L 503 713 L 503 622 L 503 531 L 447 531 L 391 531 L 391 556Z'
	},
	area_17: {
		href: 'http://sideful.ru',
		title: 'Обувь',
		space: '17',
		path: 'M 600 632 L 600 733 L 639 733 L 678 733 L 678 723 L 678 713 L 700.5 713 L 723 713 L 723 622 L 723 531 L 661.5 531 L 600 531 L 600 632Z'
	},
	area_18: {
		href: 'http://sideful.ru',
		title: 'Детский лабиринт',
		space: '18',
		path: 'M 726 668 L 726 713 L 786 713 L 846 713 L 846 723 L 846 733 L 901 733 L 956 733 L 956 678 L 956 623 L 841 623 L 726 623 L 726 668Z'
	},
	/*
	area_5: {
		href: '',
		title: '',
		space: '5',
		path: 'M 756 307 L 756 348 L 843.5 348 L 931 348 L 931 307 L 931 266 L 843.5 266 L 756 266 L 756 307Z'
	},
	area_16: {
		href: '',
		title: '',
		space: '16',
		path: 'M 506 622 L 506 713 L 536.5 713 L 567 713 L 567 723 L 567 733 L 582 733 L 597 733 L 597 632 L 597 531 L 551.5 531 L 506 531 L 506 622Z'
	},
	*/
}

/* Инициализация скрипта */
if ( $('.scheme').length > 0 ) {
	$('.plan div[data-floor]').each(function() {
		var current = $(this);
		var w = $(this).find('img.bg').attr('width');
		var h = $(this).find('img.bg').attr('height');
		current.css({
			'width': w+'px',
			'height': h+'px'
		});
		var r = Raphael(current.find('.touch .svg').attr('id'), w, h),
		attributes = {
			fill: '#ffffff',
			opacity: 0,
			'stroke-width': 0
		},
		arr = new Array();
		
		var r_h = Raphael(current.find('.highlight .svg').attr('id'), w, h),
		attributes_h = {
			fill: '#00A0E3',
			opacity: 0,
			'stroke-width': 0
		},
		arr_h = new Array();
		
		var r_s = Raphael(current.find('.selected .svg').attr('id'), w, h),
		attributes_s = {
			fill: '#a9bc53',
			opacity: 1,
			'stroke-width': 0
		},
		arr_s = new Array();

		var paths = eval('s'+current.attr('data-building')+'_f'+current.attr('data-floor'));
		
		for (var shop in paths) {
		
			var obj = r.path(paths[shop].path);
			obj.attr(attributes);
			arr[obj.id] = shop;
		
			var obj_h = r_h.path(paths[shop].path);
			obj_h.attr(attributes_h);
		
			var obj_s = r_s.path(paths[shop].path);
			obj_s.attr(attributes_s);
			
			obj.click(
				function() {
					if ( paths[arr[this.id]].href ) {
						window.location.href = paths[arr[this.id]].href;
					}
				}
			);
			obj.hover(function() {
				current.find('.highlight svg path[d="'+this.attr('path')+'"]').stop(true,true).animate({
					opacity: '0.25'
				}, 250);
				if ( paths[arr[this.id]].href ) {
					current.find('.touch svg path').css({
						'cursor': 'pointer'
					});
				}
				if ( paths[arr[this.id]].tip ) {
					var point = this.getBBox(0);
					current.append('<p class="bubble">'+paths[arr[this.id]].title+'</p>');
					current.find('.bubble').css({
						'left': point.x+'px',
						'top': point.y-64+'px'
					});
				}
			}, function() {
				current.find('.highlight svg path').stop(true,true).animate({
					opacity: '0'
				}, 250);
				current.find('.touch svg path').css({
					'cursor': 'default'
				});
				current.find('.bubble').remove();
			});

		}
	});
	
	var hightlightColors = {
		t0: '#000000',
		t1: '#f7e900',
		t2: '#f5eb52',
		t3: '#fe7613',
		t4: '#00d698',
		t5: '#0067b3',
		t6: '#00691c',
		t7: '#009f2d',
		t8: '#3b3b3b',
		t9: '#00b9b6',
		t10: '#c2a7e1',
		t11: '#ff5c78',
		t12: '#7de0e3',
		t13: '#6d5e8d',
		t14: '#f1acb9',
		t15: '#f42421',
		t16: '#612d14',
		t17: '#ffbb00',
		t18: '#9d3296',
		t19: '#601b5b'
	}

	$('.scheme .legend ul li span').bind('click', function(event) {
		var type = $(this).attr('class');
		var current = $(this).parents('.scheme').find('.plan').children('div.active');
		var paths = eval('s'+current.attr('data-building')+'_f'+current.attr('data-floor'));
		current.find('.selected svg path').attr('fill', '#a9bc53');
		for (var key in paths) {
			var val = paths[key];
			if ( val['type'] == type ) {
				var path = val['path'].replace(/(\d)\s+(?=\d)/g, '$1,').replace(/\s/g, '');
				for (var key in hightlightColors) {
					current.find('.selected svg path[d="'+path+'"]').attr('fill', hightlightColors[type]);
				}
				
			}
		}
		event.preventDefault();
	});
	
	$('.scheme .plan ul.nav li a').bind('click', function(event) {
		$(this).parents('.plan').children('div[data-floor="'+$(this).attr('href')+'"]').show().addClass('active').siblings('div[data-floor]').removeClass('active').hide();
		$(this).parent().addClass('active').siblings().removeClass();
		event.preventDefault();
	});

	function selectDefault(e) {
		var hash = e;
		var current = $('.scheme .plan').children('div.active');
		var paths = eval('s'+current.attr('data-building')+'_f'+current.attr('data-floor'));
		var val = paths[e];
		var path = val['path'].replace(/(\d)\s+(?=\d)/g, '$1,').replace(/\s/g, '');
		var type = val['type'];
		if ( type ) {
			current.find('.selected svg path[d="'+path+'"]').attr('fill', hightlightColors[type]);
		}
		else {
			current.find('.selected svg path[d="'+path+'"]').attr('fill', '#000000');
		}
	}
	if ( $('.scheme .plan > div').size() > 1 ) {
		$('.scheme .plan ul.nav li:nth-child(1) a').trigger('click');
	}
	else {
		$('.scheme .plan > div').addClass('active');
	}
	if ( window.location.hash.length > 0 ) {
		selectDefault(window.location.hash.substr(1));
	}
}