/* Торговый центр 'Радуга' Кемерово, этаж 1 (путь '/maps/scheme/1/floor1/') */
var s1_f1 = {
	area_1: {
		href: 'http://sideful.ru',
		title: 'Адидас',
		space: '1',
		path: 'M 4 106 L 4 208 L 19 208 L 34 208 L 34 211 L 34 214 L 105 214 L 176 214 L 176 116 L 176 18 L 253.5 18 L 331 18 L 331 11 L 331 4 L 167.5 4 L 4 4 L 4 106Z'
	},
	area_2: {
		href: 'http://sideful.ru',
		title: 'Одежда',
		space: '2',
		path: 'M 179 160 L 179 299 L 234.5 299 L 290 299 L 290 254.5 L 290 210 L 310.5 210 L 331 210 L 331 176.5 L 331 143 L 317 143 L 303 143 L 303 109 L 303 75 L 317 75 L 331 75 L 331 48 L 331 21 L 255 21 L 179 21 L 179 160Z'
	},
	area_9: {
		href: 'http://sideful.ru',
		title: 'Ветра нет',
		space: '9',
		path: 'M 4 369 L 4 390 L 58 390 L 112 390 L 112 369 L 112 348 L 58 348 L 4 348 L 4 369Z'
	},
	area_10: {
		href: 'http://sideful.ru',
		title: 'Стайер',
		space: '10',
		path: 'M 293 293.5 L 293 302 L 236 302 L 179 302 L 179 323.5 L 179 345 L 227.5 345 L 276 345 L 276 367.5 L 276 390 L 303.5 390 L 331 390 L 331 337.5 L 331 285 L 312 285 L 293 285 L 293 293.5Z'
	},
	area_11: {
		href: 'http://sideful.ru',
		title: 'Золла',
		space: '11',
		path: 'M 4 458 L 4 523 L 58 523 L 112 523 L 112 458 L 112 393 L 58 393 L 4 393 L 4 458Z'
	},
	area_12: {
		href: 'http://sideful.ru',
		title: 'Кари',
		space: '12',
		path: 'M 179 391.5 L 179 435 L 255 435 L 331 435 L 331 414 L 331 393 L 302 393 L 273 393 L 273 370.5 L 273 348 L 226 348 L 179 348 L 179 391.5Z'
	},
	area_13: {
		href: 'http://sideful.ru',
		title: 'Календарь подарков',
		space: '13',
		path: 'M 179 459.5 L 179 481 L 199.5 481 L 220 481 L 220 459.5 L 220 438 L 199.5 438 L 179 438 L 179 459.5Z'
	},
	area_14: {
		href: 'http://sideful.ru',
		title: 'Пеликан',
		space: '14',
		path: 'M 223 459.5 L 223 481 L 249.5 481 L 276 481 L 276 459.5 L 276 438 L 249.5 438 L 223 438 L 223 459.5Z'
	},
	area_16: {
		href: 'http://sideful.ru',
		title: 'DONATO',
		space: '16',
		path: 'M 34 547.5 L 34 569 L 73 569 L 112 569 L 112 547.5 L 112 526 L 73 526 L 34 526 L 34 547.5Z'
	},
	area_17: {
		href: 'http://sideful.ru',
		title: 'Верхняя одежда',
		space: '17',
		path: 'M 4 593 L 4 614 L 58 614 L 112 614 L 112 593 L 112 572 L 58 572 L 4 572 L 4 593Z'
	},
	area_18: {
		href: 'http://sideful.ru',
		title: 'МТС',
		space: '18',
		path: 'M 180 546.5 L 180 569 L 200 569 L 220 569 L 220 546.5 L 220 524 L 200 524 L 180 524 L 180 546.5Z'
	},
	
	area_20: {
		href: 'http://sideful.ru',
		title: 'Гранд Сити',
		space: '20',
		path: 'M 223 568 L 223 612 L 248 612 L 273 612 L 273 568 L 273 524 L 248 524 L 223 524 L 223 568Z'
	},
	area_21: {
		href: 'http://sideful.ru',
		title: 'Еврошуз',
		space: '21',
		path: 'M 276 568 L 276 612 L 289 612 L 302 612 L 302 591.5 L 302 571 L 315.5 571 L 329 571 L 329 547.5 L 329 524 L 302.5 524 L 276 524 L 276 568Z'
	},
	area_23: {
		href: 'http://sideful.ru',
		title: 'Макдональдс',
		space: '23',
		path: 'M 332 568 L 332 612 L 339 612 L 346 612 L 346 626.5 L 346 641 L 397.5 641 L 449 641 L 449 626.5 L 449 612 L 456 612 L 463 612 L 463 568 L 463 524 L 397.5 524 L 332 524 L 332 568Z'
	},
	area_24: {
		href: 'http://sideful.ru',
		title: 'Русская охота',
		space: '24',
		path: 'M 466 568 L 466 612 L 486.5 612 L 507 612 L 507 568 L 507 524 L 486.5 524 L 466 524 L 466 568Z'
	},
	area_25: {
		href: 'http://sideful.ru',
		title: 'Мега текс',
		space: '25',
		path: 'M 510 568 L 510 612 L 531 612 L 552 612 L 552 568 L 552 524 L 531 524 L 510 524 L 510 568Z'
	},
	area_26: {
		href: 'http://sideful.ru',
		title: 'Лэтуаль',
		space: '26',
		path: 'M 555 568 L 555 612 L 598.5 612 L 642 612 L 642 573.5 L 642 535 L 620.5 535 L 599 535 L 599 529.5 L 599 524 L 577 524 L 555 524 L 555 568Z'
	},
	area_27: {
		href: 'http://sideful.ru',
		title: 'Цветы',
		space: '27',
		path: 'M 645 553.5 L 645 572 L 667 572 L 689 572 L 689 553.5 L 689 535 L 667 535 L 645 535 L 645 553.5Z'
	},
	area_28: {
		href: 'http://sideful.ru',
		title: 'Пресса',
		space: '28',
		path: 'M 736 534 L 736 546 L 756 546 L 776 546 L 776 534 L 776 522 L 756 522 L 736 522 L 736 534Z'
	},
	area_29: {
		href: 'http://sideful.ru',
		title: 'Аптека',
		space: '29',
		path: 'M 736 567.5 L 736 586 L 757.5 586 L 779 586 L 779 599 L 779 612 L 800.5 612 L 822 612 L 822 580.5 L 822 549 L 779 549 L 736 549 L 736 567.5Z'
	},
	area_30: {
		href: 'http://sideful.ru',
		title: 'Фотомир',
		space: '30',
		path: 'M 779 534 L 779 546 L 800.5 546 L 822 546 L 822 534 L 822 522 L 800.5 522 L 779 522 L 779 534Z'
	},
	area_31: {
		href: 'http://sideful.ru',
		title: 'Топ книга',
		space: '31',
		path: 'M 825 567 L 825 612 L 845.5 612 L 866 612 L 866 567 L 866 522 L 845.5 522 L 825 522 L 825 567Z'
	},
	area_32: {
		href: 'http://sideful.ru',
		title: 'Шторы',
		space: '32',
		path: 'M 869 567 L 869 612 L 890 612 L 911 612 L 911 567 L 911 522 L 890 522 L 869 522 L 869 567Z'
	},
	area_33: {
		href: 'http://sideful.ru',
		title: 'Верхняя одежда',
		space: '33',
		path: 'M 914 549.5 L 914 612 L 935 612 L 956 612 L 956 549.5 L 956 487 L 935 487 L 914 487 L 914 549.5Z'
	},
	area_34: {
		href: 'http://sideful.ru',
		title: 'Новэкс',
		space: '34',
		path: 'M 873 332.5 L 873 336 L 858 336 L 843 336 L 843 368 L 843 400 L 856 400 L 869 400 L 869 442 L 869 484 L 912.5 484 L 956 484 L 956 406.5 L 956 329 L 914.5 329 L 873 329 L 873 332.5Z'
	},
	area_35: {
		href: 'http://sideful.ru',
		title: 'Эстет',
		space: '35',
		path: 'M 823 443.5 L 823 484 L 844.5 484 L 866 484 L 866 443.5 L 866 403 L 844.5 403 L 823 403 L 823 443.5Z'
	},
	area_36: {
		href: 'http://sideful.ru',
		title: 'Мария-ра',
		space: '36',
		path: 'M 701 240.5 L 701 247 L 696.5 247 L 692 247 L 692 360 L 692 473 L 756 473 L 820 473 L 820 436.5 L 820 400 L 830 400 L 840 400 L 840 342.5 L 840 285 L 831 285 L 822 285 L 822 264 L 822 243 L 767 243 L 712 243 L 712 238.5 L 712 234 L 706.5 234 L 701 234 L 701 240.5Z'
	},
	area_39: {
		href: 'http://sideful.ru',
		title: 'Глория Джинс',
		space: '39',
		path: 'M 492 295 L 492 305 L 479 305 L 466 305 L 466 316 L 466 327 L 510.5 327 L 555 327 L 555 404 L 555 481 L 575.5 481 L 596 481 L 596 477 L 596 473 L 618.5 473 L 641 473 L 641 435 L 641 397 L 665 397 L 689 397 L 689 341 L 689 285 L 590.5 285 L 492 285 L 492 295Z'
	},
	area_40: {
		href: 'http://sideful.ru',
		title: 'ДНС',
		space: '40',
		path: 'M 510 405.5 L 510 481 L 531 481 L 552 481 L 552 405.5 L 552 330 L 531 330 L 510 330 L 510 405.5Z'
	},
	area_41: {
		href: 'http://sideful.ru',
		title: 'Трэйс',
		space: '41',
		path: 'M 466 405.5 L 466 481 L 486.5 481 L 507 481 L 507 405.5 L 507 330 L 486.5 330 L 466 330 L 466 405.5Z'
	},
	area_45: {
		href: 'http://sideful.ru',
		title: 'MAG',
		space: '45',
		path: 'M 279 459.5 L 279 481 L 305 481 L 331 481 L 331 459.5 L 331 438 L 305 438 L 279 438 L 279 459.5Z'
	},
	/*
	area_3: {
		href: '',
		title: '',
		space: '3',
		path: 'M 306 109 L 306 140 L 318.5 140 L 331 140 L 331 109 L 331 78 L 318.5 78 L 306 78 L 306 109Z'
	},
	area_4: {
		href: '',
		title: '',
		space: '4',
		path: 'M 4 256 L 4 301 L 14 301 L 24 301 L 24 289 L 24 277 L 34.5 277 L 45 277 L 45 266.5 L 45 256 L 65 256 L 85 256 L 85 243.5 L 85 231 L 58 231 L 31 231 L 31 221 L 31 211 L 17.5 211 L 4 211 L 4 256Z'
	},
	area_5: {
		href: '',
		title: '',
		space: '5',
		path: 'M 293 247.5 L 293 282 L 312 282 L 331 282 L 331 247.5 L 331 213 L 312 213 L 293 213 L 293 247.5Z'
	},
	area_6: {
		href: '',
		title: '',
		space: '6',
		path: 'M 88 243.5 L 88 256 L 100 256 L 112 256 L 112 243.5 L 112 231 L 100 231 L 88 231 L 88 243.5Z'
	},
	area_7: {
		href: '',
		title: '',
		space: '7',
		path: 'M 48 269.5 L 48 280 L 37.5 280 L 27 280 L 27 290.5 L 27 301 L 69.5 301 L 112 301 L 112 280 L 112 259 L 80 259 L 48 259 L 48 269.5Z'
	},
	area_8: {
		href: '',
		title: '',
		space: '8',
		path: 'M 4 324.5 L 4 345 L 58 345 L 112 345 L 112 324.5 L 112 304 L 58 304 L 4 304 L 4 324.5Z'
	},
	area_15: {
		href: '',
		title: '',
		space: '15',
		path: 'M 4 547.5 L 4 569 L 17.5 569 L 31 569 L 31 547.5 L 31 526 L 17.5 526 L 4 526 L 4 547.5Z'
	},
	area_19: {
		href: '',
		title: '',
		space: '19',
		path: 'M 180 592 L 180 612 L 200 612 L 220 612 L 220 592 L 220 572 L 200 572 L 180 572 L 180 592Z'
	},
	area_22: {
		href: '',
		title: '',
		space: '22',
		path: 'M 305 593 L 305 612 L 317 612 L 329 612 L 329 593 L 329 574 L 317 574 L 305 574 L 305 593Z'
	},
	area_37: {
		href: '',
		title: '',
		space: '37',
		path: 'M 668 436.5 L 668 473 L 678.5 473 L 689 473 L 689 436.5 L 689 400 L 678.5 400 L 668 400 L 668 436.5Z'
	},
	area_38: {
		href: '',
		title: '',
		space: '38',
		path: 'M 644 436.5 L 644 473 L 654.5 473 L 665 473 L 665 436.5 L 665 400 L 654.5 400 L 644 400 L 644 436.5Z'
	},
	area_42: {
		href: '',
		title: '',
		space: '42',
		path: 'M 440 459.5 L 440 481 L 451.5 481 L 463 481 L 463 459.5 L 463 438 L 451.5 438 L 440 438 L 440 459.5Z'
	},
	area_43: {
		href: '',
		title: '',
		space: '43',
		path: 'M 334 414 L 334 435 L 351.5 435 L 369 435 L 369 458 L 369 481 L 403 481 L 437 481 L 437 458 L 437 435 L 450 435 L 463 435 L 463 414 L 463 393 L 398.5 393 L 334 393 L 334 414Z'
	},
	area_44: {
		href: '',
		title: '',
		space: '44',
		path: 'M 334 459.5 L 334 481 L 350 481 L 366 481 L 366 459.5 L 366 438 L 350 438 L 334 438 L 334 459.5Z'
	},
	*/
}

/* Торговый центр 'Радуга' Кемерово, этаж 2 (путь '/maps/scheme/1/floor2/') */
var s1_f2 = {
	area_1: {
		href: 'http://sideful.ru',
		title: 'Детский мир',
		space: '1',
		path: 'M 4 87 L 4 170 L 90 170 L 176 170 L 176 146.5 L 176 123 L 238 123 L 300 123 L 300 101 L 300 79 L 315.5 79 L 331 79 L 331 41.5 L 331 4 L 167.5 4 L 4 4 L 4 87Z'
	},
	area_5: {
		href: 'http://sideful.ru',
		title: 'Детская одежда',
		space: '5',
		path: 'M 4 193.5 L 4 214 L 58 214 L 112 214 L 112 193.5 L 112 173 L 58 173 L 4 173 L 4 193.5Z'
	},
	area_7: {
		href: 'http://sideful.ru',
		title: 'Текстиль',
		space: '7',
		path: 'M 32 244 L 32 259 L 72 259 L 112 259 L 112 244 L 112 229 L 72 229 L 32 229 L 32 244Z'
	},
	area_8: {
		href: 'http://sideful.ru',
		title: 'Детская одежда',
		space: '8',
		path: 'M 32 283 L 32 304 L 72 304 L 112 304 L 112 283 L 112 262 L 72 262 L 32 262 L 32 283Z'
	},
	area_9: {
		href: 'http://sideful.ru',
		title: '4 sezona',
		space: '9',
		path: 'M 4 328 L 4 349 L 58 349 L 112 349 L 112 328 L 112 307 L 58 307 L 4 307 L 4 328Z'
	},
	area_10: {
		href: 'http://sideful.ru',
		title: 'Подиум',
		space: '10',
		path: 'M 4 373 L 4 394 L 46.5 394 C 88.8 394 89 394 90.8 391.9 C 91.7 390.7 96.9 385.3 102.3 379.9 L 112 370.1 L 112 361 L 112 352 L 58 352 L 4 352 L 4 373Z'
	},
	area_11: {
		href: 'http://sideful.ru',
		title: 'Апельсин',
		space: '11',
		path: 'M 4 418 L 4 439 L 45.5 439 L 87 439 L 87 418 L 87 397 L 45.5 397 L 4 397 L 4 418Z'
	},
	area_14: {
		href: 'http://sideful.ru',
		title: 'Не могу прочитать название',
		space: '14',
		path: 'M 59 508 L 59 529 L 73 529 L 87 529 L 87 508 L 87 487 L 73 487 L 59 487 L 59 508Z'
	},
	area_16: {
		href: 'http://sideful.ru',
		title: 'Subway',
		space: '16',
		path: 'M 39 567 L 39 585 L 26.5 585 L 14 585 L 14 599.5 L 14 614 L 37.5 614 L 61 614 L 61 581.5 L 61 549 L 50 549 L 39 549 L 39 567Z'
	},
	area_17: {
		href: 'http://sideful.ru',
		title: 'Общепит',
		space: '17',
		path: 'M 64 561.5 L 64 574 L 141.5 574 L 219 574 L 219 561.5 L 219 549 L 141.5 549 L 64 549 L 64 561.5Z'
	},
	area_18: {
		href: 'http://sideful.ru',
		title: 'Суши',
		space: '18',
		path: 'M 64 595.5 L 64 614 L 83 614 L 102 614 L 102 595.5 L 102 577 L 83 577 L 64 577 L 64 595.5Z'
	},
	area_19: {
		href: 'http://sideful.ru',
		title: 'Блины',
		space: '19',
		path: 'M 105 595.5 L 105 614 L 121 614 L 137 614 L 137 595.5 L 137 577 L 121 577 L 105 577 L 105 595.5Z'
	},
	area_20: {
		href: 'http://sideful.ru',
		title: 'Пицца',
		space: '20',
		path: 'M 140 595.5 L 140 614 L 161.5 614 L 183 614 L 183 595.5 L 183 577 L 161.5 577 L 140 577 L 140 595.5Z'
	},
	area_21: {
		href: 'http://sideful.ru',
		title: 'Баскин робинс',
		space: '21',
		path: 'M 186 595.5 L 186 614 L 202.5 614 L 219 614 L 219 595.5 L 219 577 L 202.5 577 L 186 577 L 186 595.5Z'
	},
	area_22: {
		href: 'http://sideful.ru',
		title: 'Кинотеатр',
		space: '22',
		path: 'M 222 581.5 L 222 614 L 262 614 L 302 614 L 302 595.5 L 302 577 L 293 577 L 284 577 L 284 563 L 284 549 L 253 549 L 222 549 L 222 581.5Z'
	},
	area_23: {
		href: 'http://sideful.ru',
		title: '',
		space: '23',
		path: 'M 287 561.5 L 287 574 L 300 574 L 313 574 L 313 561.5 L 313 549 L 300 549 L 287 549 L 287 561.5Z'
	},
	area_27: {
		href: 'http://sideful.ru',
		title: 'Taskaevo',
		space: '27',
		path: 'M 466 581.5 L 466 614 L 485.5 614 L 505 614 L 505 581.5 L 505 549 L 485.5 549 L 466 549 L 466 581.5Z'
	},
	area_28: {
		href: 'http://sideful.ru',
		title: 'Стиль мен',
		space: '28',
		path: 'M 508 581.5 L 508 614 L 530 614 L 552 614 L 552 581.5 L 552 549 L 530 549 L 508 549 L 508 581.5Z'
	},
	area_29: {
		href: 'http://sideful.ru',
		title: 'Индиго',
		space: '29',
		path: 'M 555 588 L 555 614 L 575.5 614 L 596 614 L 596 588 L 596 562 L 575.5 562 L 555 562 L 555 588Z'
	},
	area_30: {
		href: 'http://sideful.ru',
		title: 'Женская одежда',
		space: '30',
		path: 'M 599 588 L 599 614 L 620.5 614 L 642 614 L 642 593 L 642 572 L 650.5 572 L 659 572 L 659 567 L 659 562 L 629 562 L 599 562 L 599 588Z'
	},
	area_31: {
		href: 'http://sideful.ru',
		title: 'Опять не могу прочитать',
		space: '31',
		path: 'M 678 565 L 678 568 L 685 568 C 691.3 568 692 568.2 692 570 C 692 571.9 692.7 572 701.5 572 L 711 572 L 711 567 L 711 562 L 694.5 562 L 678 562 L 678 565Z'
	},
	area_33: {
		href: 'http://sideful.ru',
		title: 'Товары для детей',
		space: '33',
		path: 'M 701 245 C 701 246.7 700.3 247 696.5 247 L 692 247 L 692 349 L 692 451 L 712.5 451 L 733 451 L 733 347 L 733 243 L 717 243 C 701.7 243 701 243.1 701 245Z'
	},
	area_34: {
		href: 'http://sideful.ru',
		title: 'Остин',
		space: '34',
		path: 'M 565 259.5 L 565 272 L 569 272 L 573 272 L 573 277 L 573 282 L 597.5 282 L 622 282 L 622 341 L 622 400 L 633 400 L 644 400 L 644 425.5 L 644 451 L 666.5 451 L 689 451 L 689 349 L 689 247 L 627 247 L 565 247 L 565 259.5Z'
	},
	area_35: {
		href: 'http://sideful.ru',
		title: 'Аляска',
		space: '35',
		path: 'M 554 368 L 554 451 L 575 451 L 596 451 L 596 425.5 L 596 400 L 607.5 400 L 619 400 L 619 342.5 L 619 285 L 586.5 285 L 554 285 L 554 368Z'
	},
	area_36: {
		href: 'http://sideful.ru',
		title: 'Яшма',
		space: '36',
		path: 'M 599 427 L 599 451 L 620 451 L 641 451 L 641 427 L 641 403 L 620 403 L 599 403 L 599 427Z'
	},
	area_37: {
		href: 'http://sideful.ru',
		title: 'Центробувь',
		space: '37',
		path: 'M 492 295 L 492 305 L 479 305 L 466 305 L 466 352.5 L 466 400 L 488.5 400 L 511 400 L 511 425.5 L 511 451 L 531 451 L 551 451 L 551 368 L 551 285 L 521.5 285 L 492 285 L 492 295Z'
	},
	area_38: {
		href: 'http://sideful.ru',
		title: 'Гулливер',
		space: '38',
		path: 'M 466 426.5 L 466 450 L 487 450 L 508 450 L 508 426.5 L 508 403 L 487 403 L 466 403 L 466 426.5Z'
	},
	area_42: {
		href: 'http://sideful.ru',
		title: 'Десео',
		space: '42',
		path: 'M 179 237 L 179 260 L 246.5 260 L 314 260 L 314 237 L 314 214 L 246.5 214 L 179 214 L 179 237Z'
	},
	area_43: {
		href: 'http://sideful.ru',
		title: 'Инсити',
		space: '43',
		path: 'M 179 316.6 L 179 370.2 L 190.9 382.1 L 202.8 394 L 266.9 394 L 331 394 L 331 328.5 L 331 263 L 255 263 L 179 263 L 179 316.6Z'
	},
	area_47: {
		href: 'http://sideful.ru',
		title: 'Детская площадка',
		space: '47',
		path: 'M 206.3 478.5 L 201 483.8 L 201 492.5 L 201 501.2 L 206.5 506.6 L 212 512 L 263.5 512 L 315 512 L 320.5 506.6 L 326 501.3 L 326 492.6 L 326 484 L 320.6 478.5 L 315.3 473 L 263.4 473 L 211.5 473.1 L 206.3 478.5Z'
	},
	/*
	area_2: {
		href: '',
		title: '',
		space: '2',
		path: 'M 303 102.5 L 303 123 L 317 123 L 331 123 L 331 102.5 L 331 82 L 317 82 L 303 82 L 303 102.5Z'
	},
	area_3: {
		href: '',
		title: '',
		space: '3',
		path: 'M 179 168.5 L 179 211 L 246.5 211 L 314 211 L 314 198 L 314 185 L 301.5 185 L 289 185 L 289 155.5 L 289 126 L 234 126 L 179 126 L 179 168.5Z'
	},
	area_4: {
		href: '',
		title: '',
		space: '4',
		path: 'M 292 154 L 292 182 L 304.5 182 L 317 182 L 317 221 L 317 260 L 390 260 L 463 260 L 463 253.5 L 463 247 L 397 247 L 331 247 L 331 186.5 L 331 126 L 311.5 126 L 292 126 L 292 154Z'
	},
	area_6: {
		href: '',
		title: '',
		space: '6',
		path: 'M 4 260.5 L 4 304 L 16.5 304 L 29 304 L 29 265 L 29 226 L 70.5 226 L 112 226 L 112 221.5 L 112 217 L 58 217 L 4 217 L 4 260.5Z'
	},
	area_12: {
		href: '',
		title: '',
		space: '12',
		path: 'M 4 471 L 4 500 L 30 500 L 56 500 L 56 492 L 56 484 L 71.5 484 L 87 484 L 87 463 L 87 442 L 45.5 442 L 4 442 L 4 471Z'
	},
	area_13: {
		href: '',
		title: '',
		space: '13',
		path: 'M 4 516 L 4 529 L 30 529 L 56 529 L 56 516 L 56 503 L 30 503 L 4 503 L 4 516Z'
	},
	area_15: {
		href: '',
		title: '',
		space: '15',
		path: 'M 4 581.5 L 4 614 L 7.5 614 L 11 614 L 11 598 L 11 582 L 23.5 582 L 36 582 L 36 565.5 L 36 549 L 20 549 L 4 549 L 4 581.5Z'
	},
	area_24: {
		href: '',
		title: '',
		space: '24',
		path: 'M 334 577.5 L 334 606 L 349.5 606 L 365 606 L 365 577.5 L 365 549 L 349.5 549 L 334 549 L 334 577.5Z'
	},
	area_25: {
		href: '',
		title: '',
		space: '25',
		path: 'M 368 577.5 L 368 606 L 392 606 L 416 606 L 416 577.5 L 416 549 L 392 549 L 368 549 L 368 577.5Z'
	},
	area_26: {
		href: '',
		title: '',
		space: '26',
		path: 'M 419 577.5 L 419 606 L 441 606 L 463 606 L 463 577.5 L 463 549 L 441 549 L 419 549 L 419 577.5Z'
	},
	area_32: {
		href: '',
		title: '',
		space: '32',
		path: 'M 736 348.5 L 736 454 L 725 454 L 714 454 L 714 520 L 714 586 L 746.5 586 L 779 586 L 779 600 L 779 614 L 867.5 614 L 956 614 L 956 471 L 956 328 L 913 328 L 870 328 L 870 287.5 L 870 247 L 864 247 C 858.7 247 858 246.8 858 245 C 858 243 857.3 243 797 243 L 736 243 L 736 348.5Z'
	},
	area_39: {
		href: '',
		title: '',
		space: '39',
		path: 'M 466 274.5 L 466 302 L 477.5 302 L 489 302 L 489 292 L 489 282 L 529.5 282 L 570 282 L 570 278.5 C 570 275.1 569.9 275 566 275 L 562 275 L 562 261 L 562 247 L 514 247 L 466 247 L 466 274.5Z'
	},
	area_40: {
		href: '',
		title: '',
		space: '40',
		path: 'M 398 357 L 398 451 L 430.5 451 L 463 451 L 463 357 L 463 263 L 430.5 263 L 398 263 L 398 357Z'
	},
	area_41: {
		href: '',
		title: '',
		space: '41',
		path: 'M 334 357 L 334 451 L 364.5 451 L 395 451 L 395 357 L 395 263 L 364.5 263 L 334 263 L 334 357Z'
	},
	area_44: {
		href: '',
		title: '',
		space: '44',
		path: 'M 205 418.6 L 205 440.2 L 210.5 445.6 L 215.9 451 L 228.5 451 L 241 451 L 241 424 L 241 397 L 223 397 L 205 397 L 205 418.6Z'
	},
	area_45: {
		href: '',
		title: '',
		space: '45',
		path: 'M 244 424 L 244 451 L 263.5 451 L 283 451 L 283 424 L 283 397 L 263.5 397 L 244 397 L 244 424Z'
	},
	area_46: {
		href: '',
		title: '',
		space: '46',
		path: 'M 286 424 L 286 451 L 308.5 451 L 331 451 L 331 424 L 331 397 L 308.5 397 L 286 397 L 286 424Z'
	},
	*/
}

/* Торговый центр 'Радуга' Рубцовск, этаж 1 (путь '/maps/scheme/2/floor1/') */
var s2_f1 = {
	area_1: {
		href: 'http://sideful.ru',
		title: 'Спортмастер',
		space: '1',
		path: 'M 30 135.5 L 30 245 L 57 245 L 84 245 L 84 219.5 L 84 194 L 93.5 194 L 103 194 L 103 166.5 L 103 139 L 133 139 L 163 139 L 163 82.5 L 163 26 L 96.5 26 L 30 26 L 30 135.5Z'
	},
	area_2: {
		href: 'http://sideful.ru',
		title: 'Детский мир',
		space: '2',
		path: 'M 166 82.5 L 166 139 L 203.3 139 C 235.8 139 241.1 138.8 245 137.3 C 248.6 135.9 254 135.5 273.3 135.2 L 297 134.8 L 297 123.4 L 297 112 L 309 112 L 321 112 L 321 99 L 321 86 L 333.5 86 L 346 86 L 346 56 L 346 26 L 256 26 L 166 26 L 166 82.5Z'
	},
	area_4: {
		href: 'http://sideful.ru',
		title: 'Рапунзель',
		space: '4',
		path: 'M 87 221 L 87 245 L 95 245 L 103 245 L 103 221 L 103 197 L 95 197 L 87 197 L 87 221Z'
	},
	area_5: {
		href: 'http://sideful.ru',
		title: 'Аляска',
		space: '5',
		path: 'M 106 192.5 C 106 234.1 106.2 243 107.3 243 C 111.2 243 132.4 233.5 134 231.1 C 134.3 230.6 136 229.5 137.8 228.6 C 139.5 227.7 141 226.6 141 226.1 C 141 225.6 141.9 225 143 224.7 C 145 224.2 145 223.3 145 183.1 L 145 142 L 125.5 142 L 106 142 L 106 192.5Z'
	},
	area_6: {
		href: 'http://sideful.ru',
		title: 'Лимон',
		space: '6',
		path: 'M 148 179.5 C 148 211.4 148.2 217 149.4 217 C 150.2 217 153.4 214.5 156.5 211.5 C 159.7 208.5 162.5 206 162.8 206 C 163.1 206 165.7 203.6 168.6 200.7 C 171.6 197.9 176 193.7 178.5 191.5 L 182.9 187.5 L 183 164.7 L 183 142 L 165.5 142 L 148 142 L 148 179.5Z'
	},
	area_7: {
		href: 'http://sideful.ru',
		title: 'Полиграф',
		space: '7',
		path: 'M 186 162 C 186 174.7 186.4 182 187 182 C 187.6 182 189.8 180.3 192 178.2 C 194.1 176.2 199.4 171.3 203.6 167.5 C 207.8 163.6 213.1 158.7 215.4 156.4 C 217.8 154.2 220.4 152.1 221.3 151.7 C 222.2 151.4 223 150.6 223 150 C 223 149.5 223.7 149 224.5 149 C 225.4 149 226.3 148.3 226.6 147.5 C 227 146.7 227.8 146 228.5 146 C 229.6 146 231 144 231 142.4 C 231 142.2 220.9 142 208.5 142 L 186 142 L 186 162Z'
	},
	area_8: {
		href: 'http://sideful.ru',
		title: 'Кроха',
		space: '8',
		path: 'M 300 125 L 300 135 L 310.5 135 L 321 135 L 321 125 L 321 115 L 310.5 115 L 300 115 L 300 125Z'
	},
	area_9: {
		href: 'http://sideful.ru',
		title: 'Кокетка',
		space: '9',
		path: 'M 349 112 L 349 135 L 357 135 L 365 135 L 365 112 L 365 89 L 357 89 L 349 89 L 349 112Z'
	},
	area_10: {
		href: 'http://sideful.ru',
		title: 'Модная обувь',
		space: '10',
		path: 'M 368 112 L 368 135 L 376.5 135 L 385 135 L 385 112 L 385 89 L 376.5 89 L 368 89 L 368 112Z'
	},
	area_11: {
		href: 'http://sideful.ru',
		title: 'VIP',
		space: '11',
		path: 'M 388 125.5 L 388 135 L 397 135 L 406 135 L 406 125.5 L 406 116 L 397 116 L 388 116 L 388 125.5Z'
	},
	area_12: {
		href: 'http://sideful.ru',
		title: 'Совсем непонятно',
		space: '12',
		path: 'M 182.1 259.2 C 181.3 260.5 180.2 262.4 179.5 263.5 C 178.9 264.6 177.2 267.4 175.7 269.7 C 172.7 274.5 172.7 274.5 178.5 284.5 C 180.5 287.8 182.3 291.3 182.7 292.2 C 183 293.2 183.9 294 184.6 294 C 185.7 294 186 290.6 186 275.5 C 186 261.3 185.7 257 184.7 257 C 184 257 182.8 258 182.1 259.2Z'
	},
	area_13: {
		href: 'http://sideful.ru',
		title: 'Весело шагаю',
		space: '13',
		path: 'M 200.3 235.9 C 193.2 243.3 191 245.9 191 246.9 C 191 247.5 190.6 248 190 248 C 189.4 248 189 253 189 261 L 189 274 L 197.5 274 L 206 274 L 206 253 C 206 240.3 205.6 232 205 232 C 204.5 232 202.4 233.8 200.3 235.9Z'
	},
	area_14: {
		href: 'http://sideful.ru',
		title: 'Непонятно',
		space: '14',
		path: 'M 189.2 289.9 L 189.6 302.8 L 193.7 307.1 C 196 309.5 199.2 313 200.9 314.7 C 202.6 316.5 204.4 318 205 318 C 205.6 318 206 310.9 206 297.5 L 206 277 L 197.4 277 L 188.8 277 L 189.2 289.9Z'
	},
	area_15: {
		href: 'http://sideful.ru',
		title: 'Зазеркалье',
		space: '15',
		path: 'M 217.1 220.1 C 215.3 221.7 212.7 223.8 211.4 224.7 L 209 226.2 L 209 250.1 L 209 274 L 216 274 L 223 274 L 223 245.5 C 223 223 222.7 217 221.7 217 C 221 217 218.9 218.4 217.1 220.1Z'
	},
	area_16: {
		href: 'http://sideful.ru',
		title: 'Обувь',
		space: '16',
		path: 'M 209.2 300.6 C 209.5 321.5 209.7 324.2 211.2 325.1 C 212.1 325.6 213.6 326.7 214.4 327.5 C 215.2 328.3 216.2 329 216.7 329 C 217.2 329 218.2 329.9 219 331 C 222.7 336.1 223 334.1 223 305 L 223 277 L 215.9 277 L 208.8 277 L 209.2 300.6Z'
	},
	area_17: {
		href: 'http://sideful.ru',
		title: 'Бонита',
		space: '17',
		path: 'M 238 207 C 235 208.7 231 210.8 229.3 211.7 L 226 213.4 L 226 230.7 L 226 248 L 235.5 248 L 245 248 L 245 226 C 245 213.9 244.7 204 244.3 204 C 243.8 204 241 205.4 238 207Z'
	},
	area_18: {
		href: 'http://sideful.ru',
		title: 'Кокетка',
		space: '18',
		path: 'M 226 320 C 226 330.9 226.4 337 227 337 C 228 337 236 341.9 237 343.1 C 237.9 344.2 241.9 346 243.4 346 C 244.8 346 245 343.3 245 324.5 L 245 303 L 235.5 303 L 226 303 L 226 320Z'
	},
	area_19: {
		href: 'http://sideful.ru',
		title: 'Фэмили',
		space: '19',
		path: 'M 276 192.5 C 272.9 193.3 265.9 195.5 260.5 197.5 C 255 199.5 249.9 201.3 249.3 201.5 C 248.3 201.8 248 207.7 248 226.5 L 248 251 L 237 251 L 226 251 L 226 275.5 L 226 300 L 237 300 L 248 300 L 248 323.9 L 248 347.8 L 251.5 349.4 C 258.7 352.8 280.4 359 285.3 359 C 286.9 359 287 354.3 287 275 L 287 191 L 284.3 191.1 C 282.7 191.1 279 191.8 276 192.5Z'
	},
	area_20: {
		href: 'http://sideful.ru',
		title: 'Я расту',
		space: '20',
		path: 'M 290 206 L 290 221 L 298 221 L 306 221 L 306 206 L 306 191 L 298 191 L 290 191 L 290 206Z'
	},
	area_21: {
		href: 'http://sideful.ru',
		title: 'Империя сумок',
		space: '21',
		path: 'M 290 344 L 290 359 L 298 359 L 306 359 L 306 344 L 306 329 L 298 329 L 290 329 L 290 344Z'
	},
	area_22: {
		href: 'http://sideful.ru',
		title: 'Kari',
		space: '22',
		path: 'M 309 207.5 L 309 224 L 299.5 224 L 290 224 L 290 275 L 290 326 L 299.5 326 L 309 326 L 309 342.5 L 309 359 L 317.5 359 L 326 359 L 326 275 L 326 191 L 317.5 191 L 309 191 L 309 207.5Z'
	},
	area_23: {
		href: 'http://sideful.ru',
		title: 'Shope paradise',
		space: '23',
		path: 'M 329 219.5 L 329 248 L 337 248 L 345 248 L 345 219.5 L 345 191 L 337 191 L 329 191 L 329 219.5Z'
	},
	area_25: {
		href: 'http://sideful.ru',
		title: 'Gloria Jeans',
		space: '25',
		path: 'M 348 221 L 348 251 L 338.5 251 L 329 251 L 329 275 L 329 299 L 338.5 299 L 348 299 L 348 329 L 348 359 L 367 359 L 386 359 L 386 275 L 386 191 L 367 191 L 348 191 L 348 221Z'
	},
	area_26: {
		href: 'http://sideful.ru',
		title: 'Zolla',
		space: '26',
		path: 'M 389 275 L 389 359 L 409 359 L 429 359 L 429 275 L 429 191 L 409 191 L 389 191 L 389 275Z'
	},
	area_27: {
		href: 'http://sideful.ru',
		title: 'Телефоника',
		space: '27',
		path: 'M 432 232.5 L 432 274 L 442 274 L 452 274 L 452 232.5 L 452 191 L 442 191 L 432 191 L 432 232.5Z'
	},
	area_28: {
		href: 'http://sideful.ru',
		title: 'Дивиzион',
		space: '28',
		path: 'M 432 318 L 432 359 L 442 359 L 452 359 L 452 318 L 452 277 L 442 277 L 432 277 L 432 318Z'
	},
	area_29: {
		href: 'http://sideful.ru',
		title: 'Непонятно',
		space: '29',
		path: 'M 30 313.5 L 30 322 L 43.5 322 L 57 322 L 57 313.5 L 57 305 L 43.5 305 L 30 305 L 30 313.5Z'
	},
	area_30: {
		href: 'http://sideful.ru',
		title: 'Непонятно',
		space: '30',
		path: 'M 60 313.5 L 60 322 L 72 322 L 84 322 L 84 313.5 L 84 305 L 72 305 L 60 305 L 60 313.5Z'
	},
	area_31: {
		href: 'http://sideful.ru',
		title: 'Формула жизни',
		space: '31',
		path: 'M 87 313.5 L 87 322 L 111.5 322 C 130.9 322 136 321.7 136 320.7 C 136 320 134.5 318.7 132.8 317.8 C 131 317 126.4 314.6 122.5 312.7 C 113.6 308.1 101.8 305 93.5 305 L 87 305 L 87 313.5Z'
	},
	area_32: {
		href: 'http://sideful.ru',
		title: 'Кинотеатр',
		space: '32',
		path: 'M 30 424.5 L 30 524 L 88.5 524 L 147 524 L 147 426.1 C 147 329 147 328.1 145 327.5 C 143.9 327.2 143 326.4 143 325.9 C 143 325.4 120.8 325 86.5 325 L 30 325 L 30 424.5Z'
	},
	area_33: {
		href: 'http://sideful.ru',
		title: 'Лас-пупас',
		space: '33',
		path: 'M 150.7 334.7 C 150.3 335 150 358 150 385.7 L 150 436 L 178 436 L 206 436 L 206 410 C 206 395.6 205.6 384 205.1 384 C 204.6 384 200 379.9 194.9 375 C 189.7 370 179.4 360.1 172 352.9 C 149.7 331.4 152 333.4 150.7 334.7Z'
	},
	area_34: {
		href: 'http://sideful.ru',
		title: 'Bookля',
		space: '34',
		path: 'M 209 413 L 209 436 L 217 436 L 225 436 L 225 418.7 L 225 401.4 L 220.8 397.7 C 218.4 395.6 215.5 393.1 214.3 392 C 213.1 390.9 211.4 390 210.5 390 C 209.2 390 209 393 209 413Z'
	},
	area_36: {
		href: 'http://sideful.ru',
		title: 'DNS',
		space: '36',
		path: 'M 274 469.5 L 274 524 L 290.5 524 L 307 524 L 307 469.5 L 307 415 L 290.5 415 L 274 415 L 274 469.5Z'
	},
	area_38: {
		href: 'http://sideful.ru',
		title: 'Непонятно',
		space: '38',
		path: 'M 366 430.5 L 366 446 L 375 446 L 384 446 L 384 430.5 L 384 415 L 375 415 L 366 415 L 366 430.5Z'
	},
	area_39: {
		href: 'http://sideful.ru',
		title: 'Остин',
		space: '39',
		path: 'M 387 432 L 387 449 L 376.5 449 L 366 449 L 366 486.5 L 366 524 L 415.5 524 L 465 524 L 465 495 L 465 466 L 474.5 466 L 484 466 L 484 456.5 L 484 447 L 464 447 L 444 447 L 444 431 L 444 415 L 415.5 415 L 387 415 L 387 432Z'
	},
	area_40: {
		href: 'http://sideful.ru',
		title: 'Изумруд',
		space: '40',
		path: 'M 447 429.5 L 447 444 L 455.5 444 L 464 444 L 464 429.5 L 464 415 L 455.5 415 L 447 415 L 447 429.5Z'
	},
	area_41: {
		href: 'http://sideful.ru',
		title: 'Золотой дождь',
		space: '41',
		path: 'M 467 429.5 L 467 444 L 475.5 444 L 484 444 L 484 429.5 L 484 415 L 475.5 415 L 467 415 L 467 429.5Z'
	},
	area_42: {
		href: 'http://sideful.ru',
		title: 'Яшма',
		space: '42',
		path: 'M 487 429.5 L 487 444 L 497.5 444 L 508 444 L 508 429.5 L 508 415 L 497.5 415 L 487 415 L 487 429.5Z'
	},
	area_44: {
		href: 'http://sideful.ru',
		title: 'Гараж',
		space: '44',
		path: 'M 468 496.5 L 468 524 L 488 524 L 508 524 L 508 496.5 L 508 469 L 488 469 L 468 469 L 468 496.5Z'
	},
	area_45: {
		href: 'http://sideful.ru',
		title: 'Креатив',
		space: '45',
		path: 'M 485 42.5 L 485 59 L 496.5 59 L 508 59 L 508 42.5 L 508 26 L 496.5 26 L 485 26 L 485 42.5Z'
	},
	area_46: {
		href: 'http://sideful.ru',
		title: 'Планета серебро',
		space: '46',
		path: 'M 485 78 L 485 94 L 496.5 94 L 508 94 L 508 78 L 508 62 L 496.5 62 L 485 62 L 485 78Z'
	},
	area_47: {
		href: 'http://sideful.ru',
		title: '585 золото',
		space: '47',
		path: 'M 485 116 L 485 135 L 496.5 135 L 508 135 L 508 116 L 508 97 L 496.5 97 L 485 97 L 485 116Z'
	},
	area_48: {
		href: 'http://sideful.ru',
		title: 'Incity',
		space: '48',
		path: 'M 511 80.5 L 511 135 L 557.5 135 L 604 135 L 604 80.5 L 604 26 L 557.5 26 L 511 26 L 511 80.5Z'
	},
	area_49: {
		href: 'http://sideful.ru',
		title: 'Fun day',
		space: '49',
		path: 'M 607 80.5 L 607 135 L 635.5 135 L 664 135 L 664 122 L 664 109 L 674 109 L 684 109 L 684 95.5 L 684 82 L 694.5 82 L 705 82 L 705 54 L 705 26 L 656 26 L 607 26 L 607 80.5Z'
	},
	area_50: {
		href: 'http://sideful.ru',
		title: 'Непонятно',
		space: '50',
		path: 'M 667 123.5 L 667 135 L 675.5 135 L 684 135 L 684 123.5 L 684 112 L 675.5 112 L 667 112 L 667 123.5Z'
	},
	area_51: {
		href: 'http://sideful.ru',
		title: 'Баска',
		space: '51',
		path: 'M 687 110 L 687 135 L 696 135 L 705 135 L 705 110 L 705 85 L 696 85 L 687 85 L 687 110Z'
	},
	area_52: {
		href: 'http://sideful.ru',
		title: 'Водолей/Практик/Прораб',
		space: '52',
		path: 'M 708 80.5 L 708 135 L 727.5 135 L 747 135 L 747 80.5 L 747 26 L 727.5 26 L 708 26 L 708 80.5Z'
	},
	area_53: {
		href: 'http://sideful.ru',
		title: 'Новэкс',
		space: '53',
		path: 'M 750 80.5 L 750 135 L 778.5 135 L 807 135 L 807 122.5 L 807 110 L 815 110 L 823 110 L 823 98 L 823 86 L 833 86 L 843 86 L 843 56 L 843 26 L 796.5 26 L 750 26 L 750 80.5Z'
	},
	area_55: {
		href: 'http://sideful.ru',
		title: 'Мария-ра',
		space: '55',
		path: 'M 846 82 L 846 138 L 837.5 138 L 829 138 L 829 206 L 829 274 L 905.5 274 L 982 274 L 982 150 L 982 26 L 914 26 L 846 26 L 846 82Z'
	},
	area_54: {
		href: 'http://sideful.ru',
		title: 'Аптека первая помощь',
		space: '54',
		path: 'M 826 101 L 826 113 L 818 113 L 810 113 L 810 124 L 810 135 L 826.5 135 L 843 135 L 843 112 L 843 89 L 834.5 89 L 826 89 L 826 101Z'
	},
	area_56: {
		href: 'http://sideful.ru',
		title: 'RBT.RU',
		space: '56',
		path: 'M 829 301.1 C 829 317.2 829.4 325.9 830.1 327.3 C 830.8 328.5 833.5 332.8 836.1 336.8 C 838.8 340.8 841 344.5 841 345 C 841 345.6 841.5 346 842 346 C 842.6 346 843 346.5 843 347.1 C 843 348 851.7 361.9 854 364.7 C 854.5 365.4 855 366.3 855 366.8 C 855 367.2 855.8 368.5 856.8 369.6 C 857.7 370.7 859.4 373.2 860.4 375.3 C 861.5 377.3 862.7 379 863.2 379 C 863.6 379 864 379.7 864 380.5 C 864 381.3 864.4 382 864.9 382 C 865.4 382 866.2 383.3 866.8 384.8 C 867.3 386.4 868.4 388.3 869.1 389.1 C 869.9 389.9 871 391.5 871.7 392.5 C 878.7 404.1 883.5 411.6 884.2 411.8 C 884.6 412 885 412.6 885 413.1 C 885 414.2 894.1 428.3 895.4 429.2 C 896 429.6 915.7 430 939.3 430 L 982 430 L 982 353.5 L 982 277 L 905.5 277 L 829 277 L 829 301.1Z'
	},
	area_57: {
		href: 'http://sideful.ru',
		title: 'Грааль',
		space: '57',
		path: 'M 829.7 334.7 C 829.3 335 829 377.8 829 429.7 L 829 524 L 905.5 524 L 982 524 L 982 478.5 L 982 433 L 938.2 433 C 895.1 433 894.4 433 892.7 430.9 C 891.7 429.8 890.4 427.8 889.8 426.4 C 889.2 425.1 888.3 424 887.9 424 C 887.5 424 886.9 422.9 886.6 421.5 C 886.2 420.1 885.5 419 885 419 C 884.4 419 884 418.5 884 417.8 C 884 417.2 882.9 415.2 881.5 413.4 C 880.1 411.6 879 409.7 879 409.3 C 879 408.8 878.2 407.5 877.3 406.4 C 876.3 405.4 874.6 402.8 873.5 400.7 C 872.4 398.7 871.2 397 870.8 397 C 870.3 397 870 396.3 870 395.5 C 870 394.7 869.6 394 869.1 394 C 868.6 394 867.9 392.9 867.6 391.5 C 867.2 390.1 866.5 389 866 389 C 865.4 389 865 388.4 865 387.7 C 865 387 864.2 385.5 863.1 384.4 C 862.1 383.3 860.9 381.4 860.6 380.2 C 860.2 379 859.4 378 858.9 378 C 858.4 378 858 377.3 858 376.5 C 858 375.7 857.6 375 857 375 C 856.5 375 856 374.3 856 373.5 C 856 372.7 855.6 372 855.1 372 C 854.6 372 853.9 370.9 853.6 369.5 C 853.2 368.1 852.5 367 852 367 C 851.4 367 851 366.5 851 365.8 C 851 365.2 849.9 363.2 848.5 361.4 C 847.1 359.6 846 357.7 846 357.3 C 846 356.8 845.2 355.5 844.3 354.4 C 843.3 353.3 841.6 350.8 840.6 348.7 C 839.5 346.7 838.3 345 837.8 345 C 837.4 345 837 344.6 837 344.1 C 837 342.8 831.7 334.1 830.9 334 C 830.6 334 830 334.3 829.7 334.7Z'
	},
	area_58: {
		href: 'http://sideful.ru',
		title: 'Лэтуаль',
		space: '58',
		path: 'M 569 232.5 L 569 274 L 587 274 L 605 274 L 605 232.5 L 605 191 L 587 191 L 569 191 L 569 232.5Z'
	},
	area_59: {
		href: 'http://sideful.ru',
		title: 'Diva',
		space: '59',
		path: 'M 569 287 L 569 297 L 587 297 L 605 297 L 605 287 L 605 277 L 587 277 L 569 277 L 569 287Z'
	},
	area_60: {
		href: 'http://sideful.ru',
		title: 'Розовая бабочка',
		space: '60',
		path: 'M 569 312.5 L 569 325 L 587 325 L 605 325 L 605 312.5 L 605 300 L 587 300 L 569 300 L 569 312.5Z'
	},
	area_61: {
		href: 'http://sideful.ru',
		title: 'МТС',
		space: '61',
		path: 'M 569 343.5 L 569 359 L 587 359 L 605 359 L 605 343.5 L 605 328 L 587 328 L 569 328 L 569 343.5Z'
	},
	area_62: {
		href: 'http://sideful.ru',
		title: 'Befree',
		space: '62',
		path: 'M 608 232.5 L 608 274 L 626.5 274 L 645 274 L 645 232.5 L 645 191 L 626.5 191 L 608 191 L 608 232.5Z'
	},
	area_63: {
		href: 'http://sideful.ru',
		title: 'Milavitsa',
		space: '63',
		path: 'M 648 208 L 648 225 L 656.5 225 L 665 225 L 665 208 L 665 191 L 656.5 191 L 648 191 L 648 208Z'
	},
	area_64: {
		href: 'http://sideful.ru',
		title: 'Deseo',
		space: '64',
		path: 'M 668 209.5 L 668 228 L 658 228 L 648 228 L 648 251 L 648 274 L 666.5 274 L 685 274 L 685 232.5 L 685 191 L 676.5 191 L 668 191 L 668 209.5Z'
	},
	area_65: {
		href: 'http://sideful.ru',
		title: 'Мега',
		space: '65',
		path: 'M 608 318 L 608 359 L 616 359 L 624 359 L 624 318 L 624 277 L 616 277 L 608 277 L 608 318Z'
	},
	area_66: {
		href: 'http://sideful.ru',
		title: 'Классик',
		space: '66',
		path: 'M 627 318 L 627 359 L 646 359 L 665 359 L 665 318 L 665 277 L 646 277 L 627 277 L 627 318Z'
	},
	area_67: {
		href: 'http://sideful.ru',
		title: 'Респект',
		space: '67',
		path: 'M 668 318 L 668 359 L 676.5 359 L 685 359 L 685 318 L 685 277 L 676.5 277 L 668 277 L 668 318Z'
	},
	area_68: {
		href: 'http://sideful.ru',
		title: 'Centro',
		space: '68',
		path: 'M 688 275 L 688 359 L 697 359 L 706 359 L 706 341 L 706 323 L 716 323 L 726 323 L 726 257 L 726 191 L 707 191 L 688 191 L 688 275Z'
	},
	area_71: {
		href: 'http://sideful.ru',
		title: 'Непонятно',
		space: '71',
		path: 'M 749 203.5 L 749 216 L 757.5 216 L 766 216 L 766 203.5 L 766 191 L 757.5 191 L 749 191 L 749 203.5Z'
	},
	area_72: {
		href: 'http://sideful.ru',
		title: 'Стиль',
		space: '72',
		path: 'M 769 203.5 L 769 216 L 776 216 L 783 216 L 783 203.5 L 783 191 L 776 191 L 769 191 L 769 203.5Z'
	},
	area_73: {
		href: 'http://sideful.ru',
		title: 'Сумка плюс',
		space: '73',
		path: 'M 769 246.5 L 769 274 L 776 274 L 783 274 L 783 246.5 L 783 219 L 776 219 L 769 219 L 769 246.5Z'
	},
	area_74: {
		href: 'http://sideful.ru',
		title: 'Стиляга плюс',
		space: '74',
		path: 'M 729 318 L 729 359 L 737.5 359 L 746 359 L 746 329 L 746 299 L 756 299 L 766 299 L 766 288 L 766 277 L 747.5 277 L 729 277 L 729 318Z'
	},
	area_75: {
		href: 'http://sideful.ru',
		title: 'Carcity',
		space: '75',
		path: 'M 749 330.5 L 749 359 L 757.5 359 L 766 359 L 766 330.5 L 766 302 L 757.5 302 L 749 302 L 749 330.5Z'
	},
	area_77: {
		href: 'http://sideful.ru',
		title: 'Непонятно',
		space: '77',
		path: 'M 769 312.5 L 769 323 L 776 323 L 783 323 L 783 312.5 L 783 302 L 776 302 L 769 302 L 769 312.5Z'
	},
	area_78: {
		href: 'http://sideful.ru',
		title: 'Смайлик',
		space: '78',
		path: 'M 769 342.5 L 769 359 L 776 359 L 783 359 L 783 342.5 L 783 326 L 776 326 L 769 326 L 769 342.5Z'
	},
	area_79: {
		href: 'http://sideful.ru',
		title: 'Юvелир',
		space: '79',
		path: 'M 551 440.5 L 551 466 L 559 466 L 567 466 L 567 440.5 L 567 415 L 559 415 L 551 415 L 551 440.5Z'
	},
	area_80: {
		href: 'http://sideful.ru',
		title: 'Непонятно',
		space: '80',
		path: 'M 551 480 L 551 491 L 559 491 L 567 491 L 567 480 L 567 469 L 559 469 L 551 469 L 551 480Z'
	},
	area_81: {
		href: 'http://sideful.ru',
		title: '12 вольт',
		space: '81',
		path: 'M 551 509 L 551 524 L 559 524 L 567 524 L 567 509 L 567 494 L 559 494 L 551 494 L 551 509Z'
	},
	area_82: {
		href: 'http://sideful.ru',
		title: 'Макси-мебель',
		space: '82',
		path: 'M 570 469.5 L 570 524 L 588.5 524 L 607 524 L 607 469.5 L 607 415 L 588.5 415 L 570 415 L 570 469.5Z'
	},
	area_83: {
		href: 'http://sideful.ru',
		title: 'Три слона',
		space: '83',
		path: 'M 610 469.5 L 610 524 L 626.5 524 L 643 524 L 643 469.5 L 643 415 L 626.5 415 L 610 415 L 610 469.5Z'
	},
	area_84: {
		href: 'http://sideful.ru',
		title: 'Фудзияма',
		space: '84',
		path: 'M 673 498 L 673 524 L 680.5 524 L 688 524 L 688 498 L 688 472 L 680.5 472 L 673 472 L 673 498Z'
	},
	area_85: {
		href: 'http://sideful.ru',
		title: 'Manhattan Pizza',
		space: '85',
		path: 'M 691 498 L 691 524 L 698.5 524 L 706 524 L 706 498 L 706 472 L 698.5 472 L 691 472 L 691 498Z'
	},
	area_86: {
		href: 'http://sideful.ru',
		title: 'Пицца марио',
		space: '86',
		path: 'M 709 498 L 709 524 L 717 524 L 725 524 L 725 498 L 725 472 L 717 472 L 709 472 L 709 498Z'
	},
	area_87: {
		href: 'http://sideful.ru',
		title: 'Суши маки',
		space: '87',
		path: 'M 728 498 L 728 524 L 736.5 524 L 745 524 L 745 498 L 745 472 L 736.5 472 L 728 472 L 728 498Z'
	},
	area_88: {
		href: 'http://sideful.ru',
		title: 'Рус бургер',
		space: '88',
		path: 'M 748 498 L 748 524 L 758 524 L 768 524 L 768 498 L 768 472 L 758 472 L 748 472 L 748 498Z'
	},
	area_89: {
		href: 'http://sideful.ru',
		title: 'Непонятно',
		space: '89',
		path: 'M 771 426.5 L 771 438 L 778 438 L 785 438 L 785 426.5 L 785 415 L 778 415 L 771 415 L 771 426.5Z'
	},
	area_90: {
		href: 'http://sideful.ru',
		title: 'Сковородовна',
		space: '90',
		path: 'M 771 482.5 L 771 524 L 778 524 L 785 524 L 785 482.5 L 785 441 L 778 441 L 771 441 L 771 482.5Z'
	},
	/*
	area_3: {
		href: '',
		title: '',
		space: '3',
		path: 'M 349 56 L 349 86 L 368.5 86 L 388 86 L 388 99.5 L 388 113 L 398.5 113 L 409 113 L 409 124 L 409 135 L 425.5 135 L 442 135 L 442 80.5 L 442 26 L 395.5 26 L 349 26 L 349 56Z'
	},
	area_24: {
		href: '',
		title: '',
		space: '24',
		path: 'M 329 330.5 L 329 359 L 337 359 L 345 359 L 345 330.5 L 345 302 L 337 302 L 329 302 L 329 330.5Z'
	},
	area_35: {
		href: '',
		title: '',
		space: '35',
		path: 'M 228 422 L 228 439 L 189 439 L 150 439 L 150 481.5 L 150 524 L 210.5 524 L 271 524 L 271 469.5 L 271 415 L 261 415 C 253.4 415 249.5 414.5 244.8 412.8 C 238 410.5 234 408.3 232.7 406.3 C 232.3 405.6 231 405 230 405 C 228.1 405 228 405.8 228 422Z'
	},
	area_37: {
		href: '',
		title: '',
		space: '37',
		path: 'M 310 469.5 L 310 524 L 336.5 524 L 363 524 L 363 469.5 L 363 415 L 336.5 415 L 310 415 L 310 469.5Z'
	},
	area_43: {
		href: '',
		title: '',
		space: '43',
		path: 'M 487 456.5 L 487 466 L 497.5 466 L 508 466 L 508 456.5 L 508 447 L 497.5 447 L 487 447 L 487 456.5Z'
	},
	area_69: {
		href: '',
		title: '',
		space: '69',
		path: 'M 709 343.5 L 709 359 L 717.5 359 L 726 359 L 726 343.5 L 726 328 L 717.5 328 L 709 328 L 709 343.5Z'
	},
	area_70: {
		href: '',
		title: '',
		space: '70',
		path: 'M 729 232.5 L 729 274 L 747.5 274 L 766 274 L 766 246.5 L 766 219 L 756 219 L 746 219 L 746 205 L 746 191 L 737.5 191 L 729 191 L 729 232.5Z'
	},
	area_76: {
		href: '',
		title: '',
		space: '76',
		path: 'M 769 288 L 769 299 L 776 299 L 783 299 L 783 288 L 783 277 L 776 277 L 769 277 L 769 288Z'
	},
	area_91: {
		href: '',
		title: '',
		space: '91',
		path: 'M 788 469.5 L 788 524 L 807 524 L 826 524 L 826 469.5 L 826 415 L 807 415 L 788 415 L 788 469.5Z'
	},
	*/	
}

/* Торговый центр 'Ривьера', этаж 1 (путь '/maps/scheme/3/floor1/') */
var s3_f1 = {
	area_1: {
		href: 'http://sideful.ru',
		title: 'Детский мир',
		space: '1',
		path: 'M 4 101 L 4 198 L 109 198 L 214 198 L 214 101 L 214 4 L 109 4 L 4 4 L 4 101Z'
	},
	area_2: {
		href: 'http://sideful.ru',
		title: 'Centro',
		space: '2',
		path: 'M 217 73 L 217 142 L 235 142 L 253 142 L 253 170 L 253 198 L 286.5 198 L 320 198 L 320 101 L 320 4 L 268.5 4 L 217 4 L 217 73Z'
	},
	area_3: {
		href: 'http://sideful.ru',
		title: 'Лева',
		space: '3',
		path: 'M 217 171.5 L 217 198 L 233.5 198 L 250 198 L 250 171.5 L 250 145 L 233.5 145 L 217 145 L 217 171.5Z'
	},
	area_4: {
		href: 'http://sideful.ru',
		title: 'Мария-ра',
		space: '4',
		path: 'M 323 61.5 L 323 119 L 394.5 119 L 466 119 L 466 132 L 466 145 L 499.5 145 L 533 145 L 533 161 L 533 177 L 588.5 177 L 644 177 L 644 188 L 644 199 L 713 199 L 782 199 L 782 101.5 L 782 4 L 552.5 4 L 323 4 L 323 61.5Z'
	},
	area_5: {
		href: 'http://sideful.ru',
		title: 'Первая помощь',
		space: '5',
		path: 'M 323 160 L 323 198 L 339 198 L 355 198 L 355 160 L 355 122 L 339 122 L 323 122 L 323 160Z'
	},
	area_6: {
		href: 'http://sideful.ru',
		title: 'Аквамир',
		space: '6',
		path: 'M 358 160 L 358 198 L 373.5 198 L 389 198 L 389 160 L 389 122 L 373.5 122 L 358 122 L 358 160Z'
	},
	area_7: {
		href: 'http://sideful.ru',
		title: 'Dino ricci',
		space: '7',
		path: 'M 392 149.5 L 392 177 L 427.5 177 L 463 177 L 463 149.5 L 463 122 L 427.5 122 L 392 122 L 392 149.5Z'
	},
	area_8: {
		href: 'http://sideful.ru',
		title: 'Исида',
		space: '8',
		path: 'M 466 162.5 L 466 177 L 498 177 L 530 177 L 530 162.5 L 530 148 L 498 148 L 466 148 L 466 162.5Z'
	},
	area_9: {
		href: 'http://sideful.ru',
		title: 'Яшма золото',
		space: '9',
		path: 'M 533 189.5 L 533 199 L 549.5 199 L 566 199 L 566 189.5 L 566 180 L 549.5 180 L 533 180 L 533 189.5Z'
	},
	area_10: {
		href: 'http://sideful.ru',
		title: 'Уралсиб',
		space: '10',
		path: 'M 569 189.5 L 569 199 L 587 199 L 605 199 L 605 189.5 L 605 180 L 587 180 L 569 180 L 569 189.5Z'
	},
	area_11: {
		href: 'http://sideful.ru',
		title: 'Исида',
		space: '11',
		path: 'M 608 189.5 L 608 199 L 624.5 199 L 641 199 L 641 189.5 L 641 180 L 624.5 180 L 608 180 L 608 189.5Z'
	},
	area_12: {
		href: 'http://sideful.ru',
		title: 'Dolce vita',
		space: '12',
		path: 'M 785 101.5 L 785 199 L 799 199 L 813 199 L 813 101.5 L 813 4 L 799 4 L 785 4 L 785 101.5Z'
	},
	area_13: {
		href: 'http://sideful.ru',
		title: 'Глория джинс',
		space: '13',
		path: 'M 816 66 L 816 92 L 851 92 L 886 92 L 886 145.5 L 886 199 L 921 199 L 956 199 L 956 119.5 L 956 40 L 886 40 L 816 40 L 816 66Z'
	},
	area_14: {
		href: 'http://sideful.ru',
		title: 'S oliver',
		space: '14',
		path: 'M 816 147 L 816 199 L 833 199 L 850 199 L 850 147 L 850 95 L 833 95 L 816 95 L 816 147Z'
	},
	area_15: {
		href: 'http://sideful.ru',
		title: 'Ecco',
		space: '15',
		path: 'M 853 147 L 853 199 L 868 199 L 883 199 L 883 147 L 883 95 L 868 95 L 853 95 L 853 147Z'
	},
	area_16: {
		href: 'http://sideful.ru',
		title: 'Детская одежда',
		space: '16',
		path: 'M 4 218 L 4 235 L 21 235 L 38 235 L 38 218 L 38 201 L 21 201 L 4 201 L 4 218Z'
	},
	area_17: {
		href: 'http://sideful.ru',
		title: 'Мини босс',
		space: '17',
		path: 'M 4 272 L 4 306 L 21 306 L 38 306 L 38 272 L 38 238 L 21 238 L 4 238 L 4 272Z'
	},
	area_18: {
		href: 'http://sideful.ru',
		title: 'Рукоделие',
		space: '18',
		path: 'M 131 233.5 L 131 244 L 154 244 L 177 244 L 177 233.5 L 177 223 L 154 223 L 131 223 L 131 233.5Z'
	},
	area_21: {
		href: 'http://sideful.ru',
		title: '7 news',
		space: '21',
		path: 'M 256 233.5 L 256 244 L 278 244 L 300 244 L 300 233.5 L 300 223 L 278 223 L 256 223 L 256 233.5Z'
	},
	area_22: {
		href: 'http://sideful.ru',
		title: 'Бижутерия',
		space: '22',
		path: 'M 303 233.5 L 303 244 L 325 244 L 347 244 L 347 233.5 L 347 223 L 325 223 L 303 223 L 303 233.5Z'
	},
	area_23: {
		href: 'http://sideful.ru',
		title: 'Мюз',
		space: '23',
		path: 'M 350 233.5 L 350 244 L 375.5 244 L 401 244 L 401 233.5 L 401 223 L 375.5 223 L 350 223 L 350 233.5Z'
	},
	area_24: {
		href: 'http://sideful.ru',
		title: 'Наше серебро',
		space: '24',
		path: 'M 404 233.5 L 404 244 L 421.5 244 L 439 244 L 439 233.5 L 439 223 L 421.5 223 L 404 223 L 404 233.5Z'
	},
	area_26: {
		href: 'http://sideful.ru',
		title: 'Совком банк',
		space: '26',
		path: 'M 524 233.5 L 524 244 L 545.5 244 L 567 244 L 567 233.5 L 567 223 L 545.5 223 L 524 223 L 524 233.5Z'
	},
	area_27: {
		href: 'http://sideful.ru',
		title: 'Кофе на вынос',
		space: '27',
		path: 'M 604 233.5 L 604 244 L 621.5 244 L 639 244 L 639 233.5 L 639 223 L 621.5 223 L 604 223 L 604 233.5Z'
	},
	area_28: {
		href: 'http://sideful.ru',
		title: 'Итальянское мороженое',
		space: '28',
		path: 'M 642 233.5 L 642 244 L 670 244 L 698 244 L 698 233.5 L 698 223 L 670 223 L 642 223 L 642 233.5Z'
	},
	area_30: {
		href: 'http://sideful.ru',
		title: 'Бижутерия',
		space: '30',
		path: 'M 774 233.5 L 774 244 L 794 244 L 814 244 L 814 233.5 L 814 223 L 794 223 L 774 223 L 774 233.5Z'
	},
	area_31: {
		href: 'http://sideful.ru',
		title: 'Мегафон',
		space: '31',
		path: 'M 817 233.5 L 817 244 L 834 244 L 851 244 L 851 233.5 L 851 223 L 834 223 L 817 223 L 817 233.5Z'
	},
	area_32: {
		href: 'http://sideful.ru',
		title: 'Новэкс',
		space: '32',
		path: 'M 41 289 L 41 309 L 22.5 309 L 4 309 L 4 385 L 4 461 L 56 461 L 108 461 L 108 365 L 108 269 L 74.5 269 L 41 269 L 41 289Z'
	},
	area_33: {
		href: 'http://sideful.ru',
		title: 'Одежда',
		space: '33',
		path: 'M 111 365 L 111 461 L 127 461 L 143 461 L 143 365 L 143 269 L 127 269 L 111 269 L 111 365Z'
	},
	area_34: {
		href: 'http://sideful.ru',
		title: 'El tempo',
		space: '34',
		path: 'M 146 341.5 L 146 414 L 162 414 L 178 414 L 178 341.5 L 178 269 L 162 269 L 146 269 L 146 341.5Z'
	},
	area_35: {
		href: 'http://sideful.ru',
		title: 'Золотой телец',
		space: '35',
		path: 'M 181 341.5 L 181 414 L 198 414 L 215 414 L 215 341.5 L 215 269 L 198 269 L 181 269 L 181 341.5Z'
	},
	area_36: {
		href: 'http://sideful.ru',
		title: 'Аляска',
		space: '36',
		path: 'M 218 341.5 L 218 414 L 249.5 414 L 281 414 L 281 341.5 L 281 269 L 249.5 269 L 218 269 L 218 341.5Z'
	},
	area_37: {
		href: 'http://sideful.ru',
		title: 'Планета стерео',
		space: '37',
		path: 'M 284 281.5 L 284 294 L 300 294 L 316 294 L 316 281.5 L 316 269 L 300 269 L 284 269 L 284 281.5Z'
	},
	area_38: {
		href: 'http://sideful.ru',
		title: 'Евросеть',
		space: '38',
		path: 'M 319 281.5 L 319 294 L 336 294 L 353 294 L 353 281.5 L 353 269 L 336 269 L 319 269 L 319 281.5Z'
	},
	area_39: {
		href: 'http://sideful.ru',
		title: 'Банк',
		space: '39',
		path: 'M 319 308.5 L 319 320 L 336 320 L 353 320 L 353 308.5 L 353 297 L 336 297 L 319 297 L 319 308.5Z'
	},
	area_40: {
		href: 'http://sideful.ru',
		title: 'Calipso',
		space: '40',
		path: 'M 284 344 L 284 391 L 318.5 391 L 353 391 L 353 357 L 353 323 L 334.5 323 L 316 323 L 316 310 L 316 297 L 300 297 L 284 297 L 284 344Z'
	},
	area_41: {
		href: 'http://sideful.ru',
		title: 'Лазурит',
		space: '41',
		path: 'M 284 405.5 L 284 417 L 215 417 L 146 417 L 146 439 L 146 461 L 233.5 461 L 321 461 L 321 456 C 321 453.2 321.3 451 321.8 451 C 322.2 451 323.7 450 325.2 448.7 C 326.6 447.5 328.8 445.8 330.1 445 C 331.3 444.2 333.4 442.5 334.6 441.3 C 335.7 440 337.2 439 337.8 439 C 338.4 439 339.4 438.1 340 437 C 340.6 435.9 341.5 435 342 435 C 343 435 345.8 433 349.2 429.7 C 350.2 428.8 351.5 428 352 428 C 352.6 428 353 421.7 353 411 L 353 394 L 318.5 394 L 284 394 L 284 405.5Z'
	},
	area_43: {
		href: 'http://sideful.ru',
		title: 'Золото России',
		space: '43',
		path: 'M 395 323 L 395 356 L 427.5 356 L 460 356 L 460 323 L 460 290 L 427.5 290 L 395 290 L 395 323Z'
	},
	area_44: {
		href: 'http://sideful.ru',
		title: 'Befree',
		space: '44',
		path: 'M 463 323 L 463 356 L 481 356 L 499 356 L 499 408.5 L 499 461 L 533 461 L 567 461 L 567 410 L 567 359 L 549.5 359 L 532 359 L 532 324.5 L 532 290 L 497.5 290 L 463 290 L 463 323Z'
	},
	area_45: {
		href: 'http://sideful.ru',
		title: 'Форнэ',
		space: '45',
		path: 'M 395 376.5 L 395 394 L 419 394 L 443 394 L 443 427.5 L 443 461 L 469.5 461 L 496 461 L 496 410 L 496 359 L 445.5 359 L 395 359 L 395 376.5Z'
	},
	area_46: {
		href: 'http://sideful.ru',
		title: 'Дверидоф',
		space: '46',
		path: 'M 395 413 L 395 429 L 417.5 429 L 440 429 L 440 413 L 440 397 L 417.5 397 L 395 397 L 395 413Z'
	},
	area_48: {
		href: 'http://sideful.ru',
		title: 'Лэтуаль',
		space: '48',
		path: 'M 535 312.5 L 535 356 L 569 356 L 603 356 L 603 312.5 L 603 269 L 569 269 L 535 269 L 535 312.5Z'
	},
	area_49: {
		href: 'http://sideful.ru',
		title: 'Mango',
		space: '49',
		path: 'M 606 314 L 606 359 L 588 359 L 570 359 L 570 410 L 570 461 L 613.5 461 L 657 461 L 657 365 L 657 269 L 631.5 269 L 606 269 L 606 314Z'
	},
	area_50: {
		href: 'http://sideful.ru',
		title: 'Incity',
		space: '50',
		path: 'M 660 365 L 660 461 L 694 461 L 728 461 L 728 440.5 L 728 420 L 770.5 420 L 813 420 L 813 389.5 L 813 359 L 761.5 359 L 710 359 L 710 314 L 710 269 L 685 269 L 660 269 L 660 365Z'
	},
	area_51: {
		href: 'http://sideful.ru',
		title: 'Сумки люкс',
		space: '51',
		path: 'M 713 312.5 L 713 356 L 729 356 L 745 356 L 745 312.5 L 745 269 L 729 269 L 713 269 L 713 312.5Z'
	},
	area_52: {
		href: 'http://sideful.ru',
		title: 'Русская охота',
		space: '52',
		path: 'M 748 312.5 L 748 356 L 765 356 L 782 356 L 782 312.5 L 782 269 L 765 269 L 748 269 L 748 312.5Z'
	},
	area_53: {
		href: 'http://sideful.ru',
		title: 'Felichita',
		space: '53',
		path: 'M 785 312.5 L 785 356 L 799 356 L 813 356 L 813 312.5 L 813 269 L 799 269 L 785 269 L 785 312.5Z'
	},
	area_54: {
		href: 'http://sideful.ru',
		title: 'Adidas kids',
		space: '54',
		path: 'M 816 344.5 L 816 420 L 834 420 L 852 420 L 852 344.5 L 852 269 L 834 269 L 816 269 L 816 344.5Z'
	},
	area_55: {
		href: 'http://sideful.ru',
		title: 'Adidas',
		space: '55',
		path: 'M 855 344.5 L 855 420 L 872 420 L 889 420 L 889 440.5 L 889 461 L 922.5 461 L 956 461 L 956 365 L 956 269 L 905.5 269 L 855 269 L 855 344.5Z'
	},
	/*
	area_19: {
		href: '',
		title: '',
		space: '19',
		path: 'M 180 233.5 L 180 244 L 197.5 244 L 215 244 L 215 233.5 L 215 223 L 197.5 223 L 180 223 L 180 233.5Z'
	},
	area_20: {
		href: '',
		title: '',
		space: '20',
		path: 'M 218 233.5 L 218 244 L 235.5 244 L 253 244 L 253 233.5 L 253 223 L 235.5 223 L 218 223 L 218 233.5Z'
	},
	area_25: {
		href: '',
		title: '',
		space: '25',
		path: 'M 442 233.5 L 442 244 L 461 244 L 480 244 L 480 233.5 L 480 223 L 461 223 L 442 223 L 442 233.5Z'
	},
	area_29: {
		href: '',
		title: '',
		space: '29',
		path: 'M 723 233.5 L 723 244 L 736 244 L 749 244 L 749 233.5 L 749 223 L 736 223 L 723 223 L 723 233.5Z'
	},
	area_42: {
		href: '',
		title: '',
		space: '42',
		path: 'M 349 433.7 C 345.8 435.9 344.3 437.1 341.9 439.2 C 340.9 440.2 339.5 441 339 441 C 338.4 441 337.7 441.7 337.4 442.5 C 337 443.3 336.4 444 335.9 444 C 335.3 444 334.2 444.6 333.4 445.2 C 332.6 445.9 331.4 447 330.7 447.5 C 330 448.1 328.3 449.3 326.8 450.3 C 324.4 451.8 324 452.7 324 456.5 L 324 461 L 338.5 461 L 353 461 L 353 446.5 C 353 438.5 352.7 432 352.2 432 C 351.8 432 350.3 432.8 349 433.7Z'
	},
	area_47: {
		href: 'http://sideful.ru',
		title: '',
		space: '100',
		path: 'M 395 446.5 L 395 461 L 417.5 461 L 440 461 L 440 446.5 L 440 432 L 417.5 432 L 395 432 L 395 446.5Z'
	},
	*/
}

/* Торговый центр 'Ривьера', этаж 2 (путь '/maps/scheme/3/floor2/') */
var s3_f2 = {
	area_1: {
		href: 'http://sideful.ru',
		title: 'Спортмастер',
		space: '1',
		path: 'M 4 101 L 4 198 L 109.5 198 L 215 198 L 215 187.5 L 215 177 L 247.5 177 L 280 177 L 280 108.5 L 280 40 L 246 40 L 212 40 L 212 22 L 212 4 L 108 4 L 4 4 L 4 101Z'
	},
	area_2: {
		href: 'http://sideful.ru',
		title: 'Ostin',
		space: '2',
		path: 'M 308 22 L 308 40 L 295.5 40 L 283 40 L 283 108.5 L 283 177 L 344.5 177 L 406 177 L 406 167.5 L 406 158 L 415 158 L 424 158 L 424 81 L 424 4 L 366 4 L 308 4 L 308 22Z'
	},
	area_4: {
		href: 'http://sideful.ru',
		title: 'Белвест',
		space: '4',
		path: 'M 427 81 L 427 158 L 445 158 L 463 158 L 463 81 L 463 4 L 445 4 L 427 4 L 427 81Z'
	},
	area_5: {
		href: 'http://sideful.ru',
		title: 'Синар',
		space: '5',
		path: 'M 466 81 L 466 158 L 480.5 158 L 495 158 L 495 81 L 495 4 L 480.5 4 L 466 4 L 466 81Z'
	},
	area_6: {
		href: 'http://sideful.ru',
		title: 'Кинотеатр',
		space: '6',
		path: 'M 498 73 L 498 142 L 550 142 L 602 142 L 602 150 L 602 158 L 606 158 L 610 158 L 610 81 L 610 4 L 554 4 L 498 4 L 498 73Z'
	},
	area_7: {
		href: 'http://sideful.ru',
		title: 'Непонятно',
		space: '7',
		path: 'M 498 151.5 L 498 158 L 514 158 L 530 158 L 530 151.5 L 530 145 L 514 145 L 498 145 L 498 151.5Z'
	},
	area_8: {
		href: 'http://sideful.ru',
		title: 'Непонятно',
		space: '8',
		path: 'M 533 151.5 L 533 158 L 543 158 L 553 158 L 553 151.5 L 553 145 L 543 145 L 533 145 L 533 151.5Z'
	},
	area_9: {
		href: 'http://sideful.ru',
		title: 'Непонятно',
		space: '9',
		path: 'M 556 151.5 L 556 158 L 567.5 158 L 579 158 L 579 151.5 L 579 145 L 567.5 145 L 556 145 L 556 151.5Z'
	},
	area_10: {
		href: 'http://sideful.ru',
		title: '',
		space: '10',
		path: 'M 582 151.5 L 582 158 L 590.5 158 L 599 158 L 599 151.5 L 599 145 L 590.5 145 L 582 145 L 582 151.5Z'
	},
	area_11: {
		href: 'http://sideful.ru',
		title: 'Кинотеатр',
		space: '11',
		path: 'M 642 81 L 642 158 L 669.5 158 L 697 158 L 697 152 L 697 146 L 720.5 146 L 744 146 L 744 75 L 744 4 L 693 4 L 642 4 L 642 81Z'
	},
	area_12: {
		href: 'http://sideful.ru',
		title: '4D',
		space: '12',
		path: 'M 700 159.5 L 700 170 L 718.5 170 L 737 170 L 737 159.5 L 737 149 L 718.5 149 L 700 149 L 700 159.5Z'
	},
	area_13: {
		href: 'http://sideful.ru',
		title: 'Боулинг',
		space: '13',
		path: 'M 797 48 L 797 92 L 806.5 92 L 816 92 L 816 84.5 L 816 77 L 886 77 L 956 77 L 956 40.5 L 956 4 L 876.5 4 L 797 4 L 797 48Z'
	},
	area_14: {
		href: 'http://sideful.ru',
		title: 'Обезьяна',
		space: '14',
		path: 'M 819 87.5 L 819 95 L 808 95 L 797 95 L 797 120.5 L 797 146 L 876.5 146 L 956 146 L 956 113 L 956 80 L 887.5 80 L 819 80 L 819 87.5Z'
	},
	area_15: {
		href: 'http://sideful.ru',
		title: 'М-видео',
		space: '15',
		path: 'M 4 331 L 4 461 L 214 461 L 424 461 L 424 427.5 L 424 394 L 319.5 394 L 215 394 L 215 297.5 L 215 201 L 109.5 201 L 4 201 L 4 331Z'
	},
	area_16: {
		href: 'http://sideful.ru',
		title: 'Мороженое',
		space: '16',
		path: 'M 562 189 L 562 199 L 587 199 L 612 199 L 612 189 L 612 179 L 587 179 L 562 179 L 562 189Z'
	},
	area_17: {
		href: 'http://sideful.ru',
		title: 'МТС',
		space: '17',
		path: 'M 634 217.5 L 634 233 L 653 233 L 672 233 L 672 217.5 L 672 202 L 653 202 L 634 202 L 634 217.5Z'
	},
	area_18: {
		href: 'http://sideful.ru',
		title: 'Дивизион',
		space: '18',
		path: 'M 634 251 L 634 266 L 653 266 L 672 266 L 672 251 L 672 236 L 653 236 L 634 236 L 634 251Z'
	},
	area_19: {
		href: 'http://sideful.ru',
		title: 'O-la-la',
		space: '19',
		path: 'M 675 234 L 675 266 L 690 266 L 705 266 L 705 234 L 705 202 L 690 202 L 675 202 L 675 234Z'
	},
	area_20: {
		href: 'http://sideful.ru',
		title: 'Непонятно',
		space: '20',
		path: 'M 708 217.5 L 708 233 L 728.5 233 L 749 233 L 749 217.5 L 749 202 L 728.5 202 L 708 202 L 708 217.5Z'
	},
	area_21: {
		href: 'http://sideful.ru',
		title: 'Лэнджери',
		space: '21',
		path: 'M 708 251 L 708 266 L 728.5 266 L 749 266 L 749 251 L 749 236 L 728.5 236 L 708 236 L 708 251Z'
	},
	area_22: {
		href: 'http://sideful.ru',
		title: 'Детский лабиринт',
		space: '22',
		path: 'M 752 217.5 L 752 233 L 770 233 L 788 233 L 788 217.5 L 788 202 L 770 202 L 752 202 L 752 217.5Z'
	},
	area_23: {
		href: 'http://sideful.ru',
		title: 'Белье',
		space: '23',
		path: 'M 752 251 L 752 266 L 770 266 L 788 266 L 788 251 L 788 236 L 770 236 L 752 236 L 752 251Z'
	},
	area_24: {
		href: 'http://sideful.ru',
		title: 'Винегрет',
		space: '24',
		path: 'M 854 164.5 L 854 180 L 868.5 180 L 883 180 L 883 164.5 L 883 149 L 868.5 149 L 854 149 L 854 164.5Z'
	},
	area_25: {
		href: 'http://sideful.ru',
		title: 'Hasburger',
		space: '25',
		path: 'M 886 164.5 L 886 180 L 903 180 L 920 180 L 920 164.5 L 920 149 L 903 149 L 886 149 L 886 164.5Z'
	},
	area_26: {
		href: 'http://sideful.ru',
		title: 'Таки суши',
		space: '26',
		path: 'M 923 164.5 L 923 180 L 939.5 180 L 956 180 L 956 164.5 L 956 149 L 939.5 149 L 923 149 L 923 164.5Z'
	},
	area_28: {
		href: 'http://sideful.ru',
		title: 'Neon',
		space: '28',
		path: 'M 218 344 L 218 391 L 233 391 L 248 391 L 248 344 L 248 297 L 233 297 L 218 297 L 218 344Z'
	},
	area_29: {
		href: 'http://sideful.ru',
		title: 'Fresh',
		space: '29',
		path: 'M 251 344 L 251 391 L 266 391 L 281 391 L 281 344 L 281 297 L 266 297 L 251 297 L 251 344Z'
	},
	area_30: {
		href: 'http://sideful.ru',
		title: 'Дикси',
		space: '30',
		path: 'M 284 344 L 284 391 L 300 391 L 316 391 L 316 344 L 316 297 L 300 297 L 284 297 L 284 344Z'
	},
	area_31: {
		href: 'http://sideful.ru',
		title: 'Одежда',
		space: '31',
		path: 'M 319 344 L 319 391 L 336 391 L 353 391 L 353 344 L 353 297 L 336 297 L 319 297 L 319 344Z'
	},
	area_32: {
		href: 'http://sideful.ru',
		title: 'Родео джинс',
		space: '32',
		path: 'M 356 344 L 356 391 L 374 391 L 392 391 L 392 344 L 392 297 L 374 297 L 356 297 L 356 344Z'
	},
	area_33: {
		href: 'http://sideful.ru',
		title: 'The Mix',
		space: '33',
		path: 'M 395 344.5 L 395 391 L 409.5 391 L 424 391 L 424 351.5 L 424 312 L 419 309.8 C 416.3 308.6 414 307.3 414 306.8 C 414 306.4 413.6 306 413.1 306 C 412.6 306 409 304.2 405.1 302 C 401.2 299.8 397.4 298 396.5 298 C 395.2 298 395 303.4 395 344.5Z'
	},
	area_34: {
		href: 'http://sideful.ru',
		title: 'Одежда',
		space: '34',
		path: 'M 427 387 L 427 461 L 443.5 461 L 460 461 L 460 387 L 460 313 L 443.5 313 L 427 313 L 427 387Z'
	},
	area_35: {
		href: 'http://sideful.ru',
		title: 'Спорт России',
		space: '35',
		path: 'M 463 387 L 463 461 L 469.5 461 L 476 461 L 476 454 L 476 447 L 480 447 L 484 447 L 484 427.5 L 484 408 L 490 408 L 496 408 L 496 360.5 L 496 313 L 479.5 313 L 463 313 L 463 387Z'
	},
	area_36: {
		href: 'http://sideful.ru',
		title: 'Avelon',
		space: '36',
		path: 'M 499 360.5 L 499 408 L 515.5 408 L 532 408 L 532 360.5 L 532 313 L 515.5 313 L 499 313 L 499 360.5Z'
	},
	area_37: {
		href: 'http://sideful.ru',
		title: 'Сударь',
		space: '37',
		path: 'M 535 360.5 L 535 408 L 551 408 L 567 408 L 567 360.5 L 567 313 L 551 313 L 535 313 L 535 360.5Z'
	},
	area_38: {
		href: 'http://sideful.ru',
		title: 'Одежда',
		space: '38',
		path: 'M 570 360.5 L 570 408 L 586.5 408 L 603 408 L 603 360.5 L 603 313 L 586.5 313 L 570 313 L 570 360.5Z'
	},
	area_40: {
		href: 'http://sideful.ru',
		title: 'Офиса салон Paris',
		space: '100',
		path: 'M 499 443.5 L 499 461 L 551 461 L 603 461 L 603 443.5 L 603 426 L 551 426 L 499 426 L 499 443.5Z'
	},
	area_41: {
		href: 'http://sideful.ru',
		title: 'Pegas',
		space: '41',
		path: 'M 618 342.5 L 618 392 L 627.5 392 L 637 392 L 637 342.5 L 637 293 L 627.5 293 L 618 293 L 618 342.5Z'
	},
	area_42: {
		href: 'http://sideful.ru',
		title: 'Фэмили',
		space: '42',
		path: 'M 640 344 L 640 395 L 629 395 L 618 395 L 618 419 L 618 443 L 663.5 443 L 709 443 L 709 452 L 709 461 L 727 461 L 745 461 L 745 417 L 745 373 L 727.5 373 L 710 373 L 710 333 L 710 293 L 675 293 L 640 293 L 640 344Z'
	},
	area_43: {
		href: 'http://sideful.ru',
		title: 'Пеплос',
		space: '43',
		path: 'M 713 331.5 L 713 370 L 729 370 L 745 370 L 745 331.5 L 745 293 L 729 293 L 713 293 L 713 331.5Z'
	},
	area_44: {
		href: 'http://sideful.ru',
		title: 'Буква',
		space: '44',
		path: 'M 748 377 L 748 461 L 765 461 L 782 461 L 782 377 L 782 293 L 765 293 L 748 293 L 748 377Z'
	},
	area_45: {
		href: 'http://sideful.ru',
		title: 'АСМ мебель',
		space: '45',
		path: 'M 785 377 L 785 461 L 799 461 L 813 461 L 813 377 L 813 293 L 799 293 L 785 293 L 785 377Z'
	},
	area_46: {
		href: 'http://sideful.ru',
		title: 'Игровая комната',
		space: '46',
		path: 'M 816 377 L 816 461 L 886 461 L 956 461 L 956 408 L 956 355 L 919.5 355 L 883 355 L 883 340 L 883 325 L 867 325 L 851 325 L 851 309 L 851 293 L 833.5 293 L 816 293 L 816 377Z'
	},
	area_48: {
		href: 'http://sideful.ru',
		title: 'Manhattan Pizza',
		space: '48',
		path: 'M 886 322.5 L 886 352 L 903 352 L 920 352 L 920 322.5 L 920 293 L 903 293 L 886 293 L 886 322.5Z'
	},
	area_49: {
		href: 'http://sideful.ru',
		title: 'Блинная Сковорода',
		space: '49',
		path: 'M 923 322.5 L 923 352 L 939.5 352 L 956 352 L 956 322.5 L 956 293 L 939.5 293 L 923 293 L 923 322.5Z'
	},
	/*
	area_3: {
		href: '',
		title: '',
		space: '3',
		path: 'M 409 166.5 L 409 172 L 416.5 172 L 424 172 L 424 166.5 L 424 161 L 416.5 161 L 409 161 L 409 166.5Z'
	},
	area_27: {
		href: '',
		title: '',
		space: '27',
		path: 'M 854 236.5 L 854 290 L 905 290 L 956 290 L 956 236.5 L 956 183 L 905 183 L 854 183 L 854 236.5Z'
	},
	area_39: {
		href: '',
		title: '',
		space: '39',
		path: 'M 479 455.5 L 479 461 L 487.5 461 L 496 461 L 496 455.5 L 496 450 L 487.5 450 L 479 450 L 479 455.5Z'
	},
	area_47: {
		href: '',
		title: '',
		space: '47',
		path: 'M 854 307.5 L 854 322 L 868.5 322 L 883 322 L 883 307.5 L 883 293 L 868.5 293 L 854 293 L 854 307.5Z'
	},
	area_50: {
		href: '',
		title: '',
		space: '50',
		path: 'M 747 76.8 L 747 149.6 L 743.5 149.2 L 740 148.8 L 740 158.9 C 740 167 740.3 169 741.4 169 C 742.2 169 743.5 168.3 744.4 167.5 C 745.2 166.7 746.4 166 747 166 C 747.6 166 748.3 165.3 748.6 164.5 C 749 163.7 749.7 163 750.3 163 C 751.4 163 762.3 155 762.8 153.7 C 763 153.3 763.8 153 764.5 153 C 765.2 153 766 152.7 766.2 152.2 C 766.4 151.8 768.3 150.3 770.6 148.7 C 774.3 146.2 775.4 146 784.3 146 L 794 146 L 794 75 L 794 4 L 770.5 4 L 747 4 L 747 76.8Z'
	},
	*/
}

/* Инициализация скрипта */
if ( $('.scheme').length > 0 ) {
	$('.plan div[data-floor]').each(function() {
		var current = $(this);
		var w = $(this).find('img.bg').attr('width');
		var h = $(this).find('img.bg').attr('height');
		current.css({
			'width': w+'px',
			'height': h+'px'
		});
		var r = Raphael($(this).find('.svg').attr('id'), w, h),
		attributes = {
			fill: 'transparent',
			opacity: 0,
			'stroke-width': 0
		},
		arr = new Array();
		var paths = eval('s'+current.attr('data-building')+'_f'+current.attr('data-floor'));
		for (var shop in paths) {
			var obj = r.path(paths[shop].path);
			obj.attr(attributes);
			arr[obj.id] = shop;
			obj.click(
				function() {
					window.location.href = paths[arr[this.id]].href;
				}
			);
		}
	});
	$('.scheme .plan ul.nav li a').bind('click', function(event) {
		$(this).parents('.plan').children('div[data-floor="'+$(this).attr('href')+'"]').show().addClass('active').siblings('div[data-floor]').removeClass('active').hide();
		$(this).parent().addClass('active').siblings().removeClass();
		event.preventDefault();
	}).filter(':first').click();
	function imageExists(image_url){
		var http = new XMLHttpRequest();
		http.open('HEAD', image_url, false);
		http.send();
		return http.status != 404;
	}
	$('.scheme .legend ul li span').bind('click', function(event) {
		var current = $(this).parents('.scheme').find('.plan').children('div');
		var type = $(this).attr('class');
		$.get('./maps/scheme/'+current.attr('data-building')+'/floor'+current.attr('data-floor')+'/hover/'+type+'.png').done(function() {
			current.find('.hover').remove();
			current.find('.layers').append('<img src="./maps/scheme/'+current.attr('data-building')+'/floor'+current.attr('data-floor')+'/hover/'+type+'.png" class="hover" alt="">');
		}).fail(function() { 
			current.find('.hover').remove();
		});
		event.preventDefault();
	});
}